[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:27:37
 // ---------------------------------------------------------------------------
 
 /** Create zeroed SessionMetrics for a new session. */
-export const createInitialMetrics = (sessionId: string, sessionLabel = ""): SessionMetrics => ({
-  sessionId,
-  sessionLabel,
-  totalTokens: 0,
-  inputTokens: 0,
-  outputTokens: 0,
-  sessionCost: 0,
-  toolCallCount: 0,
-  activeAgentCount: 0,
-  contextWindowPct: 0,
-  contextWindowTokens: 0,
-  contextWindowMaxTokens: 0,
-  contextWindowModel: "",
-  hookEventCount: 0,
-  sessionStartedAt: "",
-  lastEventAt: "",
-  burnRate: 0,
-});
+export const createInitialMetrics = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: createInitialMetrics produces zeroed metrics with the given session id
statusReason: Property failed after 1 tests
{ seed: -1281299793, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:42:16
   contextWindowModel: "",
   hookEventCount: 0,
   sessionStartedAt: "",
-  lastEventAt: "",
+  lastEventAt: "Stryker was here!",
   burnRate: 0,
 });
killedBy: createInitialMetrics produces zeroed metrics with the given session id
statusReason: Property failed after 1 tests
{ seed: 182717693, path: "0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:62:10
   const { usage } = extraction;
   const cost = calculateCost(usage, pricingTable);
 
-  return {
-    ...metrics,
-    totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
-    inputTokens: metrics.inputTokens + usage.inputTokens,
-    outputTokens: metrics.outputTokens + usage.outputTokens,
-    sessionCost: Math.max(0, metrics.sessionCost + cost.totalCost),
-  };
+  return {};
 };
 
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -1339621491, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:72:66
 };
 
 /** Extract cost_usd from payload.usage if present as a number (including 0.0). */
-const extractCostUsd = (payload: unknown): number | undefined => {
-  if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
-  const record = payload as Record<string, unknown>;
-  const usageField = record["usage"];
-  if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
-  const usage = usageField as Record<string, unknown>;
-  const costUsd = usage["cost_usd"];
-  return typeof costUsd === "number" ? costUsd : undefined;
-};
+const extractCostUsd = (payload: unknown): number | undefined => {};
 
 /** Apply token and cost updates for api_request events (OTel).
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:76:7
   if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
   const record = payload as Record<string, unknown>;
   const usageField = record["usage"];
-  if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
+  if (true) return undefined;
   const usage = usageField as Record<string, unknown>;
   const costUsd = usage["cost_usd"];
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:79:10
   if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
   const costUsd = usage["cost_usd"];
-  return typeof costUsd === "number" ? costUsd : undefined;
+  return false ? costUsd : undefined;
 };
 
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:79:10
   if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
   const costUsd = usage["cost_usd"];
-  return typeof costUsd === "number" ? costUsd : undefined;
+  return true ? costUsd : undefined;
 };
 
killedBy: api_request with non-number cost_usd falls back to pricing model cost_usd as string falls back to pricing model calculation
statusReason: expected NaN to be close to 0.0105, received difference is NaN, but expected 5e-7

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:94:16
 
   const { usage } = extraction;
   const costUsd = extractCostUsd(payload);
-  const cost = costUsd !== undefined ? costUsd : calculateCost(usage, pricingTable).totalCost;
+  const cost = false ? costUsd : calculateCost(usage, pricingTable).totalCost;
 
   return {
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] ObjectLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:115:23
 const applySessionStart = (
   metrics: SessionMetrics,
   receivedAt: string,
-): SessionMetrics => ({
-  ...metrics,
-  activeAgentCount: metrics.activeAgentCount + 1,
-  sessionStartedAt: metrics.sessionStartedAt === "" ? receivedAt : metrics.sessionStartedAt,
-});
+): SessionMetrics => ({});
 
 /** Decrement active agent count, floored at 0. */
killedBy: session_start increments active agent count each session_start adds one to activeAgentCount
statusReason: Property failed after 1 tests
{ seed: -279435411, path: "0:0", endOnFailure: true }
Counterexample: [0,{"eventType":"session_start","payload":{},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/metricsAggregator.ts:118:21
 ): SessionMetrics => ({
   ...metrics,
   activeAgentCount: metrics.activeAgentCount + 1,
-  sessionStartedAt: metrics.sessionStartedAt === "" ? receivedAt : metrics.sessionStartedAt,
+  sessionStartedAt: metrics.sessionStartedAt !== "" ? receivedAt : metrics.sessionStartedAt,
 });
 
killedBy: session_start increments active agent count sets sessionStartedAt on first session_start event
statusReason: expected '' not to be '' // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:128:27
 });
 
 /** Apply common bookkeeping: increment hookEventCount, update lastEventAt. */
-const applyCommonFields = (
-  metrics: SessionMetrics,
-  receivedAt: string,
-): SessionMetrics => ({
-  ...metrics,
-  hookEventCount: metrics.hookEventCount + 1,
-  lastEventAt: receivedAt,
-});
+const applyCommonFields = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: 2019143038, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:133:19
   receivedAt: string,
 ): SessionMetrics => ({
   ...metrics,
-  hookEventCount: metrics.hookEventCount + 1,
+  hookEventCount: metrics.hookEventCount - 1,
   lastEventAt: receivedAt,
 });
killedBy: every event increments hookEventCount and updates lastEventAt hookEventCount increments by one for any event type
statusReason: Property failed after 1 tests
{ seed: -444576014, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:158:5
 const eventHandlers: Record<
   string,
   (metrics: SessionMetrics, event: AggregatorEvent, pricingTable: PricingTable) => SessionMetrics
-> = {
-  prompt_submit: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
-
-  tool_call_end: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
-
-  tool_call_start: (metrics) =>
-    applyToolCallStart(metrics),
-
-  session_start: (metrics, event) =>
-    applySessionStart(metrics, event.receivedAt),
-
-  agent_complete: (metrics, event, pricingTable) =>
-    applyAgentCompleteCount(applyTokenUsage(metrics, event.payload, pricingTable)),
-
-  // OTel event types
-  api_request: (metrics, event, pricingTable) =>
-    applyApiRequestTokenUsage(metrics, event.payload, pricingTable),
-
-  user_prompt: (metrics) => metrics,
-  tool_result: (metrics) => metrics,
-  api_error: (metrics) => metrics,
-  tool_decision: (metrics) => metrics,
-};
+> = {};
 
 /** Identity handler for unknown event types: only common fields updated. */
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -1530652827, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 21 time(s)

Hint: Enable verbose mode in order to have the list of all failing values enco

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:159:18
   string,
   (metrics: SessionMetrics, event: AggregatorEvent, pricingTable: PricingTable) => SessionMetrics
 > = {
-  prompt_submit: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
+  prompt_submit: () => undefined,
 
   tool_call_end: (metrics, event, pricingTable) =>
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: 913106792, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:175:16
     applyAgentCompleteCount(applyTokenUsage(metrics, event.payload, pricingTable)),
 
   // OTel event types
-  api_request: (metrics, event, pricingTable) =>
-    applyApiRequestTokenUsage(metrics, event.payload, pricingTable),
+  api_request: () => undefined,
 
   user_prompt: (metrics) => metrics,
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: Cannot read properties of undefined (reading 'hookEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:178:16
   api_request: (metrics, event, pricingTable) =>
     applyApiRequestTokenUsage(metrics, event.payload, pricingTable),
 
-  user_prompt: (metrics) => metrics,
+  user_prompt: () => undefined,
   tool_result: (metrics) => metrics,
   api_error: (metrics) => metrics,
killedBy: OTel identity event types increment hookEventCount only user_prompt increments hookEventCount and does not affect tokens or cost
statusReason: Cannot read properties of undefined (reading 'hookEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:179:16
     applyApiRequestTokenUsage(metrics, event.payload, pricingTable),
 
   user_prompt: (metrics) => metrics,
-  tool_result: (metrics) => metrics,
+  tool_result: () => undefined,
   api_error: (metrics) => metrics,
   tool_decision: (metrics) => metrics,
killedBy: OTel identity event types increment hookEventCount only tool_result increments hookEventCount and does not affect tokens or cost
statusReason: Cannot read properties of undefined (reading 'hookEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:180:14
 
   user_prompt: (metrics) => metrics,
   tool_result: (metrics) => metrics,
-  api_error: (metrics) => metrics,
+  api_error: () => undefined,
   tool_decision: (metrics) => metrics,
 };
killedBy: OTel identity event types increment hookEventCount only api_error increments hookEventCount and does not affect tokens or cost
statusReason: Cannot read properties of undefined (reading 'hookEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:181:18
   user_prompt: (metrics) => metrics,
   tool_result: (metrics) => metrics,
   api_error: (metrics) => metrics,
-  tool_decision: (metrics) => metrics,
+  tool_decision: () => undefined,
 };
 
killedBy: OTel identity event types increment hookEventCount only tool_decision increments hookEventCount and does not affect tokens or cost
statusReason: Cannot read properties of undefined (reading 'hookEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:185:25
 };
 
 /** Identity handler for unknown event types: only common fields updated. */
-const identityHandler = (metrics: SessionMetrics): SessionMetrics => metrics;
+const identityHandler = () => undefined;
 
 export const aggregateEvent = (
killedBy: hookProcessor with non-token events unknown event type still increments hookEventCount
statusReason: Cannot read properties of undefined (reading 'hookEventCount')

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:191:22
   previous: SessionMetrics,
   event: AggregatorEvent,
   pricingTable: PricingTable,
-): SessionMetrics => {
-  const handler = eventHandlers[event.eventType] ?? identityHandler;
-  const updated = handler(previous, event, pricingTable);
-  return applyCommonFields(updated, event.receivedAt);
-};
+): SessionMetrics => {};
 
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: 567945870, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
plugins/norbert-usage/domain/metricsAggregator.ts:192:19
   event: AggregatorEvent,
   pricingTable: PricingTable,
 ): SessionMetrics => {
-  const handler = eventHandlers[event.eventType] ?? identityHandler;
+  const handler = eventHandlers[event.eventType] && identityHandler;
   const updated = handler(previous, event, pricingTable);
   return applyCommonFields(updated, event.receivedAt);
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -1904460732, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 21 time(s)

Hint: Enable verbose mode in order to have the list of all failing values enco
