[Killed] StringLiteral
src/domain/otelDetection.ts:21:32
 // ---------------------------------------------------------------------------
 
 /** The event type that indicates OTel-sourced data. */
-export const OTEL_EVENT_TYPE = "api_request";
+export const OTEL_EVENT_TYPE = "";
 
 /**
killedBy: isOtelActiveSession returns true even with a single api_request event among many others
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/domain/otelDetection.ts:32:36
  *
  * Pure function: (events) => boolean
  */
-export const isOtelActiveSession = (
-  events: ReadonlyArray<SessionEvent>,
-): boolean => events.some((event) => event.event_type === OTEL_EVENT_TYPE);
+export const isOtelActiveSession = () => undefined;
 
killedBy: isOtelActiveSession returns true when session has at least one api_request event
statusReason: Property failed after 1 tests
{ seed: -1328916232, path: "0:0:0", endOnFailure: true }
Counterexample: [[],[]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/domain/otelDetection.ts:34:38
  */
 export const isOtelActiveSession = (
   events: ReadonlyArray<SessionEvent>,
-): boolean => events.some((event) => event.event_type === OTEL_EVENT_TYPE);
+): boolean => events.some((event) => true);
 
killedBy: isOtelActiveSession returns false when session has no api_request events
statusReason: Property failed after 1 tests
{ seed: -361308637, path: "0:1:0:0:0:1", endOnFailure: true }
Counterexample: [[{"event_type":" "}]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/domain/otelDetection.ts:34:27
  */
 export const isOtelActiveSession = (
   events: ReadonlyArray<SessionEvent>,
-): boolean => events.some((event) => event.event_type === OTEL_EVENT_TYPE);
+): boolean => events.some(() => undefined);
 
killedBy: isOtelActiveSession returns true when session has at least one api_request event
statusReason: Property failed after 1 tests
{ seed: 2065333004, path: "0:0:0", endOnFailure: true }
Counterexample: [[],[]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
