[Killed] BlockStatement
domain/references/detection/applyAnnotation.ts:29:57
  *   - dead | unsupported -> empty string (no registry entry to point at;
  *                  renderers key off raw-text and target-path instead)
  */
-function deriveTargetKey(resolved: ResolvedRef): string {
-  if (resolved.tag === "live") {
-    return resolved.entry.itemKey;
-  }
-  if (resolved.tag === "ambiguous") {
-    return resolved.candidates[0]?.itemKey ?? "";
-  }
-  return "";
-}
+function deriveTargetKey(resolved: ResolvedRef): string {}
 
 /**
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'agent:project:nw-solution-architect' // Object.is equality

[Killed] EqualityOperator
domain/references/detection/applyAnnotation.ts:30:7
  *                  renderers key off raw-text and target-path instead)
  */
 function deriveTargetKey(resolved: ResolvedRef): string {
-  if (resolved.tag === "live") {
+  if (resolved.tag !== "live") {
     return resolved.entry.itemKey;
   }
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected '' to be 'agent:project:nw-solution-architect' // Object.is equality

[Killed] BlockStatement
domain/references/detection/applyAnnotation.ts:30:32
  *                  renderers key off raw-text and target-path instead)
  */
 function deriveTargetKey(resolved: ResolvedRef): string {
-  if (resolved.tag === "live") {
-    return resolved.entry.itemKey;
-  }
+  if (resolved.tag === "live") {}
   if (resolved.tag === "ambiguous") {
     return resolved.candidates[0]?.itemKey ?? "";
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected '' to be 'agent:project:nw-solution-architect' // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/applyAnnotation.ts:33:7
   if (resolved.tag === "live") {
     return resolved.entry.itemKey;
   }
-  if (resolved.tag === "ambiguous") {
+  if (true) {
     return resolved.candidates[0]?.itemKey ?? "";
   }
killedBy: Reference to a missing item renders as a dead token detection over a markdown link to a non-existent skill produces a dead token annotation
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
domain/references/detection/applyAnnotation.ts:33:37
   if (resolved.tag === "live") {
     return resolved.entry.itemKey;
   }
-  if (resolved.tag === "ambiguous") {
-    return resolved.candidates[0]?.itemKey ?? "";
-  }
+  if (resolved.tag === "ambiguous") {}
   return "";
 }
killedBy: Reference resolving to multiple items renders as an ambiguous token detection over inline code 'release' produces an ambiguous token when 'release' exists in 2+ scopes
statusReason: expected '' to be 'command:project:release' // Object.is equality

[Killed] LogicalOperator
domain/references/detection/applyAnnotation.ts:34:12
     return resolved.entry.itemKey;
   }
   if (resolved.tag === "ambiguous") {
-    return resolved.candidates[0]?.itemKey ?? "";
+    return resolved.candidates[0]?.itemKey && "";
   }
   return "";
killedBy: Reference resolving to multiple items renders as an ambiguous token detection over inline code 'release' produces an ambiguous token when 'release' exists in 2+ scopes
statusReason: expected '' to be 'command:project:release' // Object.is equality

[Survived] OptionalChaining
domain/references/detection/applyAnnotation.ts:34:12
     return resolved.entry.itemKey;
   }
   if (resolved.tag === "ambiguous") {
-    return resolved.candidates[0]?.itemKey ?? "";
+    return resolved.candidates[0].itemKey ?? "";
   }
   return "";

[Killed] BlockStatement
domain/references/detection/applyAnnotation.ts:56:9
   resolved: ResolvedRef,
   rawText: string,
   extras: Readonly<Record<string, string | number>> = {},
-): void {
-  const hProperties: ReferenceTokenData["hProperties"] = {
-    "data-ref-variant": resolved.tag,
-    "data-ref-target-key": deriveTargetKey(resolved),
-    "data-ref-raw-text": rawText,
-    ...extras,
-  };
-
-  const existing = (node.data ?? {}) as Record<string, unknown>;
-  node.data = {
-    ...existing,
-    hName: "reference-token",
-    hProperties,
-  };
-}
+): void {}
 
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] ObjectLiteral
domain/references/detection/applyAnnotation.ts:65:15
   };
 
   const existing = (node.data ?? {}) as Record<string, unknown>;
-  node.data = {
-    ...existing,
-    hName: "reference-token",
-    hProperties,
-  };
+  node.data = {};
 }
 
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality
