[Killed] BlockStatement
domain/references/detection/inlineCodeStrategy.ts:40:74
  */
 function isInlineCodeNode(
   node: MdastNode,
-): node is MdastNode & { value: string; data?: Record<string, unknown> } {
-  return (
-    node.type === "inlineCode" &&
-    typeof (node as { value?: unknown }).value === "string"
-  );
-}
+): node is MdastNode & { value: string; data?: Record<string, unknown> } {}
 
 export const inlineCodeStrategy: DetectionStrategy = {
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/inlineCodeStrategy.ts:42:5
   node: MdastNode,
 ): node is MdastNode & { value: string; data?: Record<string, unknown> } {
   return (
-    node.type === "inlineCode" &&
-    typeof (node as { value?: unknown }).value === "string"
+    true
   );
 }
killedBy: Each strategy short-circuits on nodes its guard does not match inlineCodeStrategy.apply ignores a non-inlineCode node even when it carries a string value field matching a registry name
statusReason: expected { hName: 'reference-token', …(1) } to be undefined

[Killed] ConditionalExpression
domain/references/detection/inlineCodeStrategy.ts:42:5
   node: MdastNode,
 ): node is MdastNode & { value: string; data?: Record<string, unknown> } {
   return (
-    node.type === "inlineCode" &&
+    true &&
     typeof (node as { value?: unknown }).value === "string"
   );
killedBy: Each strategy short-circuits on nodes its guard does not match inlineCodeStrategy.apply ignores a non-inlineCode node even when it carries a string value field matching a registry name
statusReason: expected { hName: 'reference-token', …(1) } to be undefined

[Killed] EqualityOperator
domain/references/detection/inlineCodeStrategy.ts:43:5
 ): node is MdastNode & { value: string; data?: Record<string, unknown> } {
   return (
     node.type === "inlineCode" &&
-    typeof (node as { value?: unknown }).value === "string"
+    typeof (node as {
+  value?: unknown;
+}).value !== "string"
   );
 }
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Survived] ConditionalExpression
domain/references/detection/inlineCodeStrategy.ts:43:5
 ): node is MdastNode & { value: string; data?: Record<string, unknown> } {
   return (
     node.type === "inlineCode" &&
-    typeof (node as { value?: unknown }).value === "string"
+    true
   );
 }

[Killed] BlockStatement
domain/references/detection/inlineCodeStrategy.ts:52:8
     node: MdastNode,
     registry: ReferenceRegistry,
     _ctx: DetectionContext,
-  ) => {
-    if (!isInlineCodeNode(node)) {
-      return;
-    }
-
-    const rawText = node.value;
-    const resolved = resolve({ kind: "name", value: rawText }, registry);
-
-    // No registry hit: leave the node untouched. Inline code that doesn't
-    // match any item is plain code, not a reference.
-    if (resolved.tag === "dead") {
-      return;
-    }
-
-    const extras: Record<string, string | number> =
-      resolved.tag === "ambiguous"
-        ? { "data-ref-candidate-count": resolved.candidates.length }
-        : {};
-
-    applyTokenAnnotation(node, resolved, rawText, extras);
-  },
+  ) => {},
 };
 
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] BlockStatement
domain/references/detection/inlineCodeStrategy.ts:53:34
     registry: ReferenceRegistry,
     _ctx: DetectionContext,
   ) => {
-    if (!isInlineCodeNode(node)) {
-      return;
-    }
+    if (!isInlineCodeNode(node)) {}
 
     const rawText = node.value;
killedBy: Each strategy short-circuits on nodes its guard does not match inlineCodeStrategy.apply ignores a non-inlineCode node even when it carries a string value field matching a registry name
statusReason: expected { hName: 'reference-token', …(1) } to be undefined

[Killed] BooleanLiteral
domain/references/detection/inlineCodeStrategy.ts:53:9
     registry: ReferenceRegistry,
     _ctx: DetectionContext,
   ) => {
-    if (!isInlineCodeNode(node)) {
+    if (isInlineCodeNode(node)) {
       return;
     }
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] ObjectLiteral
domain/references/detection/inlineCodeStrategy.ts:58:30
     }
 
     const rawText = node.value;
-    const resolved = resolve({ kind: "name", value: rawText }, registry);
+    const resolved = resolve({}, registry);
 
     // No registry hit: leave the node untouched. Inline code that doesn't
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'live' // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/inlineCodeStrategy.ts:62:9
 
     // No registry hit: leave the node untouched. Inline code that doesn't
     // match any item is plain code, not a reference.
-    if (resolved.tag === "dead") {
+    if (true) {
       return;
     }
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] BlockStatement
domain/references/detection/inlineCodeStrategy.ts:62:34
 
     // No registry hit: leave the node untouched. Inline code that doesn't
     // match any item is plain code, not a reference.
-    if (resolved.tag === "dead") {
-      return;
-    }
+    if (resolved.tag === "dead") {}
 
     const extras: Record<string, string | number> =
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected 'reference-token' to be undefined

[Killed] EqualityOperator
domain/references/detection/inlineCodeStrategy.ts:67:7
     }
 
     const extras: Record<string, string | number> =
-      resolved.tag === "ambiguous"
+      resolved.tag !== "ambiguous"
         ? { "data-ref-candidate-count": resolved.candidates.length }
         : {};
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
domain/references/detection/inlineCodeStrategy.ts:67:7
     }
 
     const extras: Record<string, string | number> =
-      resolved.tag === "ambiguous"
+      true
         ? { "data-ref-candidate-count": resolved.candidates.length }
         : {};
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: Cannot read properties of undefined (reading 'length')
