[Killed] BlockStatement
domain/references/detection/markdownLinkStrategy.ts:44:72
  */
 function isLinkNode(
   node: MdastNode,
-): node is MdastNode & { url: string; data?: Record<string, unknown> } {
-  return (
-    node.type === "link" &&
-    typeof (node as { url?: unknown }).url === "string"
-  );
-}
+): node is MdastNode & { url: string; data?: Record<string, unknown> } {}
 
 export const markdownLinkStrategy: DetectionStrategy = {
killedBy: Markdown link to a known skill renders as a live cross-reference token detection over [nw-bdd-requirements](~/.claude/skills/nw-bdd-requirements/SKILL.md) produces a live token annotation
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/markdownLinkStrategy.ts:46:5
   node: MdastNode,
 ): node is MdastNode & { url: string; data?: Record<string, unknown> } {
   return (
-    node.type === "link" &&
-    typeof (node as { url?: unknown }).url === "string"
+    true
   );
 }
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
domain/references/detection/markdownLinkStrategy.ts:46:5
   node: MdastNode,
 ): node is MdastNode & { url: string; data?: Record<string, unknown> } {
   return (
-    node.type === "link" &&
+    true &&
     typeof (node as { url?: unknown }).url === "string"
   );
killedBy: Each strategy short-circuits on nodes its guard does not match markdownLinkStrategy.apply ignores a non-link node even when it carries a string url field that resolves through the registry
statusReason: expected { hName: 'reference-token', …(1) } to be undefined

[Killed] EqualityOperator
domain/references/detection/markdownLinkStrategy.ts:47:5
 ): node is MdastNode & { url: string; data?: Record<string, unknown> } {
   return (
     node.type === "link" &&
-    typeof (node as { url?: unknown }).url === "string"
+    typeof (node as {
+  url?: unknown;
+}).url !== "string"
   );
 }
killedBy: Markdown link to a known skill renders as a live cross-reference token detection over [nw-bdd-requirements](~/.claude/skills/nw-bdd-requirements/SKILL.md) produces a live token annotation
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/markdownLinkStrategy.ts:47:5
 ): node is MdastNode & { url: string; data?: Record<string, unknown> } {
   return (
     node.type === "link" &&
-    typeof (node as { url?: unknown }).url === "string"
+    true
   );
 }
killedBy: Each strategy short-circuits on nodes its guard does not match markdownLinkStrategy.apply ignores a link-typed node whose url field is missing entirely
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ObjectLiteral
domain/references/detection/markdownLinkStrategy.ts:51:56
   );
 }
 
-export const markdownLinkStrategy: DetectionStrategy = {
-  apply: (
-    node: MdastNode,
-    registry: ReferenceRegistry,
-    _ctx: DetectionContext,
-  ) => {
-    if (!isLinkNode(node)) {
-      return;
-    }
-
-    const href = node.url;
-    const resolved = resolve({ kind: "path", value: href }, registry);
-
-    const extras: Record<string, string | number> =
-      resolved.tag === "unsupported"
-        ? { "data-ref-target-path": resolved.path }
-        : {};
-
-    applyTokenAnnotation(node, resolved, href, extras);
-  },
-};
+export const markdownLinkStrategy: DetectionStrategy = {};
 
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: strategy.apply is not a function

[Killed] BlockStatement
domain/references/detection/markdownLinkStrategy.ts:56:8
     node: MdastNode,
     registry: ReferenceRegistry,
     _ctx: DetectionContext,
-  ) => {
-    if (!isLinkNode(node)) {
-      return;
-    }
-
-    const href = node.url;
-    const resolved = resolve({ kind: "path", value: href }, registry);
-
-    const extras: Record<string, string | number> =
-      resolved.tag === "unsupported"
-        ? { "data-ref-target-path": resolved.path }
-        : {};
-
-    applyTokenAnnotation(node, resolved, href, extras);
-  },
+  ) => {},
 };
 
killedBy: Markdown link to a known skill renders as a live cross-reference token detection over [nw-bdd-requirements](~/.claude/skills/nw-bdd-requirements/SKILL.md) produces a live token annotation
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/markdownLinkStrategy.ts:57:9
     registry: ReferenceRegistry,
     _ctx: DetectionContext,
   ) => {
-    if (!isLinkNode(node)) {
+    if (true) {
       return;
     }
killedBy: Markdown link to a known skill renders as a live cross-reference token detection over [nw-bdd-requirements](~/.claude/skills/nw-bdd-requirements/SKILL.md) produces a live token annotation
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] BlockStatement
domain/references/detection/markdownLinkStrategy.ts:57:28
     registry: ReferenceRegistry,
     _ctx: DetectionContext,
   ) => {
-    if (!isLinkNode(node)) {
-      return;
-    }
+    if (!isLinkNode(node)) {}
 
     const href = node.url;
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ObjectLiteral
domain/references/detection/markdownLinkStrategy.ts:62:30
     }
 
     const href = node.url;
-    const resolved = resolve({ kind: "path", value: href }, registry);
+    const resolved = resolve({}, registry);
 
     const extras: Record<string, string | number> =
killedBy: Markdown link to a known skill renders as a live cross-reference token detection over [nw-bdd-requirements](~/.claude/skills/nw-bdd-requirements/SKILL.md) produces a live token annotation
statusReason: expected undefined to be 'live' // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/markdownLinkStrategy.ts:65:7
     const resolved = resolve({ kind: "path", value: href }, registry);
 
     const extras: Record<string, string | number> =
-      resolved.tag === "unsupported"
+      true
         ? { "data-ref-target-path": resolved.path }
         : {};
killedBy: Markdown link to a known skill renders as a live cross-reference token detection over [nw-bdd-requirements](~/.claude/skills/nw-bdd-requirements/SKILL.md) produces a live token annotation
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
domain/references/detection/markdownLinkStrategy.ts:65:7
     const resolved = resolve({ kind: "path", value: href }, registry);
 
     const extras: Record<string, string | number> =
-      resolved.tag === "unsupported"
+      false
         ? { "data-ref-target-path": resolved.path }
         : {};
killedBy: Reference to an unsupported item type renders as an unsupported token detection over a markdown link whose path resolves to an item type the plugin does not expose produces an unsupported token annota
statusReason: expected undefined to be '~/.claude/unknown-kind/foo.bin' // Object.is equality
