[Killed] BlockStatement
domain/references/detection/pipeline.ts:35:22
 
 export function composePipeline(
   strategies: readonly DetectionStrategy[],
-): DetectionStrategy {
-  return {
-    apply: (
-      node: MdastNode,
-      registry: ReferenceRegistry,
-      ctx: DetectionContext,
-    ) => {
-      for (const strategy of strategies) {
-        strategy.apply(node, registry, ctx);
-      }
-    },
-  };
-}
+): DetectionStrategy {}
 
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: Cannot read properties of undefined (reading 'apply')

[Killed] BlockStatement
domain/references/detection/pipeline.ts:41:10
       node: MdastNode,
       registry: ReferenceRegistry,
       ctx: DetectionContext,
-    ) => {
-      for (const strategy of strategies) {
-        strategy.apply(node, registry, ctx);
-      }
-    },
+    ) => {},
   };
 }
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] BlockStatement
domain/references/detection/pipeline.ts:42:42
       registry: ReferenceRegistry,
       ctx: DetectionContext,
     ) => {
-      for (const strategy of strategies) {
-        strategy.apply(node, registry, ctx);
-      }
+      for (const strategy of strategies) {}
     },
   };
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality
