[Killed] BlockStatement
domain/references/detection/remarkPlugin.ts:31:35
 export function detectionRemarkPlugin(
   registry: ReferenceRegistry,
   ctx: DetectionContext,
-): (tree: MdastNode) => MdastNode {
-  const composed = composePipeline(DETECTION_PIPELINE);
-  return (tree: MdastNode) => {
-    visit(tree, (node) => {
-      composed.apply(node, registry, ctx);
-    });
-    return tree;
-  };
-}
+): (tree: MdastNode) => MdastNode {}
 
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: (0 , __vite_ssr_import_5__.detectionRemarkPlugin)(...) is not a function

[Killed] BlockStatement
domain/references/detection/remarkPlugin.ts:33:31
   ctx: DetectionContext,
 ): (tree: MdastNode) => MdastNode {
   const composed = composePipeline(DETECTION_PIPELINE);
-  return (tree: MdastNode) => {
-    visit(tree, (node) => {
-      composed.apply(node, registry, ctx);
-    });
-    return tree;
-  };
+  return (tree: MdastNode) => {};
 }
 
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality

[Killed] BlockStatement
domain/references/detection/remarkPlugin.ts:34:27
 ): (tree: MdastNode) => MdastNode {
   const composed = composePipeline(DETECTION_PIPELINE);
   return (tree: MdastNode) => {
-    visit(tree, (node) => {
-      composed.apply(node, registry, ctx);
-    });
+    visit(tree, (node) => {});
     return tree;
   };
killedBy: Inline code matching a known agent renders as a live cross-reference token detection over inline code 'nw-solution-architect' produces a token annotation when the agent exists in the registry
statusReason: expected undefined to be 'reference-token' // Object.is equality
