[Killed] ArrayDeclaration
norbert-config/domain/nav/history.ts:48:12
  * (ADR-006 invariants).
  */
 export const emptyHistory: NavHistory = {
-  entries: [],
+  entries: ["Stryker was here"],
   headIndex: -1,
 };
killedBy: emptyHistory sentinel encodes the no-head-yet state emptyHistory has zero entries and headIndex=-1
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] UnaryOperator
norbert-config/domain/nav/history.ts:49:14
  */
 export const emptyHistory: NavHistory = {
   entries: [],
-  headIndex: -1,
+  headIndex: +1,
 };
 
killedBy: emptyHistory sentinel encodes the no-head-yet state emptyHistory has zero entries and headIndex=-1
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/history.ts:61:75
  * {@link MAX_HISTORY_ENTRIES} survive. No-op when already within the cap.
  * The newest entry (caller-appended at the tail) is always retained as head.
  */
-function enforceLruCap(entries: readonly NavEntry[]): readonly NavEntry[] {
-  return entries.length > MAX_HISTORY_ENTRIES
-    ? entries.slice(entries.length - MAX_HISTORY_ENTRIES)
-    : entries;
-}
+function enforceLruCap(entries: readonly NavEntry[]): readonly NavEntry[] {}
 
 /**
killedBy: A new cross-reference action after Alt+Left clears the forward stack pushEntry on a history with headIndex < entries.length-1 truncates the tail before pushing
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
norbert-config/domain/nav/history.ts:62:10
  * The newest entry (caller-appended at the tail) is always retained as head.
  */
 function enforceLruCap(entries: readonly NavEntry[]): readonly NavEntry[] {
-  return entries.length > MAX_HISTORY_ENTRIES
+  return entries.length <= MAX_HISTORY_ENTRIES
     ? entries.slice(entries.length - MAX_HISTORY_ENTRIES)
     : entries;
killedBy: LRU eviction at cap of 50 evicts the oldest entry and shifts headIndex pushEntry on a 50-entry history at headIndex=49 evicts entries[0] and stays at headIndex=49
statusReason: expected 51 to be 50 // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/nav/history.ts:62:10
  * The newest entry (caller-appended at the tail) is always retained as head.
  */
 function enforceLruCap(entries: readonly NavEntry[]): readonly NavEntry[] {
-  return entries.length > MAX_HISTORY_ENTRIES
+  return false
     ? entries.slice(entries.length - MAX_HISTORY_ENTRIES)
     : entries;
killedBy: For any sequence of navigation actions the history never exceeds 50 entries property: |entries| <= 50 and 0 <= headIndex < |entries| after any sequence of pushEntry/goBack/goForward
statusReason: Property failed after 1 tests
Shrunk 134 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
norbert-config/domain/nav/history.ts:63:21
  */
 function enforceLruCap(entries: readonly NavEntry[]): readonly NavEntry[] {
   return entries.length > MAX_HISTORY_ENTRIES
-    ? entries.slice(entries.length - MAX_HISTORY_ENTRIES)
+    ? entries.slice(entries.length + MAX_HISTORY_ENTRIES)
     : entries;
 }
killedBy: LRU eviction at cap of 50 evicts the oldest entry and shifts headIndex pushEntry on a 50-entry history at headIndex=49 evicts entries[0] and stays at headIndex=49
statusReason: expected +0 to be 50 // Object.is equality

[Killed] MethodExpression
norbert-config/domain/nav/history.ts:63:7
  */
 function enforceLruCap(entries: readonly NavEntry[]): readonly NavEntry[] {
   return entries.length > MAX_HISTORY_ENTRIES
-    ? entries.slice(entries.length - MAX_HISTORY_ENTRIES)
+    ? entries
     : entries;
 }
killedBy: For any sequence of navigation actions the history never exceeds 50 entries property: |entries| <= 50 and 0 <= headIndex < |entries| after any sequence of pushEntry/goBack/goForward
statusReason: Property failed after 1 tests
Shrunk 167 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
norbert-config/domain/nav/history.ts:74:77
  * entries are dropped from the front (LRU eviction per ADR-006). The new
  * entry is always the head, so `headIndex` ends at `entries.length - 1`.
  */
-export function pushEntry(history: NavHistory, entry: NavEntry): NavHistory {
-  const retained = history.entries.slice(0, history.headIndex + 1);
-  const withNewHead = [...retained, entry];
-  const capped = enforceLruCap(withNewHead);
-  return {
-    entries: capped,
-    headIndex: capped.length - 1,
-  };
-}
+export function pushEntry(history: NavHistory, entry: NavEntry): NavHistory {}
 
 /**
killedBy: A new cross-reference action after Alt+Left clears the forward stack pushEntry on a history with headIndex < entries.length-1 truncates the tail before pushing
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] MethodExpression
norbert-config/domain/nav/history.ts:75:20
  * entry is always the head, so `headIndex` ends at `entries.length - 1`.
  */
 export function pushEntry(history: NavHistory, entry: NavEntry): NavHistory {
-  const retained = history.entries.slice(0, history.headIndex + 1);
+  const retained = history.entries;
   const withNewHead = [...retained, entry];
   const capped = enforceLruCap(withNewHead);
killedBy: A new cross-reference action after Alt+Left clears the forward stack pushEntry on a history with headIndex < entries.length-1 truncates the tail before pushing
statusReason: expected [ { k: 'e0' }, { k: 'e1' }, …(3) ] to deeply equal [ { k: 'e0' }, { k: 'e1' }, …(2) ]

[Killed] ArithmeticOperator
norbert-config/domain/nav/history.ts:75:45
  * entry is always the head, so `headIndex` ends at `entries.length - 1`.
  */
 export function pushEntry(history: NavHistory, entry: NavEntry): NavHistory {
-  const retained = history.entries.slice(0, history.headIndex + 1);
+  const retained = history.entries.slice(0, history.headIndex - 1);
   const withNewHead = [...retained, entry];
   const capped = enforceLruCap(withNewHead);
killedBy: A new cross-reference action after Alt+Left clears the forward stack pushEntry on a history with headIndex < entries.length-1 truncates the tail before pushing
statusReason: expected [ { k: 'e0' }, { k: 'e4' } ] to deeply equal [ { k: 'e0' }, { k: 'e1' }, …(2) ]

[Killed] ArithmeticOperator
norbert-config/domain/nav/history.ts:80:16
   const capped = enforceLruCap(withNewHead);
   return {
     entries: capped,
-    headIndex: capped.length - 1,
+    headIndex: capped.length + 1,
   };
 }
killedBy: A new cross-reference action after Alt+Left clears the forward stack pushEntry on a history with headIndex < entries.length-1 truncates the tail before pushing
statusReason: expected 5 to be 3 // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/history.ts:88:57
  * Move the head one step back. No-op when already at the start (headIndex
  * <= 0); the entries array is preserved in either case.
  */
-export function goBack(history: NavHistory): NavHistory {
-  if (history.headIndex <= 0) {
-    return history;
-  }
-  return {
-    entries: history.entries,
-    headIndex: history.headIndex - 1,
-  };
-}
+export function goBack(history: NavHistory): NavHistory {}
 
 /**
killedBy: Alt+Left restores the previous navigation snapshot goBack on a 4-entry history with headIndex=3 returns headIndex=2
statusReason: Cannot read properties of undefined (reading 'headIndex')

[Killed] EqualityOperator
norbert-config/domain/nav/history.ts:89:7
  * <= 0); the entries array is preserved in either case.
  */
 export function goBack(history: NavHistory): NavHistory {
-  if (history.headIndex <= 0) {
+  if (history.headIndex < 0) {
     return history;
   }
killedBy: Alt+Left at the start of history is a no-op with end-of-history cue goBack on a history with headIndex=0 returns the same history
statusReason: expected { Object (entries, headIndex) } to deeply equal { Object (entries, headIndex) }

[Killed] BlockStatement
norbert-config/domain/nav/history.ts:89:31
  * <= 0); the entries array is preserved in either case.
  */
 export function goBack(history: NavHistory): NavHistory {
-  if (history.headIndex <= 0) {
-    return history;
-  }
+  if (history.headIndex <= 0) {}
   return {
     entries: history.entries,
killedBy: Alt+Left at the start of history is a no-op with end-of-history cue goBack on a history with headIndex=0 returns the same history
statusReason: expected { Object (entries, headIndex) } to deeply equal { Object (entries, headIndex) }

[Killed] ArithmeticOperator
norbert-config/domain/nav/history.ts:94:16
   }
   return {
     entries: history.entries,
-    headIndex: history.headIndex - 1,
+    headIndex: history.headIndex + 1,
   };
 }
killedBy: Alt+Left restores the previous navigation snapshot goBack on a 4-entry history with headIndex=3 returns headIndex=2
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/history.ts:103:60
  * (`headIndex >= entries.length - 1`); the entries array is preserved in
  * either case. Symmetric to {@link goBack}.
  */
-export function goForward(history: NavHistory): NavHistory {
-  if (history.headIndex >= history.entries.length - 1) {
-    return history;
-  }
-  return {
-    entries: history.entries,
-    headIndex: history.headIndex + 1,
-  };
-}
+export function goForward(history: NavHistory): NavHistory {}
 
 /**
killedBy: Alt+Right re-advances after going back goForward on a 4-entry history with headIndex=2 returns headIndex=3
statusReason: Cannot read properties of undefined (reading 'headIndex')

[Killed] ConditionalExpression
norbert-config/domain/nav/history.ts:104:7
  * either case. Symmetric to {@link goBack}.
  */
 export function goForward(history: NavHistory): NavHistory {
-  if (history.headIndex >= history.entries.length - 1) {
+  if (true) {
     return history;
   }
killedBy: Alt+Right re-advances after going back goForward on a 4-entry history with headIndex=2 returns headIndex=3
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/nav/history.ts:104:7
  * either case. Symmetric to {@link goBack}.
  */
 export function goForward(history: NavHistory): NavHistory {
-  if (history.headIndex >= history.entries.length - 1) {
+  if (false) {
     return history;
   }
killedBy: Alt+Right at end of history is a no-op goForward on a history with headIndex=entries.length-1 returns the same history
statusReason: expected { Object (entries, headIndex) } to deeply equal { Object (entries, headIndex) }

[Killed] ArithmeticOperator
norbert-config/domain/nav/history.ts:109:16
   }
   return {
     entries: history.entries,
-    headIndex: history.headIndex + 1,
+    headIndex: history.headIndex - 1,
   };
 }
killedBy: Alt+Right re-advances after going back goForward on a 4-entry history with headIndex=2 returns headIndex=3
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/history.ts:119:57
  * (`0 <= headIndex < entries.length`): back navigation is available only
  * while a strictly older entry exists in the stack.
  */
-export function canGoBack(history: NavHistory): boolean {
-  return history.headIndex > 0;
-}
+export function canGoBack(history: NavHistory): boolean {}
 
 /**
killedBy: Alt+Left at the start of history is a no-op with end-of-history cue goBack on a history with headIndex=0 returns the same history
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/nav/history.ts:120:10
  * while a strictly older entry exists in the stack.
  */
 export function canGoBack(history: NavHistory): boolean {
-  return history.headIndex > 0;
+  return true;
 }
 
killedBy: Alt+Left at the start of history is a no-op with end-of-history cue goBack on a history with headIndex=0 returns the same history
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
norbert-config/domain/nav/history.ts:120:10
  * while a strictly older entry exists in the stack.
  */
 export function canGoBack(history: NavHistory): boolean {
-  return history.headIndex > 0;
+  return history.headIndex <= 0;
 }
 
killedBy: Alt+Left at the start of history is a no-op with end-of-history cue goBack on a history with headIndex=0 returns the same history
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/history.ts:129:60
  * (`headIndex < entries.length`): forward navigation is available only while
  * a strictly newer entry exists in the stack.
  */
-export function canGoForward(history: NavHistory): boolean {
-  return history.headIndex < history.entries.length - 1;
-}
+export function canGoForward(history: NavHistory): boolean {}
 
killedBy: Alt+Right at end of history is a no-op goForward on a history with headIndex=entries.length-1 returns the same history
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
norbert-config/domain/nav/history.ts:130:10
  * a strictly newer entry exists in the stack.
  */
 export function canGoForward(history: NavHistory): boolean {
-  return history.headIndex < history.entries.length - 1;
+  return history.headIndex <= history.entries.length - 1;
 }
 
killedBy: Alt+Right at end of history is a no-op goForward on a history with headIndex=entries.length-1 returns the same history
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/nav/history.ts:130:10
  * a strictly newer entry exists in the stack.
  */
 export function canGoForward(history: NavHistory): boolean {
-  return history.headIndex < history.entries.length - 1;
+  return false;
 }
 
killedBy: Alt+Right at end of history is a no-op goForward on a history with headIndex=entries.length-1 returns the same history
statusReason: expected false to be true // Object.is equality
