[Killed] BlockStatement
norbert-config/domain/references/registry.ts:63:45
 // function so a new RefType lands as a one-line table entry rather than an
 // extra branch in a giant switch.
 
-function basename(filePath: string): string {
-  const segments = filePath.split(/[/\\]/);
-  return segments[segments.length - 1] ?? "";
-}
+function basename(filePath: string): string {}
 
 function makeItemKey(type: RefType, scope: ConfigScope, name: string): string {
killedBy: RegistryEntry projection preserves identifying fields per RefType a hook projects to a registry entry whose name is the basename of its filePath and type is 'hook'
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
norbert-config/domain/references/registry.ts:65:10
 
 function basename(filePath: string): string {
   const segments = filePath.split(/[/\\]/);
-  return segments[segments.length - 1] ?? "";
+  return segments[segments.length - 1] && "";
 }
 
killedBy: RegistryEntry projection preserves identifying fields per RefType a hook projects to a registry entry whose name is the basename of its filePath and type is 'hook'
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
norbert-config/domain/references/registry.ts:65:19
 
 function basename(filePath: string): string {
   const segments = filePath.split(/[/\\]/);
-  return segments[segments.length - 1] ?? "";
+  return segments[segments.length + 1] ?? "";
 }
 
killedBy: RegistryEntry projection preserves identifying fields per RefType a hook projects to a registry entry whose name is the basename of its filePath and type is 'hook'
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:68:79
   return segments[segments.length - 1] ?? "";
 }
 
-function makeItemKey(type: RefType, scope: ConfigScope, name: string): string {
-  return `${type}:${scope}:${name}`;
-}
+function makeItemKey(type: RefType, scope: ConfigScope, name: string): string {}
 
 function entryFromAgent(result: AgentParseResult): RegistryEntry | null {
killedBy: RegistryEntry projection preserves identifying fields per RefType a command projects to a registry entry with type='command' and the command's name, scope, source, and filePath
statusReason: expected undefined to be 'command:project:deploy' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:72:73
   return `${type}:${scope}:${name}`;
 }
 
-function entryFromAgent(result: AgentParseResult): RegistryEntry | null {
-  if (result.tag !== "parsed") {
-    return null;
-  }
-  const { agent } = result;
-  return {
-    type: "agent",
-    scope: agent.scope,
-    source: agent.source,
-    name: agent.name,
-    filePath: agent.filePath,
-    itemKey: makeItemKey("agent", agent.scope, agent.name),
-  };
-}
+function entryFromAgent(result: AgentParseResult): RegistryEntry | null {}
 
 function entryFromCommand(command: CommandDefinition): RegistryEntry {
killedBy: buildRegistry with 500 items completes synchronously and produces the correct entry count a 500-item AggregatedConfig builds to a registry whose byName.size equals 500 within a generous synchronous bu
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:73:32
 }
 
 function entryFromAgent(result: AgentParseResult): RegistryEntry | null {
-  if (result.tag !== "parsed") {
-    return null;
-  }
+  if (result.tag !== "parsed") {}
   const { agent } = result;
   return {
killedBy: buildRegistry skips agent parse-error results an aggregated config containing only an agent parse-error produces an empty byName map
statusReason: Cannot read properties of undefined (reading 'scope')

[Killed] EqualityOperator
norbert-config/domain/references/registry.ts:73:7
 }
 
 function entryFromAgent(result: AgentParseResult): RegistryEntry | null {
-  if (result.tag !== "parsed") {
+  if (result.tag === "parsed") {
     return null;
   }
killedBy: buildRegistry with 500 items completes synchronously and produces the correct entry count a 500-item AggregatedConfig builds to a registry whose byName.size equals 500 within a generous synchronous bu
statusReason: expected 400 to be 500 // Object.is equality

[Killed] StringLiteral
norbert-config/domain/references/registry.ts:78:11
   }
   const { agent } = result;
   return {
-    type: "agent",
+    type: "",
     scope: agent.scope,
     source: agent.source,
killedBy: RegistryEntry projection preserves identifying fields per RefType an agent projects to a registry entry with type='agent' and the agent's name, scope, source, and filePath
statusReason: expected '' to be 'agent' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/references/registry.ts:83:26
     source: agent.source,
     name: agent.name,
     filePath: agent.filePath,
-    itemKey: makeItemKey("agent", agent.scope, agent.name),
+    itemKey: makeItemKey("", agent.scope, agent.name),
   };
 }
killedBy: RegistryEntry projection preserves identifying fields per RefType an agent projects to a registry entry with type='agent' and the agent's name, scope, source, and filePath
statusReason: expected ':user:planner' to be 'agent:user:planner' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:87:70
   };
 }
 
-function entryFromCommand(command: CommandDefinition): RegistryEntry {
-  return {
-    type: "command",
-    scope: command.scope,
-    source: command.source,
-    name: command.name,
-    filePath: command.filePath,
-    itemKey: makeItemKey("command", command.scope, command.name),
-  };
-}
+function entryFromCommand(command: CommandDefinition): RegistryEntry {}
 
 function entryFromSkill(skill: SkillDefinition): RegistryEntry {
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:98:64
   };
 }
 
-function entryFromSkill(skill: SkillDefinition): RegistryEntry {
-  return {
-    type: "skill",
-    scope: skill.scope,
-    source: skill.source,
-    name: skill.name,
-    filePath: skill.filePath,
-    itemKey: makeItemKey("skill", skill.scope, skill.name),
-  };
-}
+function entryFromSkill(skill: SkillDefinition): RegistryEntry {}
 
 function entryFromHook(hook: HookConfig): RegistryEntry {
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ObjectLiteral
norbert-config/domain/references/registry.ts:99:10
 }
 
 function entryFromSkill(skill: SkillDefinition): RegistryEntry {
-  return {
-    type: "skill",
-    scope: skill.scope,
-    source: skill.source,
-    name: skill.name,
-    filePath: skill.filePath,
-    itemKey: makeItemKey("skill", skill.scope, skill.name),
-  };
+  return {};
 }
 
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:109:57
   };
 }
 
-function entryFromHook(hook: HookConfig): RegistryEntry {
-  // Hooks have no intrinsic name field; the file path's basename is the
-  // closest stable identifier (e.g., 'pre-release.sh').
-  const name = basename(hook.filePath) || hook.command;
-  return {
-    type: "hook",
-    scope: hook.scope,
-    source: hook.source,
-    name,
-    filePath: hook.filePath,
-    itemKey: makeItemKey("hook", hook.scope, name),
-  };
-}
+function entryFromHook(hook: HookConfig): RegistryEntry {}
 
 function entryFromMcpServer(server: McpServerConfig): RegistryEntry {
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] LogicalOperator
norbert-config/domain/references/registry.ts:112:16
 function entryFromHook(hook: HookConfig): RegistryEntry {
   // Hooks have no intrinsic name field; the file path's basename is the
   // closest stable identifier (e.g., 'pre-release.sh').
-  const name = basename(hook.filePath) || hook.command;
+  const name = basename(hook.filePath) && hook.command;
   return {
     type: "hook",
killedBy: RegistryEntry projection preserves identifying fields per RefType a hook projects to a registry entry whose name is the basename of its filePath and type is 'hook'
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
norbert-config/domain/references/registry.ts:112:16
 function entryFromHook(hook: HookConfig): RegistryEntry {
   // Hooks have no intrinsic name field; the file path's basename is the
   // closest stable identifier (e.g., 'pre-release.sh').
-  const name = basename(hook.filePath) || hook.command;
+  const name = false;
   return {
     type: "hook",
killedBy: buildRegistry with 500 items completes synchronously and produces the correct entry count a 500-item AggregatedConfig builds to a registry whose byName.size equals 500 within a generous synchronous bu
statusReason: expected 401 to be 500 // Object.is equality

[Killed] StringLiteral
norbert-config/domain/references/registry.ts:114:11
   // closest stable identifier (e.g., 'pre-release.sh').
   const name = basename(hook.filePath) || hook.command;
   return {
-    type: "hook",
+    type: "",
     scope: hook.scope,
     source: hook.source,
killedBy: RegistryEntry projection preserves identifying fields per RefType a hook projects to a registry entry whose name is the basename of its filePath and type is 'hook'
statusReason: expected '' to be 'hook' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/references/registry.ts:119:26
     source: hook.source,
     name,
     filePath: hook.filePath,
-    itemKey: makeItemKey("hook", hook.scope, name),
+    itemKey: makeItemKey("", hook.scope, name),
   };
 }
killedBy: RegistryEntry projection preserves identifying fields per RefType a hook projects to a registry entry whose name is the basename of its filePath and type is 'hook'
statusReason: expected ':project:pre-commit.sh' to be 'hook:project:pre-commit.sh' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:123:69
   };
 }
 
-function entryFromMcpServer(server: McpServerConfig): RegistryEntry {
-  return {
-    type: "mcp",
-    scope: server.scope,
-    source: server.source,
-    name: server.name,
-    filePath: server.filePath,
-    itemKey: makeItemKey("mcp", server.scope, server.name),
-  };
-}
+function entryFromMcpServer(server: McpServerConfig): RegistryEntry {}
 
 function entryFromRule(rule: RuleEntry): RegistryEntry {
killedBy: buildRegistry with 500 items completes synchronously and produces the correct entry count a 500-item AggregatedConfig builds to a registry whose byName.size equals 500 within a generous synchronous bu
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:134:56
   };
 }
 
-function entryFromRule(rule: RuleEntry): RegistryEntry {
-  // Rules have no name field; use the file's basename for stable lookup.
-  const name = basename(rule.filePath);
-  return {
-    type: "rule",
-    scope: rule.scope,
-    source: rule.source,
-    name,
-    filePath: rule.filePath,
-    itemKey: makeItemKey("rule", rule.scope, name),
-  };
-}
+function entryFromRule(rule: RuleEntry): RegistryEntry {}
 
 function entryFromPlugin(plugin: PluginInfo): RegistryEntry {
killedBy: RegistryEntry projection preserves identifying fields per RefType a rule projects to a registry entry with type='rule' and the basename of its filePath as the name
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:147:61
   };
 }
 
-function entryFromPlugin(plugin: PluginInfo): RegistryEntry {
-  return {
-    type: "plugin",
-    scope: plugin.scope,
-    source: plugin.name,
-    name: plugin.name,
-    filePath: plugin.filePath,
-    itemKey: makeItemKey("plugin", plugin.scope, plugin.name),
-  };
-}
+function entryFromPlugin(plugin: PluginInfo): RegistryEntry {}
 
 // Pure path normaliser. The registry compares paths structurally so absolute
killedBy: RegistryEntry projection preserves identifying fields per RefType a plugin projects to a registry entry whose source field equals the plugin's name (not its scope)
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ObjectLiteral
norbert-config/domain/references/registry.ts:148:10
 }
 
 function entryFromPlugin(plugin: PluginInfo): RegistryEntry {
-  return {
-    type: "plugin",
-    scope: plugin.scope,
-    source: plugin.name,
-    name: plugin.name,
-    filePath: plugin.filePath,
-    itemKey: makeItemKey("plugin", plugin.scope, plugin.name),
-  };
+  return {};
 }
 
killedBy: RegistryEntry projection preserves identifying fields per RefType a plugin projects to a registry entry whose source field equals the plugin's name (not its scope)
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:174:47
 //      expanding to an absolute home path would couple the domain to node:os
 //      and to the host filesystem. Resolver-level expansion is a later concern.
 
-function normalisePath(input: string): string {
-  // 1. Backslashes -> forward slashes.
-  let path = input.replace(/\\/g, "/");
-
-  // 2a. Strip a leading './' (but not '../').
-  if (path.startsWith("./")) {
-    path = path.slice(2);
-  }
-
-  // 2b. Collapse interior '/./' segments. Repeated application handles
-  // overlapping matches like '/a/./././b'.
-  while (path.includes("/./")) {
-    path = path.replace(/\/\.\//g, "/");
-  }
-
-  // 3. Strip a single trailing '/' unless the path is just '/'.
-  if (path.length > 1 && path.endsWith("/")) {
-    path = path.slice(0, -1);
-  }
-
-  return path;
-}
+function normalisePath(input: string): string {}
 
 // Collect all entries from an AggregatedConfig in a single pass per collection.
killedBy: Markdown link to a known skill resolves through the registry lookupByPath resolves the absolute markdown link href to the same registry entry
statusReason: expected 'command' to be 'skill' // Object.is equality

[Killed] MethodExpression
norbert-config/domain/references/registry.ts:179:7
   let path = input.replace(/\\/g, "/");
 
   // 2a. Strip a leading './' (but not '../').
-  if (path.startsWith("./")) {
+  if (path.endsWith("./")) {
     path = path.slice(2);
   }
killedBy: normalisePath equivalence rules expose the same registry entry a path with a leading './' resolves to the same entry as the path without it
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-config/domain/references/registry.ts:179:7
   let path = input.replace(/\\/g, "/");
 
   // 2a. Strip a leading './' (but not '../').
-  if (path.startsWith("./")) {
+  if (true) {
     path = path.slice(2);
   }
killedBy: normalisePath equivalence rules expose the same registry entry a path with a leading './' resolves to the same entry as the path without it
statusReason: expected null not to be null

[Killed] MethodExpression
norbert-config/domain/references/registry.ts:180:12
 
   // 2a. Strip a leading './' (but not '../').
   if (path.startsWith("./")) {
-    path = path.slice(2);
+    path = path;
   }
 
killedBy: normalisePath equivalence rules expose the same registry entry a path with a leading './' resolves to the same entry as the path without it
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-config/domain/references/registry.ts:185:10
 
   // 2b. Collapse interior '/./' segments. Repeated application handles
   // overlapping matches like '/a/./././b'.
-  while (path.includes("/./")) {
+  while (false) {
     path = path.replace(/\/\.\//g, "/");
   }
killedBy: normalisePath equivalence rules expose the same registry entry a path with interior '/./' segments resolves to the same entry as the canonical path
statusReason: expected null not to be null

[Timeout] BlockStatement
norbert-config/domain/references/registry.ts:185:32
 
   // 2b. Collapse interior '/./' segments. Repeated application handles
   // overlapping matches like '/a/./././b'.
-  while (path.includes("/./")) {
-    path = path.replace(/\/\.\//g, "/");
-  }
+  while (path.includes("/./")) {}
 
   // 3. Strip a single trailing '/' unless the path is just '/'.

[Killed] StringLiteral
norbert-config/domain/references/registry.ts:186:36
   // 2b. Collapse interior '/./' segments. Repeated application handles
   // overlapping matches like '/a/./././b'.
   while (path.includes("/./")) {
-    path = path.replace(/\/\.\//g, "/");
+    path = path.replace(/\/\.\//g, "");
   }
 
killedBy: normalisePath equivalence rules expose the same registry entry a path with interior '/./' segments resolves to the same entry as the canonical path
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-config/domain/references/registry.ts:190:7
   }
 
   // 3. Strip a single trailing '/' unless the path is just '/'.
-  if (path.length > 1 && path.endsWith("/")) {
+  if (path.length <= 1 && path.endsWith("/")) {
     path = path.slice(0, -1);
   }
killedBy: normalisePath equivalence rules expose the same registry entry a path with a trailing slash resolves to the same entry as the canonical path
statusReason: expected null not to be null

[Killed] LogicalOperator
norbert-config/domain/references/registry.ts:190:7
   }
 
   // 3. Strip a single trailing '/' unless the path is just '/'.
-  if (path.length > 1 && path.endsWith("/")) {
+  if (path.length > 1 || path.endsWith("/")) {
     path = path.slice(0, -1);
   }
killedBy: normalisePath equivalence rules expose the same registry entry a path with a trailing slash resolves to the same entry as the canonical path
statusReason: expected null not to be null

[Killed] UnaryOperator
norbert-config/domain/references/registry.ts:191:26
 
   // 3. Strip a single trailing '/' unless the path is just '/'.
   if (path.length > 1 && path.endsWith("/")) {
-    path = path.slice(0, -1);
+    path = path.slice(0, +1);
   }
 
killedBy: normalisePath equivalence rules expose the same registry entry a path with a trailing slash resolves to the same entry as the canonical path
statusReason: expected null not to be null

[Killed] MethodExpression
norbert-config/domain/references/registry.ts:191:12
 
   // 3. Strip a single trailing '/' unless the path is just '/'.
   if (path.length > 1 && path.endsWith("/")) {
-    path = path.slice(0, -1);
+    path = path;
   }
 
killedBy: normalisePath equivalence rules expose the same registry entry a path with a trailing slash resolves to the same entry as the canonical path
statusReason: expected null not to be null

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:199:77
 
 // Collect all entries from an AggregatedConfig in a single pass per collection.
 // Agents are filtered to the parsed branch only.
-function collectEntries(config: AggregatedConfig): readonly RegistryEntry[] {
-  const agents = config.agents
-    .map(entryFromAgent)
-    .filter((entry): entry is RegistryEntry => entry !== null);
-  const commands = config.commands.map(entryFromCommand);
-  const skills = config.skills.map(entryFromSkill);
-  const hooks = config.hooks.map(entryFromHook);
-  const mcpServers = config.mcpServers.map(entryFromMcpServer);
-  const rules = config.rules.map(entryFromRule);
-  const plugins = config.plugins.map(entryFromPlugin);
-
-  return [...agents, ...commands, ...skills, ...hooks, ...mcpServers, ...rules, ...plugins];
-}
+function collectEntries(config: AggregatedConfig): readonly RegistryEntry[] {}
 
 // Index a flat entry list into the byName multimap and byFilePath unique map.
killedBy: Loading state with no aggregated configuration renders no tokens and no crash buildRegistry returns an empty registry when given an empty aggregated config
statusReason: entries is not iterable

[Killed] MethodExpression
norbert-config/domain/references/registry.ts:200:18
 // Collect all entries from an AggregatedConfig in a single pass per collection.
 // Agents are filtered to the parsed branch only.
 function collectEntries(config: AggregatedConfig): readonly RegistryEntry[] {
-  const agents = config.agents
-    .map(entryFromAgent)
-    .filter((entry): entry is RegistryEntry => entry !== null);
+  const agents = config.agents.map(entryFromAgent);
   const commands = config.commands.map(entryFromCommand);
   const skills = config.skills.map(entryFromSkill);
killedBy: buildRegistry skips agent parse-error results an aggregated config containing only an agent parse-error produces an empty byName map
statusReason: Cannot read properties of null (reading 'name')

[Killed] ConditionalExpression
norbert-config/domain/references/registry.ts:202:48
 function collectEntries(config: AggregatedConfig): readonly RegistryEntry[] {
   const agents = config.agents
     .map(entryFromAgent)
-    .filter((entry): entry is RegistryEntry => entry !== null);
+    .filter((entry): entry is RegistryEntry => true);
   const commands = config.commands.map(entryFromCommand);
   const skills = config.skills.map(entryFromSkill);
killedBy: buildRegistry skips agent parse-error results an aggregated config containing only an agent parse-error produces an empty byName map
statusReason: Cannot read properties of null (reading 'name')

[Killed] ArrowFunction
norbert-config/domain/references/registry.ts:202:13
 function collectEntries(config: AggregatedConfig): readonly RegistryEntry[] {
   const agents = config.agents
     .map(entryFromAgent)
-    .filter((entry): entry is RegistryEntry => entry !== null);
+    .filter(() => undefined);
   const commands = config.commands.map(entryFromCommand);
   const skills = config.skills.map(entryFromSkill);
killedBy: buildRegistry with 500 items completes synchronously and produces the correct entry count a 500-item AggregatedConfig builds to a registry whose byName.size equals 500 within a generous synchronous bu
statusReason: expected 400 to be 500 // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:221:75
   readonly byFilePath: ReadonlyMap<string, RegistryEntry>;
 }
 
-function indexEntries(entries: readonly RegistryEntry[]): RegistryIndices {
-  const byName = new Map<string, RegistryEntry[]>();
-  const byFilePath = new Map<string, RegistryEntry>();
-
-  for (const entry of entries) {
-    const existing = byName.get(entry.name);
-    if (existing === undefined) {
-      byName.set(entry.name, [entry]);
-    } else {
-      existing.push(entry);
-    }
-
-    // First-writer-wins on path collisions; later steps may surface conflicts
-    // as warnings but the byFilePath surface is single-valued by contract.
-    // Key on the normalised filePath so lookups using equivalent forms
-    // (backslashes, trailing slash, redundant ./) collide on the same entry.
-    const pathKey = normalisePath(entry.filePath);
-    if (!byFilePath.has(pathKey)) {
-      byFilePath.set(pathKey, entry);
-    }
-  }
-
-  return { byName, byFilePath };
-}
+function indexEntries(entries: readonly RegistryEntry[]): RegistryIndices {}
 
 // ---------------------------------------------------------------------------
killedBy: Loading state with no aggregated configuration renders no tokens and no crash buildRegistry returns an empty registry when given an empty aggregated config
statusReason: Cannot destructure property 'byName' of 'indexEntries(...)' as it is undefined.

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:225:32
   const byName = new Map<string, RegistryEntry[]>();
   const byFilePath = new Map<string, RegistryEntry>();
 
-  for (const entry of entries) {
-    const existing = byName.get(entry.name);
-    if (existing === undefined) {
-      byName.set(entry.name, [entry]);
-    } else {
-      existing.push(entry);
-    }
-
-    // First-writer-wins on path collisions; later steps may surface conflicts
-    // as warnings but the byFilePath surface is single-valued by contract.
-    // Key on the normalised filePath so lookups using equivalent forms
-    // (backslashes, trailing slash, redundant ./) collide on the same entry.
-    const pathKey = normalisePath(entry.filePath);
-    if (!byFilePath.has(pathKey)) {
-      byFilePath.set(pathKey, entry);
-    }
-  }
+  for (const entry of entries) {}
 
   return { byName, byFilePath };
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
norbert-config/domain/references/registry.ts:227:9
 
   for (const entry of entries) {
     const existing = byName.get(entry.name);
-    if (existing === undefined) {
+    if (false) {
       byName.set(entry.name, [entry]);
     } else {
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:227:33
 
   for (const entry of entries) {
     const existing = byName.get(entry.name);
-    if (existing === undefined) {
-      byName.set(entry.name, [entry]);
-    } else {
+    if (existing === undefined) {} else {
       existing.push(entry);
     }
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:229:12
     const existing = byName.get(entry.name);
     if (existing === undefined) {
       byName.set(entry.name, [entry]);
-    } else {
-      existing.push(entry);
-    }
+    } else {}
 
     // First-writer-wins on path collisions; later steps may surface conflicts
killedBy: Reference resolving to multiple items renders as an ambiguous token lookupByName for an ambiguous name returns all matching candidates
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
norbert-config/domain/references/registry.ts:238:9
     // Key on the normalised filePath so lookups using equivalent forms
     // (backslashes, trailing slash, redundant ./) collide on the same entry.
     const pathKey = normalisePath(entry.filePath);
-    if (!byFilePath.has(pathKey)) {
+    if (true) {
       byFilePath.set(pathKey, entry);
     }
killedBy: byFilePath retains the first entry on path collisions when two entries share a filePath, lookupByPath returns the first one inserted
statusReason: expected 'second' to be 'first' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/references/registry.ts:238:9
     // Key on the normalised filePath so lookups using equivalent forms
     // (backslashes, trailing slash, redundant ./) collide on the same entry.
     const pathKey = normalisePath(entry.filePath);
-    if (!byFilePath.has(pathKey)) {
+    if (false) {
       byFilePath.set(pathKey, entry);
     }
killedBy: Markdown link to a known skill resolves through the registry lookupByPath resolves the absolute markdown link href to the same registry entry
statusReason: expected null not to be null

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:260:22
 export function buildRegistry(
   config: AggregatedConfig,
   prevVersion: number,
-): ReferenceRegistry {
-  const entries = collectEntries(config);
-  const { byName, byFilePath } = indexEntries(entries);
-
-  return {
-    byName,
-    byFilePath,
-    version: prevVersion + 1,
-  };
-}
+): ReferenceRegistry {}
 
 /**
killedBy: Loading state with no aggregated configuration renders no tokens and no crash buildRegistry returns an empty registry when given an empty aggregated config
statusReason: Cannot read properties of undefined (reading 'byName')

[Killed] ArithmeticOperator
norbert-config/domain/references/registry.ts:267:14
   return {
     byName,
     byFilePath,
-    version: prevVersion + 1,
+    version: prevVersion - 1,
   };
 }
killedBy: Loading state with no aggregated configuration renders no tokens and no crash buildRegistry returns an empty registry when given an empty aggregated config
statusReason: expected -1 to be greater than 0

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:278:29
 export function lookupByName(
   reg: ReferenceRegistry,
   name: string,
-): readonly RegistryEntry[] {
-  return reg.byName.get(name) ?? [];
-}
+): readonly RegistryEntry[] {}
 
 /**
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: Target cannot be null or undefined.
