[Killed] LogicalOperator
norbert-config/domain/references/registry.ts:279:10
   reg: ReferenceRegistry,
   name: string,
 ): readonly RegistryEntry[] {
-  return reg.byName.get(name) ?? [];
+  return reg.byName.get(name) && [];
 }
 
killedBy: Markdown link to a known skill resolves through the registry lookupByName returns the user-scope skill nw-bdd-requirements as a single live entry
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
norbert-config/domain/references/registry.ts:289:25
 export function lookupByPath(
   reg: ReferenceRegistry,
   path: string,
-): RegistryEntry | null {
-  return reg.byFilePath.get(normalisePath(path)) ?? null;
-}
+): RegistryEntry | null {}
 
killedBy: Markdown link to a known skill resolves through the registry lookupByPath resolves the absolute markdown link href to the same registry entry
statusReason: expected undefined to be 'skill' // Object.is equality

[Killed] LogicalOperator
norbert-config/domain/references/registry.ts:290:10
   reg: ReferenceRegistry,
   path: string,
 ): RegistryEntry | null {
-  return reg.byFilePath.get(normalisePath(path)) ?? null;
+  return reg.byFilePath.get(normalisePath(path)) && null;
 }
 
killedBy: Markdown link to a known skill resolves through the registry lookupByPath resolves the absolute markdown link href to the same registry entry
statusReason: expected null not to be null
