[Killed] BlockStatement
norbert-config/domain/nav/reducer.ts:138:13
 function makeRefClickEntry(
   action: "refSingleClick" | "refCtrlClick",
   targetItemKey: string,
-): NavEntry {
-  return { action, targetItemKey };
-}
+): NavEntry {}
 
 /**
killedBy: Cross-reference history entries record the originating action and target itemKey refSingleClick (open-from-empty), refSingleClick (bottom-replace), refCtrlClick, and closeSplit each push an entry whos
statusReason: expected undefined to be defined

[Killed] StringLiteral
norbert-config/domain/nav/reducer.ts:156:10
 const REF_TYPE_TO_SUB_TAB: Readonly<Record<RefType, ConfigSubTab>> = {
   agent: "agents",
   command: "commands",
-  skill: "skills",
+  skill: "",
   hook: "hooks",
   mcp: "mcp",
killedBy: Ctrl+click across sub-tabs switches sub-tab, list selection, and detail in one atomic update refCtrlClick to a target in another sub-tab updates 4 fields in one returned state
statusReason: expected '' to be 'skills' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/nav/reducer.ts:158:8
   command: "commands",
   skill: "skills",
   hook: "hooks",
-  mcp: "mcp",
+  mcp: "",
   rule: "rules",
   plugin: "plugins",
killedBy: Cross-tab Ctrl+click maps each RefType to its canonical Configuration sub-tab refCtrlClick on a live 'mcp -> \'mcp\'' sets activeSubTab to the canonical sub-tab id
statusReason: expected '' to be 'mcp' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/reducer.ts:163:55
   plugin: "plugins",
 };
 
-function refTypeToSubTab(type: RefType): ConfigSubTab {
-  return REF_TYPE_TO_SUB_TAB[type];
-}
+function refTypeToSubTab(type: RefType): ConfigSubTab {}
 
 /**
killedBy: Ctrl+click across sub-tabs switches sub-tab, list selection, and detail in one atomic update refCtrlClick to a target in another sub-tab updates 4 fields in one returned state
statusReason: expected undefined to be 'skills' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/reducer.ts:189:90
   prevFilter: ConfigNavState["filter"],
   targetSubTab: ConfigSubTab,
   targetSource: string,
-): { readonly filter: ConfigNavState["filter"]; readonly resetCue: ConfigSubTab | null } {
-  const existing = prevFilter.bySubTab[targetSubTab];
-  if (existing === undefined || existing.source === null) {
-    // Rule 1: no filter to preserve or reset.
-    return { filter: prevFilter, resetCue: null };
-  }
-  if (existing.source === targetSource) {
-    // Rule 2: filter already shows the target -- preserve verbatim.
-    return { filter: prevFilter, resetCue: null };
-  }
-  // Rule 3: mismatch -- clear the source dimension and emit the cue naming
-  // the destination sub-tab.
-  return {
-    filter: {
-      bySubTab: {
-        ...prevFilter.bySubTab,
-        [targetSubTab]: { ...existing, source: null },
-      },
-    },
-    resetCue: targetSubTab,
-  };
-}
+): { readonly filter: ConfigNavState["filter"]; readonly resetCue: ConfigSubTab | null } {}
 
 /**
killedBy: Ctrl+click across sub-tabs switches sub-tab, list selection, and detail in one atomic update refCtrlClick to a target in another sub-tab updates 4 fields in one returned state
statusReason: Cannot destructure property 'filter' of 'resolveFilterOnNav(...)' as it is undefined.

[Killed] EqualityOperator
norbert-config/domain/nav/reducer.ts:191:33
   targetSource: string,
 ): { readonly filter: ConfigNavState["filter"]; readonly resetCue: ConfigSubTab | null } {
   const existing = prevFilter.bySubTab[targetSubTab];
-  if (existing === undefined || existing.source === null) {
+  if (existing === undefined || existing.source !== null) {
     // Rule 1: no filter to preserve or reset.
     return { filter: prevFilter, resetCue: null };
killedBy: Ctrl+click resets the destination filter when it would hide the target refCtrlClick with a target whose source mismatches the existing filter clears the filter and emits the cue
statusReason: expected 'project' to be null

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:191:33
   targetSource: string,
 ): { readonly filter: ConfigNavState["filter"]; readonly resetCue: ConfigSubTab | null } {
   const existing = prevFilter.bySubTab[targetSubTab];
-  if (existing === undefined || existing.source === null) {
+  if (existing === undefined || false) {
     // Rule 1: no filter to preserve or reset.
     return { filter: prevFilter, resetCue: null };
killedBy: Ctrl+click into a destination sub-tab whose existing filter has source=null preserves state and emits no cue refCtrlClick on a cross-tab live target whose destination filter exists with source === nul
statusReason: expected { bySubTab: { skills: { …(2) } } } to be { bySubTab: { skills: { …(2) } } } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { bySubTab: { skills: { …(2) } } }
Received: serializes to the same string

[Killed] BlockStatement
norbert-config/domain/nav/reducer.ts:195:41
     // Rule 1: no filter to preserve or reset.
     return { filter: prevFilter, resetCue: null };
   }
-  if (existing.source === targetSource) {
-    // Rule 2: filter already shows the target -- preserve verbatim.
-    return { filter: prevFilter, resetCue: null };
-  }
+  if (existing.source === targetSource) {}
   // Rule 3: mismatch -- clear the source dimension and emit the cue naming
   // the destination sub-tab.
killedBy: Ctrl+click preserves a filter that already shows the target refCtrlClick with a target whose source matches the existing filter leaves the filter intact
statusReason: expected null to be 'user' // Object.is equality

[Killed] EqualityOperator
norbert-config/domain/nav/reducer.ts:195:7
     // Rule 1: no filter to preserve or reset.
     return { filter: prevFilter, resetCue: null };
   }
-  if (existing.source === targetSource) {
+  if (existing.source !== targetSource) {
     // Rule 2: filter already shows the target -- preserve verbatim.
     return { filter: prevFilter, resetCue: null };
killedBy: Ctrl+click preserves a filter that already shows the target refCtrlClick with a target whose source matches the existing filter leaves the filter intact
statusReason: expected null to be 'user' // Object.is equality

[Killed] ObjectLiteral
norbert-config/domain/nav/reducer.ts:205:25
     filter: {
       bySubTab: {
         ...prevFilter.bySubTab,
-        [targetSubTab]: { ...existing, source: null },
+        [targetSubTab]: {},
       },
     },
killedBy: Ctrl+click resets the destination filter when it would hide the target refCtrlClick with a target whose source mismatches the existing filter clears the filter and emits the cue
statusReason: expected undefined to be null

[Killed] BlockStatement
norbert-config/domain/nav/reducer.ts:236:19
 function handleRefCtrlClick(
   state: ConfigNavState,
   ref: ResolvedRef,
-): ConfigNavState {
-  if (ref.tag !== "live") {
-    return state;
-  }
-  const targetSubTab = refTypeToSubTab(ref.entry.type);
-  const { filter, resetCue } = resolveFilterOnNav(
-    state.filter,
-    targetSubTab,
-    ref.entry.source,
-  );
-  return {
-    ...state,
-    activeSubTab: targetSubTab,
-    selectedItemKey: ref.entry.itemKey,
-    splitState: null,
-    history: pushEntry(state.history, makeRefClickEntry("refCtrlClick", ref.entry.itemKey)),
-    filter,
-    filterResetCue: resetCue,
-  };
-}
+): ConfigNavState {}
 
 /**
killedBy: Ctrl+click across sub-tabs switches sub-tab, list selection, and detail in one atomic update refCtrlClick to a target in another sub-tab updates 4 fields in one returned state
statusReason: Cannot read properties of undefined (reading 'activeSubTab')

[Killed] BlockStatement
norbert-config/domain/nav/reducer.ts:237:27
   state: ConfigNavState,
   ref: ResolvedRef,
 ): ConfigNavState {
-  if (ref.tag !== "live") {
-    return state;
-  }
+  if (ref.tag !== "live") {}
   const targetSubTab = refTypeToSubTab(ref.entry.type);
   const { filter, resetCue } = resolveFilterOnNav(
killedBy: Ctrl+click on a dead reference is a complete no-op refCtrlClick with a dead ResolvedRef returns the same state reference
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:237:7
   state: ConfigNavState,
   ref: ResolvedRef,
 ): ConfigNavState {
-  if (ref.tag !== "live") {
+  if (false) {
     return state;
   }
killedBy: Ctrl+click on a dead reference is a complete no-op refCtrlClick with a dead ResolvedRef returns the same state reference
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
norbert-config/domain/nav/reducer.ts:251:57
     activeSubTab: targetSubTab,
     selectedItemKey: ref.entry.itemKey,
     splitState: null,
-    history: pushEntry(state.history, makeRefClickEntry("refCtrlClick", ref.entry.itemKey)),
+    history: pushEntry(state.history, makeRefClickEntry("", ref.entry.itemKey)),
     filter,
     filterResetCue: resetCue,
killedBy: Cross-reference history entries record the originating action and target itemKey refSingleClick (open-from-empty), refSingleClick (bottom-replace), refCtrlClick, and closeSplit each push an entry whos
statusReason: expected '' to be 'refCtrlClick' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:284:7
   ref: ResolvedRef,
   currentEntry: RegistryEntry | null,
 ): ConfigNavState {
-  if (ref.tag !== "live") {
+  if (true) {
     return state;
   }
killedBy: Single-click on a live reference opens a vertical split with the target previewed refSingleClick on a live reference produces a split with topRef=current and bottomRef=target
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:287:7
   if (ref.tag !== "live") {
     return state;
   }
-  if (state.splitState !== null) {
+  if (true) {
     const replacedSplit: SplitState = {
       topRef: state.splitState.topRef,
killedBy: Single-click on a live reference opens a vertical split with the target previewed refSingleClick on a live reference produces a split with topRef=current and bottomRef=target
statusReason: Cannot read properties of null (reading 'topRef')

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:287:7
   if (ref.tag !== "live") {
     return state;
   }
-  if (state.splitState !== null) {
+  if (false) {
     const replacedSplit: SplitState = {
       topRef: state.splitState.topRef,
killedBy: Single-click in an open split replaces the bottom pane only refSingleClick when splitState !== null replaces bottomRef and keeps topRef unchanged
statusReason: expected { type: 'skill', scope: 'user', …(4) } to be { type: 'command', …(5) } // Object.is equality

[Killed] StringLiteral
norbert-config/domain/nav/reducer.ts:296:59
     return {
       ...state,
       splitState: replacedSplit,
-      history: pushEntry(state.history, makeRefClickEntry("refSingleClick", ref.entry.itemKey)),
+      history: pushEntry(state.history, makeRefClickEntry("", ref.entry.itemKey)),
     };
   }
killedBy: Cross-reference history entries record the originating action and target itemKey refSingleClick (open-from-empty), refSingleClick (bottom-replace), refCtrlClick, and closeSplit each push an entry whos
statusReason: expected '' to be 'refSingleClick' // Object.is equality

[Killed] EqualityOperator
norbert-config/domain/nav/reducer.ts:299:7
       history: pushEntry(state.history, makeRefClickEntry("refSingleClick", ref.entry.itemKey)),
     };
   }
-  if (currentEntry === null) {
+  if (currentEntry !== null) {
     return state;
   }
killedBy: Single-click on a live reference opens a vertical split with the target previewed refSingleClick on a live reference produces a split with topRef=current and bottomRef=target
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:299:7
       history: pushEntry(state.history, makeRefClickEntry("refSingleClick", ref.entry.itemKey)),
     };
   }
-  if (currentEntry === null) {
+  if (true) {
     return state;
   }
killedBy: Single-click on a live reference opens a vertical split with the target previewed refSingleClick on a live reference produces a split with topRef=current and bottomRef=target
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:328:5
   action: ConfigNavAction,
 ): ConfigNavState {
   switch (action.tag) {
-    case "refSingleClick":
-      return handleRefSingleClick(state, action.ref, action.currentEntry);
+    case "refSingleClick":
     case "refCtrlClick":
       return handleRefCtrlClick(state, action.ref);
killedBy: Single-click on a live reference opens a vertical split with the target previewed refSingleClick on a live reference produces a split with topRef=current and bottomRef=target
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:330:5
   switch (action.tag) {
     case "refSingleClick":
       return handleRefSingleClick(state, action.ref, action.currentEntry);
-    case "refCtrlClick":
-      return handleRefCtrlClick(state, action.ref);
+    case "refCtrlClick":
     case "selectItem":
       // Manual list-row selection updates focus but MUST NOT push history
killedBy: Ctrl+click across sub-tabs switches sub-tab, list selection, and detail in one atomic update refCtrlClick to a target in another sub-tab updates 4 fields in one returned state
statusReason: expected undefined to be 'skills' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:332:5
       return handleRefSingleClick(state, action.ref, action.currentEntry);
     case "refCtrlClick":
       return handleRefCtrlClick(state, action.ref);
-    case "selectItem":
-      // Manual list-row selection updates focus but MUST NOT push history
-      // (ADR-008 -- only cross-ref actions push). `history` is left untouched
-      // so a mid-history `headIndex` survives a manual selection.
-      return {
-        ...state,
-        activeSubTab: action.subTab,
-        selectedItemKey: action.itemKey,
-      };
+    case "selectItem":
     case "switchSubTab":
       // Manual mode-switch updates the active sub-tab but MUST NOT push
killedBy: Manual list-row selection does not push a history entry selectItem leaves history.entries.length unchanged (ADR-008)
statusReason: expected null to be 'skill:user:nw-bdd-requirements' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/nav/reducer.ts:332:10
       return handleRefSingleClick(state, action.ref, action.currentEntry);
     case "refCtrlClick":
       return handleRefCtrlClick(state, action.ref);
-    case "selectItem":
+    case "":
       // Manual list-row selection updates focus but MUST NOT push history
       // (ADR-008 -- only cross-ref actions push). `history` is left untouched
killedBy: Manual list-row selection does not push a history entry selectItem leaves history.entries.length unchanged (ADR-008)
statusReason: expected undefined to be 'skill:user:nw-bdd-requirements' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:341:5
         activeSubTab: action.subTab,
         selectedItemKey: action.itemKey,
       };
-    case "switchSubTab":
-      // Manual mode-switch updates the active sub-tab but MUST NOT push
-      // history (ADR-008). Per Architecture sec 6.4 it also resets
-      // `selectedItemKey` to null so the list-pane scroll lands at the top
-      // of the new sub-tab (no stale selection bleeding across modes).
-      return {
-        ...state,
-        activeSubTab: action.subTab,
-        selectedItemKey: null,
-      };
+    case "switchSubTab":
     case "closeSplit": {
       // Collapse the 2-pane split (ADR-009) and push one history entry
killedBy: Manual sub-tab switch does not push a history entry switchSubTab leaves history.entries.length unchanged (ADR-008)
statusReason: expected 'commands' to be 'skills' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/nav/reducer.ts:341:10
         activeSubTab: action.subTab,
         selectedItemKey: action.itemKey,
       };
-    case "switchSubTab":
+    case "":
       // Manual mode-switch updates the active sub-tab but MUST NOT push
       // history (ADR-008). Per Architecture sec 6.4 it also resets
killedBy: Manual sub-tab switch does not push a history entry switchSubTab leaves history.entries.length unchanged (ADR-008)
statusReason: expected undefined to be 'skills' // Object.is equality

[Killed] ObjectLiteral
norbert-config/domain/nav/reducer.ts:346:14
       // history (ADR-008). Per Architecture sec 6.4 it also resets
       // `selectedItemKey` to null so the list-pane scroll lands at the top
       // of the new sub-tab (no stale selection bleeding across modes).
-      return {
-        ...state,
-        activeSubTab: action.subTab,
-        selectedItemKey: null,
-      };
+      return {};
     case "closeSplit": {
       // Collapse the 2-pane split (ADR-009) and push one history entry
killedBy: Manual sub-tab switch does not push a history entry switchSubTab leaves history.entries.length unchanged (ADR-008)
statusReason: expected undefined to be 'skills' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/nav/reducer.ts:351:24
         activeSubTab: action.subTab,
         selectedItemKey: null,
       };
-    case "closeSplit": {
-      // Collapse the 2-pane split (ADR-009) and push one history entry
-      // (ADR-008 -- closeSplit is a cross-pane navigation action). All
-      // observable fields other than `splitState` and `history` are
-      // preserved.
-      const entry: NavEntry = { action: "closeSplit" };
-      return {
-        ...state,
-        splitState: null,
-        history: pushEntry(state.history, entry),
-      };
-    }
+    case "closeSplit": {}
     default: {
       const _exhaustive: never = action;
killedBy: Close button collapses the split back to a single pane closeSplit returns splitState === null and pushes one history entry
statusReason: expected undefined to be null

[Killed] ConditionalExpression
norbert-config/domain/nav/reducer.ts:351:5
         activeSubTab: action.subTab,
         selectedItemKey: null,
       };
-    case "closeSplit": {
-      // Collapse the 2-pane split (ADR-009) and push one history entry
-      // (ADR-008 -- closeSplit is a cross-pane navigation action). All
-      // observable fields other than `splitState` and `history` are
-      // preserved.
-      const entry: NavEntry = { action: "closeSplit" };
-      return {
-        ...state,
-        splitState: null,
-        history: pushEntry(state.history, entry),
-      };
-    }
+    case "closeSplit":
     default: {
       const _exhaustive: never = action;
killedBy: Close button collapses the split back to a single pane closeSplit returns splitState === null and pushes one history entry
statusReason: expected undefined to be null

[Killed] ObjectLiteral
norbert-config/domain/nav/reducer.ts:356:31
       // (ADR-008 -- closeSplit is a cross-pane navigation action). All
       // observable fields other than `splitState` and `history` are
       // preserved.
-      const entry: NavEntry = { action: "closeSplit" };
+      const entry: NavEntry = {};
       return {
         ...state,
killedBy: Cross-reference history entries record the originating action and target itemKey refSingleClick (open-from-empty), refSingleClick (bottom-replace), refCtrlClick, and closeSplit each push an entry whos
statusReason: expected undefined to be 'closeSplit' // Object.is equality

[Killed] ObjectLiteral
norbert-config/domain/nav/reducer.ts:357:14
       // observable fields other than `splitState` and `history` are
       // preserved.
       const entry: NavEntry = { action: "closeSplit" };
-      return {
-        ...state,
-        splitState: null,
-        history: pushEntry(state.history, entry),
-      };
+      return {};
     }
     default: {
killedBy: Close button collapses the split back to a single pane closeSplit returns splitState === null and pushes one history entry
statusReason: expected undefined to be null

[NoCoverage] ConditionalExpression
norbert-config/domain/nav/reducer.ts:363:5
         history: pushEntry(state.history, entry),
       };
     }
-    default: {
-      const _exhaustive: never = action;
-      return _exhaustive;
-    }
+    default:
   }
 }

[NoCoverage] BlockStatement
norbert-config/domain/nav/reducer.ts:363:14
         history: pushEntry(state.history, entry),
       };
     }
-    default: {
-      const _exhaustive: never = action;
-      return _exhaustive;
-    }
+    default: {}
   }
 }
