[Killed] ArrayDeclaration
norbert-config/domain/references/resolver.ts:74:49
  * Held as a module-level constant so adding a new surface is a one-line
  * change here.
  */
-const SUPPORTED_CATEGORIES: readonly string[] = [
-  "agents",
-  "commands",
-  "skills",
-  "hooks",
-  "mcpServers",
-  "rules",
-  "plugins",
-];
+const SUPPORTED_CATEGORIES: readonly string[] = [];
 
 // ---------------------------------------------------------------------------
killedBy: Resolving a path under a SUPPORTED .claude category that misses the registry returns the dead outcome (not unsupported) resolve({ kind: 'path', value: '~/.claude/skills/never-registered/SKILL.md' }) r
statusReason: expected 'unsupported' to be 'dead' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/references/resolver.ts:76:3
  */
 const SUPPORTED_CATEGORIES: readonly string[] = [
   "agents",
-  "commands",
+  "",
   "skills",
   "hooks",
killedBy: The unsupported reason names every supported category and the offending category, joined by ', ' reason contains each SUPPORTED_CATEGORIES entry, the joiner, and the offending category
statusReason: expected 'under .claude/ but not a recognised c…' to contain 'commands'

[Killed] StringLiteral
norbert-config/domain/references/resolver.ts:79:3
   "commands",
   "skills",
   "hooks",
-  "mcpServers",
+  "",
   "rules",
   "plugins",
killedBy: The unsupported reason names every supported category and the offending category, joined by ', ' reason contains each SUPPORTED_CATEGORIES entry, the joiner, and the offending category
statusReason: expected 'under .claude/ but not a recognised c…' to contain 'mcpServers'

[Killed] BlockStatement
norbert-config/domain/references/resolver.ts:97:64
  * platform-agnostic and the dependency-cruiser boundary rule against node:*
  * under domain/** holds.
  */
-function extractDotClaudeCategory(path: string): string | null {
-  const segments = path.split(/[/\\]/);
-  const claudeIndex = segments.indexOf(".claude");
-  if (claudeIndex === -1) {
-    return null;
-  }
-  const next = segments[claudeIndex + 1];
-  if (next === undefined || next === "") {
-    return null;
-  }
-  return next;
-}
+function extractDotClaudeCategory(path: string): string | null {}
 
 function resolveNameReference(value: string, registry: ReferenceRegistry): ResolvedRef {
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected 'under .claude/ but not a recognised c…' to contain 'unknown-kind'

[Killed] UnaryOperator
norbert-config/domain/references/resolver.ts:100:23
 function extractDotClaudeCategory(path: string): string | null {
   const segments = path.split(/[/\\]/);
   const claudeIndex = segments.indexOf(".claude");
-  if (claudeIndex === -1) {
+  if (claudeIndex === +1) {
     return null;
   }
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected 'dead' to be 'unsupported' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/references/resolver.ts:100:7
 function extractDotClaudeCategory(path: string): string | null {
   const segments = path.split(/[/\\]/);
   const claudeIndex = segments.indexOf(".claude");
-  if (claudeIndex === -1) {
+  if (true) {
     return null;
   }
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected 'dead' to be 'unsupported' // Object.is equality

[Killed] ArithmeticOperator
norbert-config/domain/references/resolver.ts:103:25
   if (claudeIndex === -1) {
     return null;
   }
-  const next = segments[claudeIndex + 1];
+  const next = segments[claudeIndex - 1];
   if (next === undefined || next === "") {
     return null;
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected 'under .claude/ but not a recognised c…' to contain 'unknown-kind'

[Killed] LogicalOperator
norbert-config/domain/references/resolver.ts:104:7
     return null;
   }
   const next = segments[claudeIndex + 1];
-  if (next === undefined || next === "") {
+  if (next === undefined && next === "") {
     return null;
   }
killedBy: Resolving a path that ends exactly at .claude with no segment after returns the dead outcome (no category to inspect) resolve({ kind: 'path', value: ~/.claude }) returns dead (trailing .claude with no
statusReason: expected 'unsupported' to be 'dead' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/references/resolver.ts:104:7
     return null;
   }
   const next = segments[claudeIndex + 1];
-  if (next === undefined || next === "") {
+  if (false || next === "") {
     return null;
   }
killedBy: Resolving a path that ends exactly at .claude with no segment after returns the dead outcome (no category to inspect) resolve({ kind: 'path', value: ~/.claude }) returns dead (trailing .claude with no
statusReason: expected 'unsupported' to be 'dead' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/resolver.ts:110:88
   return next;
 }
 
-function resolveNameReference(value: string, registry: ReferenceRegistry): ResolvedRef {
-  const matches = lookupByName(registry, value);
-  if (matches.length === 1) {
-    return { tag: "live", entry: matches[0]! };
-  }
-  if (matches.length >= 2) {
-    return { tag: "ambiguous", candidates: matches };
-  }
-  return { tag: "dead", searchedScopes: SEARCHED_SCOPES };
-}
+function resolveNameReference(value: string, registry: ReferenceRegistry): ResolvedRef {}
 
 function resolvePathReference(value: string, registry: ReferenceRegistry): ResolvedRef {
killedBy: Resolving a reference whose name matches a single registry entry returns the live outcome resolve({ kind: 'name', value: 'nw-bdd-requirements' }, registry) returns { tag: 'live', entry: <user-scope sk
statusReason: Cannot read properties of undefined (reading 'tag')

[Killed] BlockStatement
norbert-config/domain/references/resolver.ts:112:29
 
 function resolveNameReference(value: string, registry: ReferenceRegistry): ResolvedRef {
   const matches = lookupByName(registry, value);
-  if (matches.length === 1) {
-    return { tag: "live", entry: matches[0]! };
-  }
+  if (matches.length === 1) {}
   if (matches.length >= 2) {
     return { tag: "ambiguous", candidates: matches };
killedBy: Resolving a reference whose name matches a single registry entry returns the live outcome resolve({ kind: 'name', value: 'nw-bdd-requirements' }, registry) returns { tag: 'live', entry: <user-scope sk
statusReason: expected 'dead' to be 'live' // Object.is equality

[Killed] EqualityOperator
norbert-config/domain/references/resolver.ts:112:7
 
 function resolveNameReference(value: string, registry: ReferenceRegistry): ResolvedRef {
   const matches = lookupByName(registry, value);
-  if (matches.length === 1) {
+  if (matches.length !== 1) {
     return { tag: "live", entry: matches[0]! };
   }
killedBy: Resolving a reference whose name matches a single registry entry returns the live outcome resolve({ kind: 'name', value: 'nw-bdd-requirements' }, registry) returns { tag: 'live', entry: <user-scope sk
statusReason: expected 'dead' to be 'live' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/references/resolver.ts:115:7
   if (matches.length === 1) {
     return { tag: "live", entry: matches[0]! };
   }
-  if (matches.length >= 2) {
+  if (false) {
     return { tag: "ambiguous", candidates: matches };
   }
killedBy: Resolving a reference whose name matches two or more registry entries returns the ambiguous outcome resolve({ kind: 'name', value: 'release' }, registry) returns { tag: 'ambiguous', candidates: [proje
statusReason: expected 'dead' to be 'ambiguous' // Object.is equality

[Killed] EqualityOperator
norbert-config/domain/references/resolver.ts:115:7
   if (matches.length === 1) {
     return { tag: "live", entry: matches[0]! };
   }
-  if (matches.length >= 2) {
+  if (matches.length < 2) {
     return { tag: "ambiguous", candidates: matches };
   }
killedBy: Resolving a reference whose name matches two or more registry entries returns the ambiguous outcome resolve({ kind: 'name', value: 'release' }, registry) returns { tag: 'ambiguous', candidates: [proje
statusReason: expected 'dead' to be 'ambiguous' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/references/resolver.ts:116:19
     return { tag: "live", entry: matches[0]! };
   }
   if (matches.length >= 2) {
-    return { tag: "ambiguous", candidates: matches };
+    return { tag: "", candidates: matches };
   }
   return { tag: "dead", searchedScopes: SEARCHED_SCOPES };
killedBy: Resolving a reference whose name matches two or more registry entries returns the ambiguous outcome resolve({ kind: 'name', value: 'release' }, registry) returns { tag: 'ambiguous', candidates: [proje
statusReason: expected '' to be 'ambiguous' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/resolver.ts:121:88
   return { tag: "dead", searchedScopes: SEARCHED_SCOPES };
 }
 
-function resolvePathReference(value: string, registry: ReferenceRegistry): ResolvedRef {
-  const hit = lookupByPath(registry, value);
-  if (hit !== null) {
-    return { tag: "live", entry: hit };
-  }
-
-  const category = extractDotClaudeCategory(value);
-  if (category !== null && !SUPPORTED_CATEGORIES.includes(category)) {
-    return {
-      tag: "unsupported",
-      path: value,
-      reason: `under .claude/ but not a recognised category (${SUPPORTED_CATEGORIES.join(", ")}); got "${category}"`,
-    };
-  }
-
-  return { tag: "dead", searchedScopes: SEARCHED_SCOPES };
-}
+function resolvePathReference(value: string, registry: ReferenceRegistry): ResolvedRef {}
 
 // ---------------------------------------------------------------------------
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: Cannot read properties of undefined (reading 'tag')

[Killed] ConditionalExpression
norbert-config/domain/references/resolver.ts:123:7
 
 function resolvePathReference(value: string, registry: ReferenceRegistry): ResolvedRef {
   const hit = lookupByPath(registry, value);
-  if (hit !== null) {
+  if (false) {
     return { tag: "live", entry: hit };
   }
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected 'dead' to be 'live' // Object.is equality

[Killed] EqualityOperator
norbert-config/domain/references/resolver.ts:123:7
 
 function resolvePathReference(value: string, registry: ReferenceRegistry): ResolvedRef {
   const hit = lookupByPath(registry, value);
-  if (hit !== null) {
+  if (hit === null) {
     return { tag: "live", entry: hit };
   }
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected 'live' to be 'unsupported' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/resolver.ts:128:70
   }
 
   const category = extractDotClaudeCategory(value);
-  if (category !== null && !SUPPORTED_CATEGORIES.includes(category)) {
-    return {
-      tag: "unsupported",
-      path: value,
-      reason: `under .claude/ but not a recognised category (${SUPPORTED_CATEGORIES.join(", ")}); got "${category}"`,
-    };
-  }
+  if (category !== null && !SUPPORTED_CATEGORIES.includes(category)) {}
 
   return { tag: "dead", searchedScopes: SEARCHED_SCOPES };
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected 'dead' to be 'unsupported' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/references/resolver.ts:128:7
   }
 
   const category = extractDotClaudeCategory(value);
-  if (category !== null && !SUPPORTED_CATEGORIES.includes(category)) {
+  if (true) {
     return {
       tag: "unsupported",
killedBy: Resolving a path that does not lie under .claude returns the dead outcome (extractDotClaudeCategory miss branch) resolve({ kind: 'path', value: /tmp/random/file.txt }) returns dead (leading-slash path
statusReason: expected 'unsupported' to be 'dead' // Object.is equality

[Killed] ObjectLiteral
norbert-config/domain/references/resolver.ts:136:10
     };
   }
 
-  return { tag: "dead", searchedScopes: SEARCHED_SCOPES };
+  return {};
 }
 
killedBy: Resolving a path that does not lie under .claude returns the dead outcome (extractDotClaudeCategory miss branch) resolve({ kind: 'path', value: /tmp/random/file.txt }) returns dead (leading-slash path
statusReason: expected undefined to be 'dead' // Object.is equality

[Killed] BlockStatement
norbert-config/domain/references/resolver.ts:152:83
  *   - `path` -> exact-path match; on miss, `.claude/<unknown-category>/`
  *               yields unsupported, all other misses yield dead
  */
-export function resolve(ref: Reference, registry: ReferenceRegistry): ResolvedRef {
-  switch (ref.kind) {
-    case "name":
-      return resolveNameReference(ref.value, registry);
-    case "path":
-      return resolvePathReference(ref.value, registry);
-    default: {
-      // Exhaustiveness check -- a new `Reference` kind must add a case here.
-      const _exhaustive: never = ref;
-      return _exhaustive;
-    }
-  }
-}
+export function resolve(ref: Reference, registry: ReferenceRegistry): ResolvedRef {}
 
killedBy: Resolving a reference whose name matches a single registry entry returns the live outcome resolve({ kind: 'name', value: 'nw-bdd-requirements' }, registry) returns { tag: 'live', entry: <user-scope sk
statusReason: Cannot read properties of undefined (reading 'tag')

[Killed] ConditionalExpression
norbert-config/domain/references/resolver.ts:154:5
  */
 export function resolve(ref: Reference, registry: ReferenceRegistry): ResolvedRef {
   switch (ref.kind) {
-    case "name":
-      return resolveNameReference(ref.value, registry);
+    case "name":
     case "path":
       return resolvePathReference(ref.value, registry);
killedBy: Resolving a reference whose name matches a single registry entry returns the live outcome resolve({ kind: 'name', value: 'nw-bdd-requirements' }, registry) returns { tag: 'live', entry: <user-scope sk
statusReason: expected 'dead' to be 'live' // Object.is equality

[Killed] StringLiteral
norbert-config/domain/references/resolver.ts:154:10
  */
 export function resolve(ref: Reference, registry: ReferenceRegistry): ResolvedRef {
   switch (ref.kind) {
-    case "name":
+    case "":
       return resolveNameReference(ref.value, registry);
     case "path":
killedBy: Resolving a reference whose name matches a single registry entry returns the live outcome resolve({ kind: 'name', value: 'nw-bdd-requirements' }, registry) returns { tag: 'live', entry: <user-scope sk
statusReason: expected undefined to be 'live' // Object.is equality

[Killed] ConditionalExpression
norbert-config/domain/references/resolver.ts:156:5
   switch (ref.kind) {
     case "name":
       return resolveNameReference(ref.value, registry);
-    case "path":
-      return resolvePathReference(ref.value, registry);
+    case "path":
     default: {
       // Exhaustiveness check -- a new `Reference` kind must add a case here.
killedBy: Resolving a file-path reference to an item type the plugin does not expose returns the unsupported outcome resolve({ kind: 'path', value: '~/.claude/unknown-kind/foo.bin' }, registry) returns { tag: '
statusReason: expected undefined to be 'unsupported' // Object.is equality

[NoCoverage] ConditionalExpression
norbert-config/domain/references/resolver.ts:158:5
       return resolveNameReference(ref.value, registry);
     case "path":
       return resolvePathReference(ref.value, registry);
-    default: {
-      // Exhaustiveness check -- a new `Reference` kind must add a case here.
-      const _exhaustive: never = ref;
-      return _exhaustive;
-    }
+    default:
   }
 }

[NoCoverage] BlockStatement
norbert-config/domain/references/resolver.ts:158:14
       return resolveNameReference(ref.value, registry);
     case "path":
       return resolvePathReference(ref.value, registry);
-    default: {
-      // Exhaustiveness check -- a new `Reference` kind must add a case here.
-      const _exhaustive: never = ref;
-      return _exhaustive;
-    }
+    default: {}
   }
 }
