[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeHitTest.ts:73:17
 // ---------------------------------------------------------------------------
 
 /** Map a sample time `t` to x pixels within `[0, width]` given `now`. */
-const timeToX = (t: number, width: number, now: number): number =>
-  width * (1 - (now - t) / WINDOW_MS);
+const timeToX = () => undefined;
 
 /** Inverse of timeToX: map a pointer x to a cursor-time given `now`. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected undefined to be close to 975, received difference is NaN, but expected 0.0005

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:74:12
 
 /** Map a sample time `t` to x pixels within `[0, width]` given `now`. */
 const timeToX = (t: number, width: number, now: number): number =>
-  width * (1 - (now - t) / WINDOW_MS);
+  width * (1 + (now - t) / WINDOW_MS);
 
 /** Inverse of timeToX: map a pointer x to a cursor-time given `now`. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected 1025 to be close to 975, received difference is 50, but expected 0.0005

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:74:3
 
 /** Map a sample time `t` to x pixels within `[0, width]` given `now`. */
 const timeToX = (t: number, width: number, now: number): number =>
-  width * (1 - (now - t) / WINDOW_MS);
+  width / (1 - (now - t) / WINDOW_MS);
 
 /** Inverse of timeToX: map a pointer x to a cursor-time given `now`. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected 1025.6410256410256 to be close to 975, received difference is 50.641025641025635, but expected 0.0005

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeHitTest.ts:77:17
   width * (1 - (now - t) / WINDOW_MS);
 
 /** Inverse of timeToX: map a pointer x to a cursor-time given `now`. */
-const xToTime = (x: number, width: number, now: number): number =>
-  now - (1 - x / width) * WINDOW_MS;
+const xToTime = () => undefined;
 
 /** Map a sample value `v` to y pixels within `[0, height]` given `yMax`. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected undefined to be 999998500 // Object.is equality

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:78:10
 
 /** Inverse of timeToX: map a pointer x to a cursor-time given `now`. */
 const xToTime = (x: number, width: number, now: number): number =>
-  now - (1 - x / width) * WINDOW_MS;
+  now - (1 + x / width) * WINDOW_MS;
 
 /** Map a sample value `v` to y pixels within `[0, height]` given `yMax`. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected 999881500 to be 999998500 // Object.is equality

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:78:14
 
 /** Inverse of timeToX: map a pointer x to a cursor-time given `now`. */
 const xToTime = (x: number, width: number, now: number): number =>
-  now - (1 - x / width) * WINDOW_MS;
+  now - (1 - x * width) * WINDOW_MS;
 
 /** Map a sample value `v` to y pixels within `[0, height]` given `yMax`. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected 59499940000 to be 999998500 // Object.is equality

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeHitTest.ts:81:18
   now - (1 - x / width) * WINDOW_MS;
 
 /** Map a sample value `v` to y pixels within `[0, height]` given `yMax`. */
-const valueToY = (v: number, height: number, yMax: number): number =>
-  height * (1 - v / yMax);
+const valueToY = () => undefined;
 
 /**
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected undefined to be close to 133.33333333333334, received difference is NaN, but expected 0.0005

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:82:13
 
 /** Map a sample value `v` to y pixels within `[0, height]` given `yMax`. */
 const valueToY = (v: number, height: number, yMax: number): number =>
-  height * (1 - v / yMax);
+  height * (1 + v / yMax);
 
 /**
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected 666.6666666666666 to be close to 133.33333333333334, received difference is 533.3333333333333, but expected 0.0005

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:82:3
 
 /** Map a sample value `v` to y pixels within `[0, height]` given `yMax`. */
 const valueToY = (v: number, height: number, yMax: number): number =>
-  height * (1 - v / yMax);
+  height / (1 - v / yMax);
 
 /**
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected 1199.9999999999998 to be close to 133.33333333333334, received difference is 1066.6666666666665, but expected 0.0005

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeHitTest.ts:91:27
  * the edge, so the user can hover anywhere in the canvas at that x-time
  * and expect to select this trace.
  */
-const isSampleOffCanvas = (sampleY: number, height: number): boolean =>
-  sampleY < 0 || sampleY > height;
+const isSampleOffCanvas = () => undefined;
 
 /**
killedBy: WS-4: User hovers over a trace and a tooltip identifies the session, value, and age hit-test returns session-2, value 47, age near 1.5 seconds
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:92:3
  * and expect to select this trace.
  */
 const isSampleOffCanvas = (sampleY: number, height: number): boolean =>
-  sampleY < 0 || sampleY > height;
+  true;
 
 /**
killedBy: scopeHitTest — beyond snap distance returns null when the pointer is vertically farther than HOVER_SNAP_DISTANCE_PX from the trace
statusReason: expected { sessionId: 'session-1', …(6) } to be null

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:92:18
  * and expect to select this trace.
  */
 const isSampleOffCanvas = (sampleY: number, height: number): boolean =>
-  sampleY < 0 || sampleY > height;
+  sampleY < 0 || false;
 
 /**
killedBy: scopeHitTest — off-canvas samples below baseline selects a trace whose sample is below baseline (clipped to bottom edge)
statusReason: expected null not to be null

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeHitTest.ts:103:33
  * off-scale trace is rendered pinned to the edge and the user should always
  * be able to investigate it).
  */
-const verticalDistanceToTrace = (
-  sampleY: number,
-  pointerY: number,
-  height: number,
-): number =>
-  isSampleOffCanvas(sampleY, height) ? 0 : Math.abs(sampleY - pointerY);
+const verticalDistanceToTrace = () => undefined;
 
 /** Whether the pointer lies inside the canvas rectangle. */
killedBy: scopeHitTest — beyond snap distance returns null when the pointer is vertically farther than HOVER_SNAP_DISTANCE_PX from the trace
statusReason: expected { sessionId: 'session-1', …(6) } to be null

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:108:53
   pointerY: number,
   height: number,
 ): number =>
-  isSampleOffCanvas(sampleY, height) ? 0 : Math.abs(sampleY - pointerY);
+  isSampleOffCanvas(sampleY, height) ? 0 : Math.abs(sampleY + pointerY);
 
 /** Whether the pointer lies inside the canvas rectangle. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeHitTest.ts:111:31
   isSampleOffCanvas(sampleY, height) ? 0 : Math.abs(sampleY - pointerY);
 
 /** Whether the pointer lies inside the canvas rectangle. */
-const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
-  pointer.x >= 0 &&
-  pointer.x <= pointer.width &&
-  pointer.y >= 0 &&
-  pointer.y <= pointer.height;
+const isPointerInsideCanvas = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] LogicalOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:112:3
 
 /** Whether the pointer lies inside the canvas rectangle. */
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
-  pointer.x >= 0 &&
-  pointer.x <= pointer.width &&
-  pointer.y >= 0 &&
-  pointer.y <= pointer.height;
+  pointer.x >= 0 && pointer.x <= pointer.width && pointer.y >= 0 || pointer.y <= pointer.height;
 
 // ---------------------------------------------------------------------------
killedBy: scopeHitTest — pointer outside canvas bounds returns null when pointer x is negative (and the inside-case would select)
statusReason: expected { sessionId: 'selectable', …(6) } to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:112:3
 
 /** Whether the pointer lies inside the canvas rectangle. */
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
-  pointer.x >= 0 &&
+  pointer.x > 0 &&
   pointer.x <= pointer.width &&
   pointer.y >= 0 &&
killedBy: scopeHitTest — pointer exactly on canvas edges (inclusive) returns a selection when pointer.x === 0 (left edge inclusive)
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:113:3
 /** Whether the pointer lies inside the canvas rectangle. */
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
   pointer.x >= 0 &&
-  pointer.x <= pointer.width &&
+  true &&
   pointer.y >= 0 &&
   pointer.y <= pointer.height;
killedBy: scopeHitTest — pointer outside canvas bounds returns null when pointer x exceeds width (and the inside-case would select)
statusReason: expected { sessionId: 'selectable', …(6) } to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:113:3
 /** Whether the pointer lies inside the canvas rectangle. */
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
   pointer.x >= 0 &&
-  pointer.x <= pointer.width &&
+  pointer.x < pointer.width &&
   pointer.y >= 0 &&
   pointer.y <= pointer.height;
killedBy: scopeHitTest — pointer exactly on canvas edges (inclusive) returns a selection when pointer.x === width (right edge inclusive)
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:114:3
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
   pointer.x >= 0 &&
   pointer.x <= pointer.width &&
-  pointer.y >= 0 &&
+  pointer.y < 0 &&
   pointer.y <= pointer.height;
 
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:114:3
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
   pointer.x >= 0 &&
   pointer.x <= pointer.width &&
-  pointer.y >= 0 &&
+  pointer.y > 0 &&
   pointer.y <= pointer.height;
 
killedBy: scopeHitTest — pointer exactly on canvas edges (inclusive) returns a selection when pointer.y === 0 (top edge inclusive) and a trace is near top
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:115:3
   pointer.x >= 0 &&
   pointer.x <= pointer.width &&
   pointer.y >= 0 &&
-  pointer.y <= pointer.height;
+  pointer.y > pointer.height;
 
 // ---------------------------------------------------------------------------
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:115:3
   pointer.x >= 0 &&
   pointer.x <= pointer.width &&
   pointer.y >= 0 &&
-  pointer.y <= pointer.height;
+  pointer.y < pointer.height;
 
 // ---------------------------------------------------------------------------
killedBy: scopeHitTest — pointer exactly on canvas edges (inclusive) returns a selection when pointer.y === height (bottom edge inclusive) and a trace is near bottom
statusReason: expected null not to be null

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeHitTest.ts:128:21
 const valueAtCursorTime = (
   trace: FrameTrace,
   cursorTime: number,
-): number | null => {
-  if (trace.samples.length === 0) return null;
-  let latestValue: number | null = null;
-  let latestTime = Number.NEGATIVE_INFINITY;
-  for (const sample of trace.samples) {
-    if (sample.t <= cursorTime && sample.t >= latestTime) {
-      latestTime = sample.t;
-      latestValue = sample.v;
-    }
-  }
-  // Fallback: if every sample is strictly after cursorTime, snap to the
-  // earliest sample (the pointer is to the left of the first observation).
-  if (latestValue === null) {
-    let earliest = trace.samples[0];
-    for (const sample of trace.samples) {
-      if (sample.t < earliest.t) earliest = sample;
-    }
-    latestValue = earliest.v;
-  }
-  return latestValue;
-};
+): number | null => {};
 
 // ---------------------------------------------------------------------------
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:129:7
   trace: FrameTrace,
   cursorTime: number,
 ): number | null => {
-  if (trace.samples.length === 0) return null;
+  if (false) return null;
   let latestValue: number | null = null;
   let latestTime = Number.NEGATIVE_INFINITY;
killedBy: scopeHitTest — empty frame returns null when all traces have zero samples
statusReason: Cannot read properties of undefined (reading 'v')

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:129:7
   trace: FrameTrace,
   cursorTime: number,
 ): number | null => {
-  if (trace.samples.length === 0) return null;
+  if (trace.samples.length !== 0) return null;
   let latestValue: number | null = null;
   let latestTime = Number.NEGATIVE_INFINITY;
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeHitTest.ts:132:39
   if (trace.samples.length === 0) return null;
   let latestValue: number | null = null;
   let latestTime = Number.NEGATIVE_INFINITY;
-  for (const sample of trace.samples) {
-    if (sample.t <= cursorTime && sample.t >= latestTime) {
-      latestTime = sample.t;
-      latestValue = sample.v;
-    }
-  }
+  for (const sample of trace.samples) {}
   // Fallback: if every sample is strictly after cursorTime, snap to the
   // earliest sample (the pointer is to the left of the first observation).
killedBy: IC-S15 @property: Hit-test consistency between trace value and returned value selection value equals the selected trace's sampled value at selection.time within epsilon
statusReason: Property failed after 3 tests
{ seed: 1297186857, path: "2:0:0:1:0:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:4:2:1:0:2:3:1:2:1:0:0:0:0:1:1:1:1:0:3:0:0:4:1:1:0:3:0:1:0:49:3:1:0:0:0:0:0:2:2", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":1,"v":14.409282700421942},{"ageMs":0,"v":0.01}],100,100,0.9999999999990067,0,0]
Shrunk 59 time(s)

Hint: Enable verbose mode in order to have the list of all f

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:133:35
   let latestValue: number | null = null;
   let latestTime = Number.NEGATIVE_INFINITY;
   for (const sample of trace.samples) {
-    if (sample.t <= cursorTime && sample.t >= latestTime) {
+    if (sample.t <= cursorTime && sample.t < latestTime) {
       latestTime = sample.t;
       latestValue = sample.v;
killedBy: IC-S15 @property: Hit-test consistency between trace value and returned value selection value equals the selected trace's sampled value at selection.time within epsilon
statusReason: Property failed after 6 tests
{ seed: -1252692457, path: "5:0:0:0:47:0:1:0:0:0:0:0:0:0:0:0:0:0:2:0:0:0:0:4:0:0:0:1:0:2:0:0:0:0:0:0:2:2:2:2:2:2:15:2:3:3:2:2:2:3:2:2:3:3:8:2:5:4:3:3:2:8:3:2:3:14:6:3:3:3:3:3:4:4:3:3:3:11:3:3:4:5:3:3:4:3:3:3:4:3:3:3:3:4:3:3:3:3:4", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":52684,"v":0.01},{"ageMs":29047,"v":0.01},{"ageMs":6314,"v":0.0100050000000000

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeHitTest.ts:133:59
   let latestValue: number | null = null;
   let latestTime = Number.NEGATIVE_INFINITY;
   for (const sample of trace.samples) {
-    if (sample.t <= cursorTime && sample.t >= latestTime) {
-      latestTime = sample.t;
-      latestValue = sample.v;
-    }
+    if (sample.t <= cursorTime && sample.t >= latestTime) {}
   }
   // Fallback: if every sample is strictly after cursorTime, snap to the
killedBy: IC-S15 @property: Hit-test consistency between trace value and returned value selection value equals the selected trace's sampled value at selection.time within epsilon
statusReason: Property failed after 4 tests
{ seed: 1474356332, path: "3:0:0:0:1:1:1:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:4:1:2:3:2:1:1:2:2:1:1:2:2:2:0:3:0:0:0:0:0:0:0:0:0:0:0:1:0:1:0:0:49:3:1:0:0:0:1:2:2", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":1,"v":11.146788990825687},{"ageMs":0,"v":0.01}],100,100,0.9999999999990067,0,0]
Shrunk 64 time(s)

Hint: Enable verbose mode in order to have the lis

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:140:7
   }
   // Fallback: if every sample is strictly after cursorTime, snap to the
   // earliest sample (the pointer is to the left of the first observation).
-  if (latestValue === null) {
+  if (latestValue !== null) {
     let earliest = trace.samples[0];
     for (const sample of trace.samples) {
killedBy: IC-S15 @property: Hit-test consistency between trace value and returned value selection value equals the selected trace's sampled value at selection.time within epsilon
statusReason: Property failed after 45 tests
{ seed: -39286744, path: "44:0:0:0:1:0:0:0:1:2:1:1:1:1:1:1:1:1:1:1:1:4:2:1:0:3:0:4:0:1:2:2:5:1:0:0:0:0:2:1:2:0:0:2:1:0:0:1:0:0:49:3:1:0:0:0:4:4", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":1,"v":14.427792915531336},{"ageMs":0,"v":0.01}],100,100,0.9999999999990067,0,0]
Shrunk 57 time(s)

Hint: Enable verbose mode in order to have the list of all fail

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:140:7
   }
   // Fallback: if every sample is strictly after cursorTime, snap to the
   // earliest sample (the pointer is to the left of the first observation).
-  if (latestValue === null) {
+  if (false) {
     let earliest = trace.samples[0];
     for (const sample of trace.samples) {
killedBy: scopeHitTest — pointer exactly on canvas edges (inclusive) returns a selection when pointer.x === 0 (left edge inclusive)
statusReason: expected null not to be null

[Survived] BlockStatement
norbert-usage/domain/phosphor/scopeHitTest.ts:142:41
   // earliest sample (the pointer is to the left of the first observation).
   if (latestValue === null) {
     let earliest = trace.samples[0];
-    for (const sample of trace.samples) {
-      if (sample.t < earliest.t) earliest = sample;
-    }
+    for (const sample of trace.samples) {}
     latestValue = earliest.v;
   }

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:143:11
   if (latestValue === null) {
     let earliest = trace.samples[0];
     for (const sample of trace.samples) {
-      if (sample.t < earliest.t) earliest = sample;
+      if (sample.t <= earliest.t) earliest = sample;
     }
     latestValue = earliest.v;
killedBy: scopeHitTest — sample time strictly after cursor vs. equal-to cursor fallback-earliest chooses the sample with the strictly smallest time when duplicates exist
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:143:11
   if (latestValue === null) {
     let earliest = trace.samples[0];
     for (const sample of trace.samples) {
-      if (sample.t < earliest.t) earliest = sample;
+      if (sample.t >= earliest.t) earliest = sample;
     }
     latestValue = earliest.v;
killedBy: IC-S15 @property: Hit-test consistency between trace value and returned value selection value equals the selected trace's sampled value at selection.time within epsilon
statusReason: Property failed after 5 tests
{ seed: 663864833, path: "4:0:0:2:0:0:0:0:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:2:3:0:3:0:0:0:0:1:0:0:2:0:0:3:1:0:1:0:1:0:2:0:3:1:0:0:1:0:1:2:1:1:1:1:0:0:0:5:0:2:1:1:0:0:0:1:0:1:1:0:2:1:3:0:0:0:1:2:4:1:0:0:0:2:1", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":1,"v":0.01},{"ageMs":0,"v":10.8}],100,100,0,0,0]
Shrunk 88 time(s)

Hint: Enable verbose mode in order

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeHitTest.ts:178:24
   pointer: PointerPosition,
   frame: Frame,
   cursorTime: number,
-): Candidate | null => {
-  const cursorValue = valueAtCursorTime(trace, cursorTime);
-  if (cursorValue === null) return null;
-  const displayX = timeToX(cursorTime, pointer.width, frame.now);
-  const displayY = valueToY(cursorValue, pointer.height, frame.yMax);
-  const verticalDistance = verticalDistanceToTrace(
-    displayY,
-    pointer.y,
-    pointer.height,
-  );
-  return {
-    trace,
-    cursorTime,
-    cursorValue,
-    displayX,
-    displayY,
-    verticalDistance,
-  };
-};
+): Candidate | null => {};
 
 /** Convert the winning candidate into a HoverSelection. */
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: Cannot read properties of undefined (reading 'verticalDistance')

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:180:7
   cursorTime: number,
 ): Candidate | null => {
   const cursorValue = valueAtCursorTime(trace, cursorTime);
-  if (cursorValue === null) return null;
+  if (true) return null;
   const displayX = timeToX(cursorTime, pointer.width, frame.now);
   const displayY = valueToY(cursorValue, pointer.height, frame.yMax);
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:180:7
   cursorTime: number,
 ): Candidate | null => {
   const cursorValue = valueAtCursorTime(trace, cursorTime);
-  if (cursorValue === null) return null;
+  if (cursorValue !== null) return null;
   const displayX = timeToX(cursorTime, pointer.width, frame.now);
   const displayY = valueToY(cursorValue, pointer.height, frame.yMax);
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeHitTest.ts:199:26
 };
 
 /** Convert the winning candidate into a HoverSelection. */
-const toHoverSelection = (
-  candidate: Candidate,
-  now: number,
-): HoverSelection => ({
-  sessionId: candidate.trace.sessionId,
-  color: candidate.trace.color,
-  value: candidate.cursorValue,
-  time: candidate.cursorTime,
-  ageMs: Math.max(0, now - candidate.cursorTime),
-  displayX: candidate.displayX,
-  displayY: candidate.displayY,
-});
+const toHoverSelection = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected undefined to be 'session-1' // Object.is equality

[Killed] MethodExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:207:10
   color: candidate.trace.color,
   value: candidate.cursorValue,
   time: candidate.cursorTime,
-  ageMs: Math.max(0, now - candidate.cursorTime),
+  ageMs: Math.min(0, now - candidate.cursorTime),
   displayX: candidate.displayX,
   displayY: candidate.displayY,
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected +0 to be close to 1500, received difference is 1500, but expected 0.0005

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:207:22
   color: candidate.trace.color,
   value: candidate.cursorValue,
   time: candidate.cursorTime,
-  ageMs: Math.max(0, now - candidate.cursorTime),
+  ageMs: Math.max(0, now + candidate.cursorTime),
   displayX: candidate.displayX,
   displayY: candidate.displayY,
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected 1999998500 to be close to 1500, received difference is 1999997000, but expected 0.0005

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeHitTest.ts:235:29
 export const scopeHitTest = (
   pointer: PointerPosition,
   frame: Frame,
-): HoverSelection | null => {
-  if (!isPointerInsideCanvas(pointer)) return null;
-  const cursorTime = xToTime(pointer.x, pointer.width, frame.now);
-  let winner: Candidate | null = null;
-  for (const trace of frame.traces) {
-    const candidate = candidateForTrace(trace, pointer, frame, cursorTime);
-    if (candidate === null) continue;
-    if (winner === null || candidate.verticalDistance < winner.verticalDistance) {
-      winner = candidate;
-    }
-  }
-  if (winner === null) return null;
-  if (winner.verticalDistance > HOVER_SNAP_DISTANCE_PX) return null;
-  return toHoverSelection(winner, frame.now);
-};
+): HoverSelection | null => {};
 
killedBy: IC-S15 @property: Hit-test consistency between trace value and returned value selection value equals the selected trace's sampled value at selection.time within epsilon
statusReason: Property failed after 1 tests
{ seed: -2019938331, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":0,"v":0.01}],100,100,0,0,0]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
norbert-usage/domain/phosphor/scopeHitTest.ts:236:7
   pointer: PointerPosition,
   frame: Frame,
 ): HoverSelection | null => {
-  if (!isPointerInsideCanvas(pointer)) return null;
+  if (isPointerInsideCanvas(pointer)) return null;
   const cursorTime = xToTime(pointer.x, pointer.width, frame.now);
   let winner: Candidate | null = null;
killedBy: WS-4: User hovers over a trace and a tooltip identifies the session, value, and age hit-test returns session-2, value 47, age near 1.5 seconds
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:236:7
   pointer: PointerPosition,
   frame: Frame,
 ): HoverSelection | null => {
-  if (!isPointerInsideCanvas(pointer)) return null;
+  if (true) return null;
   const cursorTime = xToTime(pointer.x, pointer.width, frame.now);
   let winner: Candidate | null = null;
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeHitTest.ts:239:37
   if (!isPointerInsideCanvas(pointer)) return null;
   const cursorTime = xToTime(pointer.x, pointer.width, frame.now);
   let winner: Candidate | null = null;
-  for (const trace of frame.traces) {
-    const candidate = candidateForTrace(trace, pointer, frame, cursorTime);
-    if (candidate === null) continue;
-    if (winner === null || candidate.verticalDistance < winner.verticalDistance) {
-      winner = candidate;
-    }
-  }
+  for (const trace of frame.traces) {}
   if (winner === null) return null;
   if (winner.verticalDistance > HOVER_SNAP_DISTANCE_PX) return null;
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:241:9
   let winner: Candidate | null = null;
   for (const trace of frame.traces) {
     const candidate = candidateForTrace(trace, pointer, frame, cursorTime);
-    if (candidate === null) continue;
+    if (true) continue;
     if (winner === null || candidate.verticalDistance < winner.verticalDistance) {
       winner = candidate;
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:241:9
   let winner: Candidate | null = null;
   for (const trace of frame.traces) {
     const candidate = candidateForTrace(trace, pointer, frame, cursorTime);
-    if (candidate === null) continue;
+    if (candidate !== null) continue;
     if (winner === null || candidate.verticalDistance < winner.verticalDistance) {
       winner = candidate;
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null
