[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:242:28
   for (const trace of frame.traces) {
     const candidate = candidateForTrace(trace, pointer, frame, cursorTime);
     if (candidate === null) continue;
-    if (winner === null || candidate.verticalDistance < winner.verticalDistance) {
+    if (winner === null || false) {
       winner = candidate;
     }
killedBy: scopeHitTest — nearest of two candidates selects the trace whose sample is vertically closer to the pointer
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:242:28
   for (const trace of frame.traces) {
     const candidate = candidateForTrace(trace, pointer, frame, cursorTime);
     if (candidate === null) continue;
-    if (winner === null || candidate.verticalDistance < winner.verticalDistance) {
+    if (winner === null || candidate.verticalDistance >= winner.verticalDistance) {
       winner = candidate;
     }
killedBy: WS-4: User hovers over a trace and a tooltip identifies the session, value, and age hit-test returns session-2, value 47, age near 1.5 seconds
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:246:7
       winner = candidate;
     }
   }
-  if (winner === null) return null;
+  if (true) return null;
   if (winner.verticalDistance > HOVER_SNAP_DISTANCE_PX) return null;
   return toHoverSelection(winner, frame.now);
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:246:7
       winner = candidate;
     }
   }
-  if (winner === null) return null;
+  if (winner !== null) return null;
   if (winner.verticalDistance > HOVER_SNAP_DISTANCE_PX) return null;
   return toHoverSelection(winner, frame.now);
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:247:7
     }
   }
   if (winner === null) return null;
-  if (winner.verticalDistance > HOVER_SNAP_DISTANCE_PX) return null;
+  if (winner.verticalDistance <= HOVER_SNAP_DISTANCE_PX) return null;
   return toHoverSelection(winner, frame.now);
 };
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:247:7
     }
   }
   if (winner === null) return null;
-  if (winner.verticalDistance > HOVER_SNAP_DISTANCE_PX) return null;
+  if (true) return null;
   return toHoverSelection(winner, frame.now);
 };
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null
