[Killed] BlockStatement
plugins/norbert-usage/adapters/multiSessionStore.ts:224:60
   }
 
   /** Initialize empty v2 rate-history buckets for a newly-added session. */
-  const initPhosphorBuckets = (sessionId: string): void => {
-    const metricMap = new Map<MetricId, PhosphorRateSample[]>();
-    for (const metric of METRIC_IDS) metricMap.set(metric, []);
-    sessionRateHistories.set(sessionId, metricMap);
-    sessionPulseLogs.set(sessionId, []);
-  };
+  const initPhosphorBuckets = (sessionId: string): void => {};
 
   let batchDepth = 0;
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[Killed] ArrayDeclaration
plugins/norbert-usage/adapters/multiSessionStore.ts:226:60
   /** Initialize empty v2 rate-history buckets for a newly-added session. */
   const initPhosphorBuckets = (sessionId: string): void => {
     const metricMap = new Map<MetricId, PhosphorRateSample[]>();
-    for (const metric of METRIC_IDS) metricMap.set(metric, []);
+    for (const metric of METRIC_IDS) metricMap.set(metric, ["Stryker was here"]);
     sessionRateHistories.set(sessionId, metricMap);
     sessionPulseLogs.set(sessionId, []);
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [ 'Stryker was here', …(3) ] to have a length of 3 but got 4

[Killed] BlockStatement
plugins/norbert-usage/adapters/multiSessionStore.ts:405:14
     metric: MetricId,
     t: number,
     v: number,
-  ): void => {
-    const metricMap = sessionRateHistories.get(sessionId);
-    if (!metricMap) return; // unknown session -- silently drop (v1 parity)
-    const history = metricMap.get(metric);
-    if (!history) return;
-    history.push({ t, v });
-    notifySubscribers();
-  };
+  ): void => {};
 
   const appendPulse = (sessionId: string, pulse: Pulse): void => {
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
plugins/norbert-usage/adapters/multiSessionStore.ts:407:9
     v: number,
   ): void => {
     const metricMap = sessionRateHistories.get(sessionId);
-    if (!metricMap) return; // unknown session -- silently drop (v1 parity)
+    if (true) return; // unknown session -- silently drop (v1 parity)
     const history = metricMap.get(metric);
     if (!history) return;
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[Killed] BooleanLiteral
plugins/norbert-usage/adapters/multiSessionStore.ts:407:9
     v: number,
   ): void => {
     const metricMap = sessionRateHistories.get(sessionId);
-    if (!metricMap) return; // unknown session -- silently drop (v1 parity)
+    if (metricMap) return; // unknown session -- silently drop (v1 parity)
     const history = metricMap.get(metric);
     if (!history) return;
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
plugins/norbert-usage/adapters/multiSessionStore.ts:409:9
     const metricMap = sessionRateHistories.get(sessionId);
     if (!metricMap) return; // unknown session -- silently drop (v1 parity)
     const history = metricMap.get(metric);
-    if (!history) return;
+    if (true) return;
     history.push({ t, v });
     notifySubscribers();
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[Killed] BooleanLiteral
plugins/norbert-usage/adapters/multiSessionStore.ts:409:9
     const metricMap = sessionRateHistories.get(sessionId);
     if (!metricMap) return; // unknown session -- silently drop (v1 parity)
     const history = metricMap.get(metric);
-    if (!history) return;
+    if (history) return;
     history.push({ t, v });
     notifySubscribers();
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[Killed] ObjectLiteral
plugins/norbert-usage/adapters/multiSessionStore.ts:410:18
     if (!metricMap) return; // unknown session -- silently drop (v1 parity)
     const history = metricMap.get(metric);
     if (!history) return;
-    history.push({ t, v });
+    history.push({});
     notifySubscribers();
   };
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
plugins/norbert-usage/adapters/multiSessionStore.ts:414:66
     notifySubscribers();
   };
 
-  const appendPulse = (sessionId: string, pulse: Pulse): void => {
-    const log = sessionPulseLogs.get(sessionId);
-    if (!log) return;
-    log.push(pulse);
-    notifySubscribers();
-  };
+  const appendPulse = (sessionId: string, pulse: Pulse): void => {};
 
   const getRateHistory = (
killedBy: IC-S7: Appending pulses preserves arrival order on read pulses read back in the arrival order they were appended
statusReason: expected [] to have a length of 3 but got +0

[Killed] BooleanLiteral
plugins/norbert-usage/adapters/multiSessionStore.ts:416:9
 
   const appendPulse = (sessionId: string, pulse: Pulse): void => {
     const log = sessionPulseLogs.get(sessionId);
-    if (!log) return;
+    if (log) return;
     log.push(pulse);
     notifySubscribers();
killedBy: IC-S7: Appending pulses preserves arrival order on read pulses read back in the arrival order they were appended
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
plugins/norbert-usage/adapters/multiSessionStore.ts:416:9
 
   const appendPulse = (sessionId: string, pulse: Pulse): void => {
     const log = sessionPulseLogs.get(sessionId);
-    if (!log) return;
+    if (true) return;
     log.push(pulse);
     notifySubscribers();
killedBy: IC-S7: Appending pulses preserves arrival order on read pulses read back in the arrival order they were appended
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
plugins/norbert-usage/adapters/multiSessionStore.ts:424:43
   const getRateHistory = (
     sessionId: string,
     metric: MetricId,
-  ): ReadonlyArray<PhosphorRateSample> => {
-    const metricMap = sessionRateHistories.get(sessionId);
-    if (!metricMap) return [];
-    const history = metricMap.get(metric);
-    return history ?? [];
-  };
+  ): ReadonlyArray<PhosphorRateSample> => {};
 
   const getPulses = (
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
plugins/norbert-usage/adapters/multiSessionStore.ts:426:9
     metric: MetricId,
   ): ReadonlyArray<PhosphorRateSample> => {
     const metricMap = sessionRateHistories.get(sessionId);
-    if (!metricMap) return [];
+    if (metricMap) return [];
     const history = metricMap.get(metric);
     return history ?? [];
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
plugins/norbert-usage/adapters/multiSessionStore.ts:426:9
     metric: MetricId,
   ): ReadonlyArray<PhosphorRateSample> => {
     const metricMap = sessionRateHistories.get(sessionId);
-    if (!metricMap) return [];
+    if (false) return [];
     const history = metricMap.get(metric);
     return history ?? [];
killedBy: IC-S8: Querying a non-existent session returns empty history and pulses returns empty collections for a never-added session id
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] LogicalOperator
plugins/norbert-usage/adapters/multiSessionStore.ts:428:12
     const metricMap = sessionRateHistories.get(sessionId);
     if (!metricMap) return [];
     const history = metricMap.get(metric);
-    return history ?? [];
+    return history && [];
   };
 
killedBy: IC-S6: Appending rate samples preserves temporal order on read samples read back in oldest-to-newest order
statusReason: expected [] to have a length of 3 but got +0

[NoCoverage] ArrayDeclaration
plugins/norbert-usage/adapters/multiSessionStore.ts:428:23
     const metricMap = sessionRateHistories.get(sessionId);
     if (!metricMap) return [];
     const history = metricMap.get(metric);
-    return history ?? [];
+    return history ?? ["Stryker was here"];
   };
 

[Killed] BlockStatement
plugins/norbert-usage/adapters/multiSessionStore.ts:434:30
   const getPulses = (
     sessionId: string,
     now?: number,
-  ): ReadonlyArray<Pulse> => {
-    const log = sessionPulseLogs.get(sessionId);
-    if (!log) return [];
-    // Retention trim is idempotent and always applied. When `now` is
-    // supplied (e.g. by scopeProjection), use it so trimming aligns with
-    // the frame's logical clock. Otherwise fall back to wall-clock
-    // `Date.now()` so callers never observe pulses older than the
-    // retention cutoff (the "pulses older than 5s are absent from
-    // store.getPulses" invariant).
-    const reference = now ?? Date.now();
-    return prunePulses(log, reference, PULSE_RETENTION_MS);
-  };
+  ): ReadonlyArray<Pulse> => {};
 
   const getSessionIds = (): ReadonlyArray<string> => Array.from(sessions.keys());
killedBy: IC-S7: Appending pulses preserves arrival order on read pulses read back in the arrival order they were appended
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
plugins/norbert-usage/adapters/multiSessionStore.ts:436:9
     now?: number,
   ): ReadonlyArray<Pulse> => {
     const log = sessionPulseLogs.get(sessionId);
-    if (!log) return [];
+    if (log) return [];
     // Retention trim is idempotent and always applied. When `now` is
     // supplied (e.g. by scopeProjection), use it so trimming aligns with
killedBy: IC-S7: Appending pulses preserves arrival order on read pulses read back in the arrival order they were appended
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
plugins/norbert-usage/adapters/multiSessionStore.ts:436:9
     now?: number,
   ): ReadonlyArray<Pulse> => {
     const log = sessionPulseLogs.get(sessionId);
-    if (!log) return [];
+    if (true) return [];
     // Retention trim is idempotent and always applied. When `now` is
     // supplied (e.g. by scopeProjection), use it so trimming aligns with
killedBy: IC-S7: Appending pulses preserves arrival order on read pulses read back in the arrival order they were appended
statusReason: expected [] to have a length of 3 but got +0

[Killed] LogicalOperator
plugins/norbert-usage/adapters/multiSessionStore.ts:443:23
     // `Date.now()` so callers never observe pulses older than the
     // retention cutoff (the "pulses older than 5s are absent from
     // store.getPulses" invariant).
-    const reference = now ?? Date.now();
+    const reference = now && Date.now();
     return prunePulses(log, reference, PULSE_RETENTION_MS);
   };
killedBy: IC-S7: Appending pulses preserves arrival order on read pulses read back in the arrival order they were appended
statusReason: expected [] to have a length of 3 but got +0
