[Killed] BlockStatement
norbert-usage/domain/phosphor/pulseTiming.ts:39:75
  *   - age = 3000 → 0.00  (clamped)
  *   - age = -500 → 1.00  (clamped — negative ages treated as fresh)
  */
-export const decayFactor = (ageMs: number, lifetimeMs: number): number => {
-  if (ageMs <= 0) return 1;
-  if (ageMs >= lifetimeMs) return 0;
-  return 1 - ageMs / lifetimeMs;
-};
+export const decayFactor = (ageMs: number, lifetimeMs: number): number => {};
 
 // ---------------------------------------------------------------------------
killedBy: decayFactor — age to decay mapping covers the three boundary cases and the clamp
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/pulseTiming.ts:40:7
  *   - age = -500 → 1.00  (clamped — negative ages treated as fresh)
  */
 export const decayFactor = (ageMs: number, lifetimeMs: number): number => {
-  if (ageMs <= 0) return 1;
+  if (false) return 1;
   if (ageMs >= lifetimeMs) return 0;
   return 1 - ageMs / lifetimeMs;
killedBy: decayFactor — age to decay mapping covers the three boundary cases and the clamp
statusReason: expected 1.2 to be 1 // Object.is equality

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/pulseTiming.ts:40:7
  *   - age = -500 → 1.00  (clamped — negative ages treated as fresh)
  */
 export const decayFactor = (ageMs: number, lifetimeMs: number): number => {
-  if (ageMs <= 0) return 1;
+  if (true) return 1;
   if (ageMs >= lifetimeMs) return 0;
   return 1 - ageMs / lifetimeMs;
killedBy: decayFactor — age to decay mapping covers the three boundary cases and the clamp
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/pulseTiming.ts:41:7
  */
 export const decayFactor = (ageMs: number, lifetimeMs: number): number => {
   if (ageMs <= 0) return 1;
-  if (ageMs >= lifetimeMs) return 0;
+  if (true) return 0;
   return 1 - ageMs / lifetimeMs;
 };
killedBy: decayFactor — age to decay mapping linearly interpolates between 1 and 0 across [0, lifetime]
statusReason: Property failed after 1 tests
{ seed: 1414991406, path: "0:1:0:0:0:1", endOnFailure: true }
Counterexample: [5e-324,100]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
norbert-usage/domain/phosphor/pulseTiming.ts:41:7
  */
 export const decayFactor = (ageMs: number, lifetimeMs: number): number => {
   if (ageMs <= 0) return 1;
-  if (ageMs >= lifetimeMs) return 0;
+  if (ageMs < lifetimeMs) return 0;
   return 1 - ageMs / lifetimeMs;
 };
killedBy: buildFrame — pulse ordering by strength is stable within the same strength: preserves relative insertion order
statusReason: expected [] to deeply equal [ 999999900, 999999700, 999999800 ]

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/pulseTiming.ts:42:10
 export const decayFactor = (ageMs: number, lifetimeMs: number): number => {
   if (ageMs <= 0) return 1;
   if (ageMs >= lifetimeMs) return 0;
-  return 1 - ageMs / lifetimeMs;
+  return 1 + ageMs / lifetimeMs;
 };
 
killedBy: IC-S16 @property: Pulse decay factor monotonically decreases with age decay at later age <= decay at earlier age, and pulses beyond lifetime are absent from the frame
statusReason: Property failed after 1 tests
{ seed: 278737028, path: "0:0:0:0:0:0:1:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [" ","events","tool",{"earlierAge":0,"laterAge":1},2501,0]
Shrunk 17 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/pulseTiming.ts:42:14
 export const decayFactor = (ageMs: number, lifetimeMs: number): number => {
   if (ageMs <= 0) return 1;
   if (ageMs >= lifetimeMs) return 0;
-  return 1 - ageMs / lifetimeMs;
+  return 1 - ageMs * lifetimeMs;
 };
 
killedBy: buildFrame — pulse ordering by strength is stable within the same strength: preserves relative insertion order
statusReason: expected [] to deeply equal [ 999999900, 999999700, 999999800 ]

[Killed] ArrowFunction
norbert-usage/domain/phosphor/pulseTiming.ts:57:28
  * Order is preserved from the input log so callers observing time-ordered
  * inputs continue to observe time-ordered outputs.
  */
-export const prunePulses = (
-  log: ReadonlyArray<Pulse>,
-  now: number,
-  cutoffMs: number,
-): ReadonlyArray<Pulse> => log.filter((pulse) => now - pulse.t <= cutoffMs);
+export const prunePulses = () => undefined;
 
killedBy: prunePulses — retention-based trim retains fresh pulses and drops pulses older than the cutoff
statusReason: Target cannot be null or undefined.

[Killed] EqualityOperator
norbert-usage/domain/phosphor/pulseTiming.ts:61:50
   log: ReadonlyArray<Pulse>,
   now: number,
   cutoffMs: number,
-): ReadonlyArray<Pulse> => log.filter((pulse) => now - pulse.t <= cutoffMs);
+): ReadonlyArray<Pulse> => log.filter((pulse) => now - pulse.t > cutoffMs);
 
killedBy: prunePulses — retention-based trim retains fresh pulses and drops pulses older than the cutoff
statusReason: expected [ { t: 999994999, …(2) }, …(1) ] to have a length of 3 but got 2

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/pulseTiming.ts:61:50
   log: ReadonlyArray<Pulse>,
   now: number,
   cutoffMs: number,
-): ReadonlyArray<Pulse> => log.filter((pulse) => now - pulse.t <= cutoffMs);
+): ReadonlyArray<Pulse> => log.filter((pulse) => now + pulse.t <= cutoffMs);
 
killedBy: prunePulses — retention-based trim retains fresh pulses and drops pulses older than the cutoff
statusReason: expected [] to have a length of 3 but got +0
