[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/rateDerivation.ts:32:53
 // ---------------------------------------------------------------------------
 
 /** Convert a window length in milliseconds to its equivalent in seconds. */
-const windowSeconds = (windowMs: number): number => windowMs / 1000;
+const windowSeconds = (windowMs: number): number => windowMs * 1000;
 
 /** Compute a per-second rate from a count across a window. */
killedBy: IC-S1: A 5-second tick of hook arrivals derives an events-per-second sample 15 events over 5 seconds yields a sample of 3 at the tick boundary
statusReason: expected 0.000003 to be close to 3, received difference is 2.999997, but expected 0.000005

[Killed] ArrowFunction
norbert-usage/domain/phosphor/rateDerivation.ts:32:23
 // ---------------------------------------------------------------------------
 
 /** Convert a window length in milliseconds to its equivalent in seconds. */
-const windowSeconds = (windowMs: number): number => windowMs / 1000;
+const windowSeconds = () => undefined;
 
 /** Compute a per-second rate from a count across a window. */
killedBy: IC-S1: A 5-second tick of hook arrivals derives an events-per-second sample 15 events over 5 seconds yields a sample of 3 at the tick boundary
statusReason: expected NaN to be close to 3, received difference is NaN, but expected 0.000005

[Killed] ArrowFunction
norbert-usage/domain/phosphor/rateDerivation.ts:35:19
 const windowSeconds = (windowMs: number): number => windowMs / 1000;
 
 /** Compute a per-second rate from a count across a window. */
-const perSecond = (count: number, windowMs: number): number =>
-  count / windowSeconds(windowMs);
+const perSecond = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: IC-S1: A 5-second tick of hook arrivals derives an events-per-second sample 15 events over 5 seconds yields a sample of 3 at the tick boundary
statusReason: expected undefined to be close to 3, received difference is NaN, but expected 0.000005

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/rateDerivation.ts:36:3
 
 /** Compute a per-second rate from a count across a window. */
 const perSecond = (count: number, windowMs: number): number =>
-  count / windowSeconds(windowMs);
+  count * windowSeconds(windowMs);
 
 // ---------------------------------------------------------------------------
killedBy: IC-S1: A 5-second tick of hook arrivals derives an events-per-second sample 15 events over 5 seconds yields a sample of 3 at the tick boundary
statusReason: expected 75 to be close to 3, received difference is 72, but expected 0.000005

[Killed] ArrowFunction
norbert-usage/domain/phosphor/rateDerivation.ts:54:33
  * are responsible for passing `windowMs > 0` and `count >= 0`. The function is
  * intentionally permissive so it composes cleanly inside pipelines.
  */
-export const deriveEventsRate = (
-  count: number,
-  windowMs: number,
-  tickBoundaryT: number,
-): RateSample => ({
-  t: tickBoundaryT,
-  v: perSecond(count, windowMs),
-});
+export const deriveEventsRate = () => undefined;
 
 /**
killedBy: IC-S1: A 5-second tick of hook arrivals derives an events-per-second sample 15 events over 5 seconds yields a sample of 3 at the tick boundary
statusReason: Cannot read properties of undefined (reading 'v')

[Killed] ObjectLiteral
norbert-usage/domain/phosphor/rateDerivation.ts:58:19
   count: number,
   windowMs: number,
   tickBoundaryT: number,
-): RateSample => ({
-  t: tickBoundaryT,
-  v: perSecond(count, windowMs),
-});
+): RateSample => ({});
 
 /**
killedBy: IC-S1: A 5-second tick of hook arrivals derives an events-per-second sample 15 events over 5 seconds yields a sample of 3 at the tick boundary
statusReason: expected undefined to be close to 3, received difference is NaN, but expected 0.000005

[Killed] ArrowFunction
norbert-usage/domain/phosphor/rateDerivation.ts:81:33
  * scope pipeline should emit a silent zero sample rather than crash. Pure:
  * total over all finite inputs.
  */
-export const deriveTokensRate = (
-  totalTokens: number,
-  durationMs: number,
-  tickBoundaryT: number,
-): RateSample => ({
-  t: tickBoundaryT,
-  v: durationMs > 0 ? perSecond(totalTokens, durationMs) : 0,
-});
+export const deriveTokensRate = () => undefined;
 
 /**
killedBy: IC-S2: An OTel api-request event derives a tokens-per-second sample 500 tokens over 2 seconds yields a sample of 250
statusReason: Cannot read properties of undefined (reading 'v')

[Killed] EqualityOperator
norbert-usage/domain/phosphor/rateDerivation.ts:87:6
   tickBoundaryT: number,
 ): RateSample => ({
   t: tickBoundaryT,
-  v: durationMs > 0 ? perSecond(totalTokens, durationMs) : 0,
+  v: durationMs <= 0 ? perSecond(totalTokens, durationMs) : 0,
 });
 
killedBy: IC-S2: An OTel api-request event derives a tokens-per-second sample 500 tokens over 2 seconds yields a sample of 250
statusReason: expected +0 to be close to 250, received difference is 250, but expected 0.000005

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/rateDerivation.ts:87:6
   tickBoundaryT: number,
 ): RateSample => ({
   t: tickBoundaryT,
-  v: durationMs > 0 ? perSecond(totalTokens, durationMs) : 0,
+  v: true ? perSecond(totalTokens, durationMs) : 0,
 });
 
killedBy: deriveTokensRate — zero-duration defensive lock a durationMs of zero yields a rate of zero (no throw)
statusReason: expected Infinity to be +0 // Object.is equality

[Killed] ArrowFunction
norbert-usage/domain/phosphor/rateDerivation.ts:107:36
  * function so the derivation seam names match the `MetricId` domain
  * vocabulary (`events` vs `toolcalls`) at the hookProcessor boundary.
  */
-export const deriveToolCallsRate = (
-  toolCallCount: number,
-  windowMs: number,
-  tickBoundaryT: number,
-): RateSample => ({
-  t: tickBoundaryT,
-  v: perSecond(toolCallCount, windowMs),
-});
+export const deriveToolCallsRate = () => undefined;
 
killedBy: IC-S3: Tool-call events within a 5-second tick derive a tool-calls-per-second sample 10 tool calls over 5 seconds yields a sample of 2
statusReason: Cannot read properties of undefined (reading 'v')
