[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:92:3
  * and expect to select this trace.
  */
 const isSampleOffCanvas = (sampleY: number, height: number): boolean =>
-  sampleY < 0 || sampleY > height;
+  sampleY >= 0 || sampleY > height;
 
 /**
killedBy: scopeHitTest — within snap distance includes off-canvas (above yMax) traces — they clip to the top edge and remain hoverable
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:112:3
 
 /** Whether the pointer lies inside the canvas rectangle. */
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
-  pointer.x >= 0 &&
+  pointer.x < 0 &&
   pointer.x <= pointer.width &&
   pointer.y >= 0 &&
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeHitTest.ts:113:3
 /** Whether the pointer lies inside the canvas rectangle. */
 const isPointerInsideCanvas = (pointer: PointerPosition): boolean =>
   pointer.x >= 0 &&
-  pointer.x <= pointer.width &&
+  pointer.x > pointer.width &&
   pointer.y >= 0 &&
   pointer.y <= pointer.height;
killedBy: scopeHitTest — within snap distance returns a HoverSelection when pointer is exactly on the sample
statusReason: expected null not to be null

[Survived] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:115:3
   pointer.x >= 0 &&
   pointer.x <= pointer.width &&
   pointer.y >= 0 &&
-  pointer.y <= pointer.height;
+  true;
 
 // ---------------------------------------------------------------------------

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeHitTest.ts:143:11
   if (latestValue === null) {
     let earliest = trace.samples[0];
     for (const sample of trace.samples) {
-      if (sample.t < earliest.t) earliest = sample;
+      if (true) earliest = sample;
     }
     latestValue = earliest.v;
killedBy: IC-S15 @property: Hit-test consistency between trace value and returned value selection value equals the selected trace's sampled value at selection.time within epsilon
statusReason: Property failed after 7 tests
Counterexample: [" ","events",[{"ageMs":4,"v":0.01},{"ageMs":3,"v":0.01},{"ageMs":2,"v":0.01},{"ageMs":1,"v":0.01},{"ageMs":0,"v":10.8}],100,100,0,0,0]
Shrunk 124 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
