[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:112:33
 const trimToWindow = (
   samples: ReadonlyArray<RateSample>,
   now: number,
-): ReadonlyArray<RateSample> => {
-  const cutoff = now - WINDOW_MS;
-  // Filter (not slice) so callers may pass histories that are not strictly
-  // sorted by time without risking incorrect truncation.
-  return samples.filter((s) => s.t >= cutoff);
-};
+): ReadonlyArray<RateSample> => {};
 
 /** Latest sample's `v`, or `null` when the history is empty. */
killedBy: IC-S11 @property: Frame values never invent sub-interval spikes beyond bracketing arrived values every projected trace value is bounded by its two bracketing arrived samples
statusReason: Property failed after 1 tests
{ seed: -657046233, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":0,"v":0}],0]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeProjection.ts:113:18
   samples: ReadonlyArray<RateSample>,
   now: number,
 ): ReadonlyArray<RateSample> => {
-  const cutoff = now - WINDOW_MS;
+  const cutoff = now + WINDOW_MS;
   // Filter (not slice) so callers may pass histories that are not strictly
   // sorted by time without risking incorrect truncation.
killedBy: IC-S12 @property: Frame values never zero-fill between arrivals edge value equals last arrived value and no sample zero-fills while the last arrival is non-zero
statusReason: Property failed after 1 tests
{ seed: -609421166, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","events",[{"ageMs":0,"v":0.01}],0]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
norbert-usage/domain/phosphor/scopeProjection.ts:116:10
   const cutoff = now - WINDOW_MS;
   // Filter (not slice) so callers may pass histories that are not strictly
   // sorted by time without risking incorrect truncation.
-  return samples.filter((s) => s.t >= cutoff);
+  return samples;
 };
 
killedBy: buildFrame — trace projection excludes samples older than the 60-second window
statusReason: expected [ { t: 999880000, v: 999 }, …(1) ] to deeply equal [ { t: 999990000, v: 5 } ]

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeProjection.ts:116:32
   const cutoff = now - WINDOW_MS;
   // Filter (not slice) so callers may pass histories that are not strictly
   // sorted by time without risking incorrect truncation.
-  return samples.filter((s) => s.t >= cutoff);
+  return samples.filter((s) => true);
 };
 
killedBy: buildFrame — trace projection excludes samples older than the 60-second window
statusReason: expected [ { t: 999880000, v: 999 }, …(1) ] to deeply equal [ { t: 999990000, v: 5 } ]

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeProjection.ts:120:23
 };
 
 /** Latest sample's `v`, or `null` when the history is empty. */
-const latestValueOf = (samples: ReadonlyArray<RateSample>): number | null =>
-  samples.length === 0 ? null : samples[samples.length - 1].v;
+const latestValueOf = () => undefined;
 
 /**
killedBy: buildFrame — trace projection trace.latestValue equals the most recent arrived sample value
statusReason: expected undefined to be 6 // Object.is equality

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeProjection.ts:121:3
 
 /** Latest sample's `v`, or `null` when the history is empty. */
 const latestValueOf = (samples: ReadonlyArray<RateSample>): number | null =>
-  samples.length === 0 ? null : samples[samples.length - 1].v;
+  samples.length !== 0 ? null : samples[samples.length - 1].v;
 
 /**
killedBy: buildFrame — trace projection trace.latestValue equals the most recent arrived sample value
statusReason: expected null to be 6 // Object.is equality

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeProjection.ts:121:3
 
 /** Latest sample's `v`, or `null` when the history is empty. */
 const latestValueOf = (samples: ReadonlyArray<RateSample>): number | null =>
-  samples.length === 0 ? null : samples[samples.length - 1].v;
+  true ? null : samples[samples.length - 1].v;
 
 /**
killedBy: WS-1: User glances at the scope and sees two sessions alive and churning projects one colored trace per active session with legend values
statusReason: expected null to be close to 8.5, received difference is 8.5, but expected 0.000005

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:134:77
  * the last observed arrival value, which is what "honest signal" means
  * in the phosphor scope design (see v2-phosphor-architecture.md §5 Q1).
  */
-const sampleAt = (samples: ReadonlyArray<RateSample>, t: number): number => {
-  let latestValue = 0;
-  let latestTime = Number.NEGATIVE_INFINITY;
-  for (const sample of samples) {
-    if (sample.t <= t && sample.t >= latestTime) {
-      latestTime = sample.t;
-      latestValue = sample.v;
-    }
-  }
-  return latestValue;
-};
+const sampleAt = (samples: ReadonlyArray<RateSample>, t: number): number => {};
 
 /** Project a single session's trace for the requested metric. */
killedBy: buildFrame — pulse vertical-position honesty pulse v equals the arrived rate value exactly at the pulse's time
statusReason: expected undefined to be 10 // Object.is equality

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:137:33
 const sampleAt = (samples: ReadonlyArray<RateSample>, t: number): number => {
   let latestValue = 0;
   let latestTime = Number.NEGATIVE_INFINITY;
-  for (const sample of samples) {
-    if (sample.t <= t && sample.t >= latestTime) {
-      latestTime = sample.t;
-      latestValue = sample.v;
-    }
-  }
+  for (const sample of samples) {}
   return latestValue;
 };
killedBy: buildFrame — pulse vertical-position honesty pulse v equals the arrived rate value exactly at the pulse's time
statusReason: expected +0 to be 10 // Object.is equality

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeProjection.ts:138:9
   let latestValue = 0;
   let latestTime = Number.NEGATIVE_INFINITY;
   for (const sample of samples) {
-    if (sample.t <= t && sample.t >= latestTime) {
+    if (false) {
       latestTime = sample.t;
       latestValue = sample.v;
killedBy: buildFrame — pulse vertical-position honesty pulse v equals the arrived rate value exactly at the pulse's time
statusReason: expected +0 to be 10 // Object.is equality

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeProjection.ts:138:26
   let latestValue = 0;
   let latestTime = Number.NEGATIVE_INFINITY;
   for (const sample of samples) {
-    if (sample.t <= t && sample.t >= latestTime) {
+    if (sample.t <= t && sample.t < latestTime) {
       latestTime = sample.t;
       latestValue = sample.v;
killedBy: buildFrame — pulse vertical-position honesty pulse v equals the arrived rate value exactly at the pulse's time
statusReason: expected +0 to be 10 // Object.is equality

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:153:18
   store: PhosphorStoreSurface,
   metric: MetricId,
   now: number,
-): FrameTrace => {
-  const color = colorForSessionIndex(index);
-  const history = store.getRateHistory(sessionId, metric);
-  const samples = trimToWindow(history, now);
-  return {
-    sessionId,
-    color,
-    samples,
-    latestValue: latestValueOf(samples),
-  };
-};
+): FrameTrace => {};
 
 /** Derive the legend row for a trace — same identity triple. */
killedBy: buildFrame — trace projection returns one trace per session from getSessionIds
statusReason: Cannot read properties of undefined (reading 'sessionId')

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeProjection.ts:166:24
 };
 
 /** Derive the legend row for a trace — same identity triple. */
-const legendEntryFor = (trace: FrameTrace): LegendEntry => ({
-  sessionId: trace.sessionId,
-  color: trace.color,
-  latestValue: trace.latestValue,
-});
+const legendEntryFor = () => undefined;
 
 /**
killedBy: buildFrame — legend lists one legend entry per session with session color and latest value
statusReason: expected undefined to deeply equal { sessionId: 'alpha', …(2) }

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeProjection.ts:178:22
  * this enforces the honest-signal invariant: a pulse sits on the trace
  * line, not between interpolated points.
  */
-const projectPulse = (
-  pulse: Pulse,
-  trace: FrameTrace,
-  now: number,
-): FramePulse => ({
-  sessionId: trace.sessionId,
-  t: pulse.t,
-  v: sampleAt(trace.samples, pulse.t),
-  decay: decayFactor(now - pulse.t, PULSE_LIFETIME_MS),
-  strength: pulse.strength,
-  kind: pulse.kind,
-  color: trace.color,
-});
+const projectPulse = () => undefined;
 
 /**
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: Cannot read properties of undefined (reading 'decay')

[Killed] ObjectLiteral
norbert-usage/domain/phosphor/scopeProjection.ts:182:19
   pulse: Pulse,
   trace: FrameTrace,
   now: number,
-): FramePulse => ({
-  sessionId: trace.sessionId,
-  t: pulse.t,
-  v: sampleAt(trace.samples, pulse.t),
-  decay: decayFactor(now - pulse.t, PULSE_LIFETIME_MS),
-  strength: pulse.strength,
-  kind: pulse.kind,
-  color: trace.color,
-});
+): FramePulse => ({});
 
 /**
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeProjection.ts:186:22
   sessionId: trace.sessionId,
   t: pulse.t,
   v: sampleAt(trace.samples, pulse.t),
-  decay: decayFactor(now - pulse.t, PULSE_LIFETIME_MS),
+  decay: decayFactor(now + pulse.t, PULSE_LIFETIME_MS),
   strength: pulse.strength,
   kind: pulse.kind,
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:202:33
   trace: FrameTrace,
   store: PhosphorStoreSurface,
   now: number,
-): ReadonlyArray<FramePulse> => {
-  const pulses = store.getPulses(trace.sessionId, now);
-  const projected: FramePulse[] = [];
-  for (const pulse of pulses) {
-    const framePulse = projectPulse(pulse, trace, now);
-    if (framePulse.decay > 0) projected.push(framePulse);
-  }
-  return projected;
-};
+): ReadonlyArray<FramePulse> => {};
 
 /**
killedBy: buildFrame — trace projection returns one trace per session from getSessionIds
statusReason: Cannot read properties of undefined (reading 'strength')

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:205:31
 ): ReadonlyArray<FramePulse> => {
   const pulses = store.getPulses(trace.sessionId, now);
   const projected: FramePulse[] = [];
-  for (const pulse of pulses) {
-    const framePulse = projectPulse(pulse, trace, now);
-    if (framePulse.decay > 0) projected.push(framePulse);
-  }
+  for (const pulse of pulses) {}
   return projected;
 };
killedBy: M2-S1: A fresh tool call pulse flares brightest at arrival fresh pulse has decay factor at maximum value
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeProjection.ts:207:9
   const projected: FramePulse[] = [];
   for (const pulse of pulses) {
     const framePulse = projectPulse(pulse, trace, now);
-    if (framePulse.decay > 0) projected.push(framePulse);
+    if (false) projected.push(framePulse);
   }
   return projected;
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Killed] EqualityOperator
norbert-usage/domain/phosphor/scopeProjection.ts:207:9
   const projected: FramePulse[] = [];
   for (const pulse of pulses) {
     const framePulse = projectPulse(pulse, trace, now);
-    if (framePulse.decay > 0) projected.push(framePulse);
+    if (framePulse.decay <= 0) projected.push(framePulse);
   }
   return projected;
killedBy: IC-S16 @property: Pulse decay factor monotonically decreases with age decay at later age <= decay at earlier age, and pulses beyond lifetime are absent from the frame
statusReason: Property failed after 1 tests
{ seed: 1230047353, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","events","tool",{"earlierAge":0,"laterAge":0},2501,0]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:224:33
  */
 const sortPulsesByStrengthDescending = (
   pulses: ReadonlyArray<FramePulse>,
-): ReadonlyArray<FramePulse> => {
-  // Decorate-sort-undecorate to guarantee stability under engines whose
-  // Array#sort is stable (Node/V8 since 10.x). The index tiebreak keeps
-  // equal-strength pulses in their original relative order.
-  const decorated = pulses.map((pulse, index) => ({ pulse, index }));
-  decorated.sort((a, b) => {
-    if (b.pulse.strength !== a.pulse.strength) {
-      return b.pulse.strength - a.pulse.strength;
-    }
-    return a.index - b.index;
-  });
-  return decorated.map((entry) => entry.pulse);
-};
+): ReadonlyArray<FramePulse> => {};
 
 // ---------------------------------------------------------------------------
killedBy: buildFrame — frame metadata has empty pulses array when store has no pulses
statusReason: expected undefined to deeply equal []

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeProjection.ts:228:32
   // Decorate-sort-undecorate to guarantee stability under engines whose
   // Array#sort is stable (Node/V8 since 10.x). The index tiebreak keeps
   // equal-strength pulses in their original relative order.
-  const decorated = pulses.map((pulse, index) => ({ pulse, index }));
+  const decorated = pulses.map(() => undefined);
   decorated.sort((a, b) => {
     if (b.pulse.strength !== a.pulse.strength) {
killedBy: M2-S1: A fresh tool call pulse flares brightest at arrival fresh pulse has decay factor at maximum value
statusReason: Cannot read properties of undefined (reading 'pulse')

[Killed] ObjectLiteral
norbert-usage/domain/phosphor/scopeProjection.ts:228:51
   // Decorate-sort-undecorate to guarantee stability under engines whose
   // Array#sort is stable (Node/V8 since 10.x). The index tiebreak keeps
   // equal-strength pulses in their original relative order.
-  const decorated = pulses.map((pulse, index) => ({ pulse, index }));
+  const decorated = pulses.map((pulse, index) => ({}));
   decorated.sort((a, b) => {
     if (b.pulse.strength !== a.pulse.strength) {
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: Cannot read properties of undefined (reading 'strength')

[Killed] MethodExpression
norbert-usage/domain/phosphor/scopeProjection.ts:229:3
   // Array#sort is stable (Node/V8 since 10.x). The index tiebreak keeps
   // equal-strength pulses in their original relative order.
   const decorated = pulses.map((pulse, index) => ({ pulse, index }));
-  decorated.sort((a, b) => {
-    if (b.pulse.strength !== a.pulse.strength) {
-      return b.pulse.strength - a.pulse.strength;
-    }
-    return a.index - b.index;
-  });
+  decorated;
   return decorated.map((entry) => entry.pulse);
 };
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [ 'lifecycle', 'tool', 'subagent' ] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:229:28
   // Array#sort is stable (Node/V8 since 10.x). The index tiebreak keeps
   // equal-strength pulses in their original relative order.
   const decorated = pulses.map((pulse, index) => ({ pulse, index }));
-  decorated.sort((a, b) => {
-    if (b.pulse.strength !== a.pulse.strength) {
-      return b.pulse.strength - a.pulse.strength;
-    }
-    return a.index - b.index;
-  });
+  decorated.sort((a, b) => {});
   return decorated.map((entry) => entry.pulse);
 };
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [ 'lifecycle', 'tool', 'subagent' ] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:230:48
   // equal-strength pulses in their original relative order.
   const decorated = pulses.map((pulse, index) => ({ pulse, index }));
   decorated.sort((a, b) => {
-    if (b.pulse.strength !== a.pulse.strength) {
-      return b.pulse.strength - a.pulse.strength;
-    }
+    if (b.pulse.strength !== a.pulse.strength) {}
     return a.index - b.index;
   });
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [ 'lifecycle', 'tool', 'subagent' ] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Killed] ConditionalExpression
norbert-usage/domain/phosphor/scopeProjection.ts:230:9
   // equal-strength pulses in their original relative order.
   const decorated = pulses.map((pulse, index) => ({ pulse, index }));
   decorated.sort((a, b) => {
-    if (b.pulse.strength !== a.pulse.strength) {
+    if (false) {
       return b.pulse.strength - a.pulse.strength;
     }
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [ 'lifecycle', 'tool', 'subagent' ] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Killed] ArithmeticOperator
norbert-usage/domain/phosphor/scopeProjection.ts:231:14
   const decorated = pulses.map((pulse, index) => ({ pulse, index }));
   decorated.sort((a, b) => {
     if (b.pulse.strength !== a.pulse.strength) {
-      return b.pulse.strength - a.pulse.strength;
+      return b.pulse.strength + a.pulse.strength;
     }
     return a.index - b.index;
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: expected [ 'lifecycle', 'tool', 'subagent' ] to deeply equal [ 'tool', 'subagent', 'lifecycle' ]

[Survived] ArithmeticOperator
norbert-usage/domain/phosphor/scopeProjection.ts:233:12
     if (b.pulse.strength !== a.pulse.strength) {
       return b.pulse.strength - a.pulse.strength;
     }
-    return a.index - b.index;
+    return a.index + b.index;
   });
   return decorated.map((entry) => entry.pulse);

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeProjection.ts:235:24
     }
     return a.index - b.index;
   });
-  return decorated.map((entry) => entry.pulse);
+  return decorated.map(() => undefined);
 };
 
killedBy: buildFrame — pulse ordering by strength sorts three coexisting kinds as tool, subagent, lifecycle descending
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] BlockStatement
norbert-usage/domain/phosphor/scopeProjection.ts:266:13
   store: PhosphorStoreSurface,
   metric: MetricId,
   now: number,
-): Frame => {
-  const sessionIds = store.getSessionIds();
-  const traces = sessionIds.map((sessionId, index) =>
-    projectTrace(sessionId, index, store, metric, now),
-  );
-  const pulses = sortPulsesByStrengthDescending(
-    traces.flatMap((trace) => projectPulsesForTrace(trace, store, now)),
-  );
-  const legend = traces.map(legendEntryFor);
-  const config = METRICS[metric];
-  return {
-    now,
-    metric,
-    yMax: config.yMax,
-    unit: config.unit,
-    traces,
-    pulses,
-    legend,
-  };
-};
+): Frame => {};
 
killedBy: buildFrame — trace projection returns one trace per session from getSessionIds
statusReason: Cannot read properties of undefined (reading 'traces')

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeProjection.ts:268:33
   now: number,
 ): Frame => {
   const sessionIds = store.getSessionIds();
-  const traces = sessionIds.map((sessionId, index) =>
-    projectTrace(sessionId, index, store, metric, now),
+  const traces = sessionIds.map(() => undefined,
   );
   const pulses = sortPulsesByStrengthDescending(
killedBy: buildFrame — trace projection returns one trace per session from getSessionIds
statusReason: Cannot read properties of undefined (reading 'sessionId')

[Killed] ArrowFunction
norbert-usage/domain/phosphor/scopeProjection.ts:272:20
     projectTrace(sessionId, index, store, metric, now),
   );
   const pulses = sortPulsesByStrengthDescending(
-    traces.flatMap((trace) => projectPulsesForTrace(trace, store, now)),
+    traces.flatMap(() => undefined),
   );
   const legend = traces.map(legendEntryFor);
killedBy: IC-S16 @property: Pulse decay factor monotonically decreases with age decay at later age <= decay at earlier age, and pulses beyond lifetime are absent from the frame
statusReason: Property failed after 1 tests
{ seed: 1791373203, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","events","tool",{"earlierAge":0,"laterAge":0},2501,0]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
