[Killed] ArrowFunction
src/plugins/norbert-usage/hookProcessor.ts:138:26
  * Pure: derives `strength` from `PULSE_STRENGTHS[kind]`. Callers inject the
  * timestamp so this helper remains clock-free (effects at the boundary).
  */
-export const emitPulse = (kind: PulseKind, t: number): Pulse => ({
-  t,
-  kind,
-  strength: PULSE_STRENGTHS[kind],
-});
+export const emitPulse = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: IC-S4: A tool-use hook event emits a pulse at the event's timestamp pulse kind is tool and t matches the event time
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] ObjectLiteral
src/plugins/norbert-usage/hookProcessor.ts:138:66
  * Pure: derives `strength` from `PULSE_STRENGTHS[kind]`. Callers inject the
  * timestamp so this helper remains clock-free (effects at the boundary).
  */
-export const emitPulse = (kind: PulseKind, t: number): Pulse => ({
-  t,
-  kind,
-  strength: PULSE_STRENGTHS[kind],
-});
+export const emitPulse = (kind: PulseKind, t: number): Pulse => ({});
 
 // ---------------------------------------------------------------------------
killedBy: IC-S4: A tool-use hook event emits a pulse at the event's timestamp pulse kind is tool and t matches the event time
statusReason: expected undefined to be 'tool' // Object.is equality
