[Killed] StringLiteral
plugins/norbert-usage/adapters/metricsStore.ts:49:30
  * subscribe() returns an unsubscribe function to stop receiving notifications.
  */
 export const createMetricsStore = (
-  initialSessionId: string = "default",
+  initialSessionId: string = "",
 ): MetricsStore => {
   let currentMetrics: SessionMetrics = createInitialMetrics(initialSessionId);
killedBy: metricsStore initial state uses default session ID when none provided
statusReason: expected '' to be truthy

[Killed] BlockStatement
plugins/norbert-usage/adapters/metricsStore.ts:59:83
 
   const getTimeSeries = (): TimeSeriesBuffer => currentTimeSeries;
 
-  const update = (metrics: SessionMetrics, timeSeries: TimeSeriesBuffer): void => {
-    currentMetrics = metrics;
-    currentTimeSeries = timeSeries;
-
-    for (const subscriber of subscribers) {
-      subscriber(metrics, timeSeries);
-    }
-  };
+  const update = (metrics: SessionMetrics, timeSeries: TimeSeriesBuffer): void => {};
 
   const subscribe = (callback: Subscriber): (() => void) => {
killedBy: metricsStore update replaces metrics state accessible via getMetrics
statusReason: expected +0 to be 500 // Object.is equality

[Killed] BlockStatement
plugins/norbert-usage/adapters/metricsStore.ts:63:43
     currentMetrics = metrics;
     currentTimeSeries = timeSeries;
 
-    for (const subscriber of subscribers) {
-      subscriber(metrics, timeSeries);
-    }
+    for (const subscriber of subscribers) {}
   };
 
killedBy: metricsStore update notifies subscriber with new metrics and time series
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
plugins/norbert-usage/adapters/metricsStore.ts:71:18
   const subscribe = (callback: Subscriber): (() => void) => {
     subscribers.add(callback);
 
-    return () => {
-      subscribers.delete(callback);
-    };
+    return () => {};
   };
 
killedBy: metricsStore subscribe/unsubscribe returns a function that stops notifications
statusReason: expected 2 to be 1 // Object.is equality
