[Killed] EqualityOperator
plugins/norbert-usage/domain/gaugeCluster.ts:75:7
   contextWindowPct: number,
   thresholds: ThresholdConfig,
 ): Urgency => {
-  if (contextWindowPct >= thresholds.fuelRed) return "red";
+  if (contextWindowPct > thresholds.fuelRed) return "red";
   if (contextWindowPct >= thresholds.fuelAmber) return "amber";
   return "normal";
killedBy: Fuel gauge urgency zones is red when contextWindowPct >= 90
statusReason: Property failed after 12 tests
{ seed: 373495280, path: "11", endOnFailure: true }
Counterexample: [90]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:75:7
   contextWindowPct: number,
   thresholds: ThresholdConfig,
 ): Urgency => {
-  if (contextWindowPct >= thresholds.fuelRed) return "red";
+  if (false) return "red";
   if (contextWindowPct >= thresholds.fuelAmber) return "amber";
   return "normal";
killedBy: Fuel gauge urgency zones is red when contextWindowPct >= 90
statusReason: Property failed after 1 tests
{ seed: -641399391, path: "0:0", endOnFailure: true }
Counterexample: [90]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:76:7
   thresholds: ThresholdConfig,
 ): Urgency => {
   if (contextWindowPct >= thresholds.fuelRed) return "red";
-  if (contextWindowPct >= thresholds.fuelAmber) return "amber";
+  if (true) return "amber";
   return "normal";
 };
killedBy: Fuel gauge urgency zones is normal when contextWindowPct < 70
statusReason: Property failed after 1 tests
{ seed: -173817077, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/gaugeCluster.ts:76:7
   thresholds: ThresholdConfig,
 ): Urgency => {
   if (contextWindowPct >= thresholds.fuelRed) return "red";
-  if (contextWindowPct >= thresholds.fuelAmber) return "amber";
+  if (contextWindowPct > thresholds.fuelAmber) return "amber";
   return "normal";
 };
killedBy: Fuel gauge urgency zones is amber when contextWindowPct >= 70 and < 90
statusReason: Property failed after 17 tests
{ seed: -655993044, path: "16", endOnFailure: true }
Counterexample: [70]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:84:7
   burnRate: number,
   thresholds: ThresholdConfig,
 ): Urgency => {
-  if (burnRate >= thresholds.tachoRed) return "red";
+  if (true) return "red";
   if (burnRate >= thresholds.tachoAmber) return "amber";
   return "normal";
killedBy: Tachometer urgency zones is normal when burnRate < 400
statusReason: Property failed after 1 tests
{ seed: -2137131372, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/gaugeCluster.ts:84:7
   burnRate: number,
   thresholds: ThresholdConfig,
 ): Urgency => {
-  if (burnRate >= thresholds.tachoRed) return "red";
+  if (burnRate > thresholds.tachoRed) return "red";
   if (burnRate >= thresholds.tachoAmber) return "amber";
   return "normal";
killedBy: Tachometer urgency zones is red when burnRate >= 500
statusReason: Property failed after 88 tests
{ seed: 994506535, path: "87", endOnFailure: true }
Counterexample: [500]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:85:7
   thresholds: ThresholdConfig,
 ): Urgency => {
   if (burnRate >= thresholds.tachoRed) return "red";
-  if (burnRate >= thresholds.tachoAmber) return "amber";
+  if (true) return "amber";
   return "normal";
 };
killedBy: Tachometer urgency zones is normal when burnRate < 400
statusReason: Property failed after 1 tests
{ seed: 306063407, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/gaugeCluster.ts:85:7
   thresholds: ThresholdConfig,
 ): Urgency => {
   if (burnRate >= thresholds.tachoRed) return "red";
-  if (burnRate >= thresholds.tachoAmber) return "amber";
+  if (burnRate < thresholds.tachoAmber) return "amber";
   return "normal";
 };
killedBy: Tachometer urgency zones is normal when burnRate < 400
statusReason: Property failed after 1 tests
{ seed: -100716516, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:104:7
 
 /** Format context token usage as "Xk / Yk tokens", or "" when unknown. */
 export const formatContextTokenLabel = (current: number, max: number): string => {
-  if (max === 0) return "";
+  if (false) return "";
   const currentK = Math.round(current / 1000);
   const maxK = Math.round(max / 1000);
killedBy: Fuel gauge token label is empty when maxTokens is 0
statusReason: expected '50k / 0k tokens' to be '' // Object.is equality

[Survived] StringLiteral
plugins/norbert-usage/domain/gaugeCluster.ts:124:14
 
 const buildOdometer = (sessionCost: number): OdometerData => ({
   value: sessionCost,
-  formatted: `$${sessionCost.toFixed(2)}`,
+  formatted: ``,
 });
 

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:136:15
  *  "degraded" when no events received (hooks may not be configured),
  *  "normal" when events are flowing. */
 const buildWarningCluster = (hookEventCount: number): WarningClusterData => ({
-  hookHealth: hookEventCount === 0 ? "degraded" : "normal",
+  hookHealth: false ? "degraded" : "normal",
 });
 
killedBy: Warning cluster hook health reports degraded when hookEventCount is 0 (no events received)
statusReason: expected 'normal' to be 'degraded' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/gaugeCluster.ts:136:15
  *  "degraded" when no events received (hooks may not be configured),
  *  "normal" when events are flowing. */
 const buildWarningCluster = (hookEventCount: number): WarningClusterData => ({
-  hookHealth: hookEventCount === 0 ? "degraded" : "normal",
+  hookHealth: hookEventCount !== 0 ? "degraded" : "normal",
 });
 
killedBy: Warning cluster hook health reports normal when hookEventCount > 0 (events flowing)
statusReason: expected 'degraded' to be 'normal' // Object.is equality
