[Killed] MethodExpression
plugins/norbert-usage/domain/oscilloscope.ts:51:35
   samples: ReadonlyArray<RateSample>,
   field: RateField,
 ): number =>
-  samples.reduce((max, sample) => Math.max(max, extractRate(sample, field)), 0);
+  samples.reduce((max, sample) => Math.min(max, extractRate(sample, field)), 0);
 
 const normalizeY = (
killedBy: Oscilloscope waveform point preparation normalizes peak value to top of canvas (minimum y)
statusReason: expected 190 to be 10 // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/oscilloscope.ts:59:7
   topY: number,
   bottomY: number,
 ): number => {
-  if (peakValue === 0) return bottomY;
+  if (true) return bottomY;
   const ratio = value / peakValue;
   return bottomY - ratio * (bottomY - topY);
killedBy: Oscilloscope waveform point preparation normalizes peak value to top of canvas (minimum y)
statusReason: expected 190 to be 10 // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:59:7
   topY: number,
   bottomY: number,
 ): number => {
-  if (peakValue === 0) return bottomY;
+  if (peakValue !== 0) return bottomY;
   const ratio = value / peakValue;
   return bottomY - ratio * (bottomY - topY);
killedBy: Oscilloscope waveform point preparation normalizes peak value to top of canvas (minimum y)
statusReason: expected 190 to be 10 // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:60:17
   bottomY: number,
 ): number => {
   if (peakValue === 0) return bottomY;
-  const ratio = value / peakValue;
+  const ratio = value * peakValue;
   return bottomY - ratio * (bottomY - topY);
 };
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: -1294474046, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":0}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:61:29
 ): number => {
   if (peakValue === 0) return bottomY;
   const ratio = value / peakValue;
-  return bottomY - ratio * (bottomY - topY);
+  return bottomY - ratio * (bottomY + topY);
 };
 
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: 739080975, path: "0:0:0:0:1:0:0:0", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":1}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:61:10
 ): number => {
   if (peakValue === 0) return bottomY;
   const ratio = value / peakValue;
-  return bottomY - ratio * (bottomY - topY);
+  return bottomY + ratio * (bottomY - topY);
 };
 
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: 205504062, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":0}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:76:7
   dimensions: CanvasDimensions,
   field: RateField,
 ): ReadonlyArray<WaveformPoint> => {
-  if (samples.length === 0) return [];
+  if (samples.length !== 0) return [];
 
   const { width, height, padding } = dimensions;
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: -1316451108, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":0}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/oscilloscope.ts:76:7
   dimensions: CanvasDimensions,
   field: RateField,
 ): ReadonlyArray<WaveformPoint> => {
-  if (samples.length === 0) return [];
+  if (true) return [];
 
   const { width, height, padding } = dimensions;
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: -1759214194, path: "0:0:0:0", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":0}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:79:25
   if (samples.length === 0) return [];
 
   const { width, height, padding } = dimensions;
-  const drawableWidth = width - 2 * padding;
+  const drawableWidth = width + 2 * padding;
   const topY = padding;
   const bottomY = height - padding;
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: -1462015232, path: "0:0:0:0:1:0:0:0:0:1", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":1}]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:79:33
   if (samples.length === 0) return [];
 
   const { width, height, padding } = dimensions;
-  const drawableWidth = width - 2 * padding;
+  const drawableWidth = width - 2 / padding;
   const topY = padding;
   const bottomY = height - padding;
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 2 tests
{ seed: -1707128682, path: "1:0:0:0:0:0", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":0}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:81:19
   const { width, height, padding } = dimensions;
   const drawableWidth = width - 2 * padding;
   const topY = padding;
-  const bottomY = height - padding;
+  const bottomY = height + padding;
   const peakRate = findPeakRate(samples, field);
   const lastIndex = samples.length - 1;
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 2 tests
{ seed: -2073605019, path: "1:2:2:0:1:1:0:0:0", endOnFailure: true }
Counterexample: [2,{__proto__:null,"width":100,"height":50,"padding":3}]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:83:21
   const topY = padding;
   const bottomY = height - padding;
   const peakRate = findPeakRate(samples, field);
-  const lastIndex = samples.length - 1;
+  const lastIndex = samples.length + 1;
 
   return samples.map((sample, index) => {
killedBy: Oscilloscope waveform point preparation distributes x coordinates evenly across canvas width
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:86:42
   const lastIndex = samples.length - 1;
 
   return samples.map((sample, index) => {
-    const xRatio = lastIndex === 0 ? 0 : index / lastIndex;
+    const xRatio = lastIndex === 0 ? 0 : index * lastIndex;
     const x = padding + xRatio * drawableWidth;
     const y = normalizeY(extractRate(sample, field), peakRate, topY, bottomY);
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: -514036254, path: "0:1:0:0:0:0:1:1:1", endOnFailure: true }
Counterexample: [3,{"width":100,"height":50,"padding":0}]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/oscilloscope.ts:86:20
   const lastIndex = samples.length - 1;
 
   return samples.map((sample, index) => {
-    const xRatio = lastIndex === 0 ? 0 : index / lastIndex;
+    const xRatio = true ? 0 : index / lastIndex;
     const x = padding + xRatio * drawableWidth;
     const y = normalizeY(extractRate(sample, field), peakRate, topY, bottomY);
killedBy: Oscilloscope waveform point preparation distributes x coordinates evenly across canvas width
statusReason: expected +0 to be 400 // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:87:15
 
   return samples.map((sample, index) => {
     const xRatio = lastIndex === 0 ? 0 : index / lastIndex;
-    const x = padding + xRatio * drawableWidth;
+    const x = padding - xRatio * drawableWidth;
     const y = normalizeY(extractRate(sample, field), peakRate, topY, bottomY);
     return { x, y };
killedBy: Oscilloscope waveform point preparation maps each sample to a canvas coordinate within bounds
statusReason: Property failed after 1 tests
{ seed: 1375430572, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [2,{"width":100,"height":50,"padding":0}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:87:25
 
   return samples.map((sample, index) => {
     const xRatio = lastIndex === 0 ? 0 : index / lastIndex;
-    const x = padding + xRatio * drawableWidth;
+    const x = padding + xRatio / drawableWidth;
     const y = normalizeY(extractRate(sample, field), peakRate, topY, bottomY);
     return { x, y };
killedBy: Oscilloscope waveform point preparation distributes x coordinates evenly across canvas width
statusReason: expected 0.0025 to be 400 // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:109:7
   windowDurationMs: number,
   intervalMs: number,
 ): ReadonlyArray<GridLine> => {
-  if (windowDurationMs <= 0 || intervalMs <= 0) return [];
+  if (windowDurationMs > 0 || intervalMs <= 0) return [];
 
   const { width, padding } = dimensions;
killedBy: Oscilloscope grid line computation produces grid lines at regular time intervals
statusReason: expected [] to have a length of 5 but got +0

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:109:32
   windowDurationMs: number,
   intervalMs: number,
 ): ReadonlyArray<GridLine> => {
-  if (windowDurationMs <= 0 || intervalMs <= 0) return [];
+  if (windowDurationMs <= 0 || intervalMs > 0) return [];
 
   const { width, padding } = dimensions;
killedBy: Oscilloscope grid line computation produces grid lines at regular time intervals
statusReason: expected [] to have a length of 5 but got +0

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:112:33
   if (windowDurationMs <= 0 || intervalMs <= 0) return [];
 
   const { width, padding } = dimensions;
-  const drawableWidth = width - 2 * padding;
+  const drawableWidth = width - 2 / padding;
   const lines: GridLine[] = [];
 
killedBy: Oscilloscope grid line computation produces grid lines at regular time intervals
statusReason: expected -Infinity to be greater than 0

[Survived] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:112:25
   if (windowDurationMs <= 0 || intervalMs <= 0) return [];
 
   const { width, padding } = dimensions;
-  const drawableWidth = width - 2 * padding;
+  const drawableWidth = width + 2 * padding;
   const lines: GridLine[] = [];
 

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:115:37
   const drawableWidth = width - 2 * padding;
   const lines: GridLine[] = [];
 
-  for (let timeOffset = intervalMs; timeOffset < windowDurationMs; timeOffset += intervalMs) {
+  for (let timeOffset = intervalMs; timeOffset >= windowDurationMs; timeOffset += intervalMs) {
     const xRatio = timeOffset / windowDurationMs;
     const x = padding + xRatio * drawableWidth;
killedBy: Oscilloscope grid line computation produces grid lines at regular time intervals
statusReason: expected [] to have a length of 5 but got +0

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:115:37
   const drawableWidth = width - 2 * padding;
   const lines: GridLine[] = [];
 
-  for (let timeOffset = intervalMs; timeOffset < windowDurationMs; timeOffset += intervalMs) {
+  for (let timeOffset = intervalMs; timeOffset <= windowDurationMs; timeOffset += intervalMs) {
     const xRatio = timeOffset / windowDurationMs;
     const x = padding + xRatio * drawableWidth;
killedBy: Oscilloscope grid line computation produces grid lines at regular time intervals
statusReason: expected [ …(6) ] to have a length of 5 but got 6

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:116:20
   const lines: GridLine[] = [];
 
   for (let timeOffset = intervalMs; timeOffset < windowDurationMs; timeOffset += intervalMs) {
-    const xRatio = timeOffset / windowDurationMs;
+    const xRatio = timeOffset * windowDurationMs;
     const x = padding + xRatio * drawableWidth;
     const secondsFromEnd = Math.round((windowDurationMs - timeOffset) / 1000);
killedBy: Oscilloscope grid line computation produces grid lines at regular time intervals
statusReason: expected 360000000000 to be less than 600

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:117:15
 
   for (let timeOffset = intervalMs; timeOffset < windowDurationMs; timeOffset += intervalMs) {
     const xRatio = timeOffset / windowDurationMs;
-    const x = padding + xRatio * drawableWidth;
+    const x = padding - xRatio * drawableWidth;
     const secondsFromEnd = Math.round((windowDurationMs - timeOffset) / 1000);
     lines.push({
killedBy: Oscilloscope grid line computation produces grid lines at regular time intervals
statusReason: expected -100 to be greater than 0

[Survived] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:117:25
 
   for (let timeOffset = intervalMs; timeOffset < windowDurationMs; timeOffset += intervalMs) {
     const xRatio = timeOffset / windowDurationMs;
-    const x = padding + xRatio * drawableWidth;
+    const x = padding + xRatio / drawableWidth;
     const secondsFromEnd = Math.round((windowDurationMs - timeOffset) / 1000);
     lines.push({

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:118:39
   for (let timeOffset = intervalMs; timeOffset < windowDurationMs; timeOffset += intervalMs) {
     const xRatio = timeOffset / windowDurationMs;
     const x = padding + xRatio * drawableWidth;
-    const secondsFromEnd = Math.round((windowDurationMs - timeOffset) / 1000);
+    const secondsFromEnd = Math.round((windowDurationMs - timeOffset) * 1000);
     lines.push({
       x,
killedBy: Oscilloscope grid line computation labels grid lines with time offset in seconds
statusReason: expected '-50000000s' to be '-50s' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:118:40
   for (let timeOffset = intervalMs; timeOffset < windowDurationMs; timeOffset += intervalMs) {
     const xRatio = timeOffset / windowDurationMs;
     const x = padding + xRatio * drawableWidth;
-    const secondsFromEnd = Math.round((windowDurationMs - timeOffset) / 1000);
+    const secondsFromEnd = Math.round((windowDurationMs + timeOffset) / 1000);
     lines.push({
       x,
killedBy: Oscilloscope grid line computation labels grid lines with time offset in seconds
statusReason: expected '-70s' to be '-50s' // Object.is equality

[Killed] StringLiteral
plugins/norbert-usage/domain/oscilloscope.ts:121:14
     const secondsFromEnd = Math.round((windowDurationMs - timeOffset) / 1000);
     lines.push({
       x,
-      label: `-${secondsFromEnd}s`,
+      label: ``,
       labelY: padding + 10,
     });
killedBy: Oscilloscope grid line computation labels grid lines with time offset in seconds
statusReason: expected '' to be '-50s' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:122:15
     lines.push({
       x,
       label: `-${secondsFromEnd}s`,
-      labelY: padding + 10,
+      labelY: padding - 10,
     });
   }
killedBy: Oscilloscope grid line computation grid line labelY is within top padding zone
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:140:7
  * Rates < 1000 display as integers (e.g., "500 tok/s").
  */
 export const formatRateOverlay = (rate: number): string => {
-  if (rate >= 1000) {
+  if (rate < 1000) {
     const kRate = rate / 1000;
     return `${kRate.toFixed(1)}k tok/s`;
killedBy: Oscilloscope rate overlay formatting formats zero rate as '0 tok/s'
statusReason: expected '0.0k tok/s' to be '0 tok/s' // Object.is equality

[Killed] BlockStatement
plugins/norbert-usage/domain/oscilloscope.ts:140:21
  * Rates < 1000 display as integers (e.g., "500 tok/s").
  */
 export const formatRateOverlay = (rate: number): string => {
-  if (rate >= 1000) {
-    const kRate = rate / 1000;
-    return `${kRate.toFixed(1)}k tok/s`;
-  }
+  if (rate >= 1000) {}
   return `${rate} tok/s`;
 };
killedBy: Oscilloscope rate overlay formatting formats rates >= 1000 with 'k' suffix
statusReason: expected '1500 tok/s' to be '1.5k tok/s' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:141:19
  */
 export const formatRateOverlay = (rate: number): string => {
   if (rate >= 1000) {
-    const kRate = rate / 1000;
+    const kRate = rate * 1000;
     return `${kRate.toFixed(1)}k tok/s`;
   }
killedBy: Oscilloscope rate overlay formatting formats rates >= 1000 with 'k' suffix
statusReason: expected '1500000.0k tok/s' to be '1.5k tok/s' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:173:17
  * Example: 60000 -> "60s"
  */
 export const formatWindowDuration = (durationMs: number): string =>
-  `${Math.round(durationMs / 1000)}s`;
+  `${Math.round(durationMs * 1000)}s`;
 
 /**
killedBy: Stats bar window duration formatting converts milliseconds to seconds display
statusReason: expected '60000000s' to be '60s' // Object.is equality

[Killed] StringLiteral
plugins/norbert-usage/domain/oscilloscope.ts:173:3
  * Example: 60000 -> "60s"
  */
 export const formatWindowDuration = (durationMs: number): string =>
-  `${Math.round(durationMs / 1000)}s`;
+  ``;
 
 /**
killedBy: Stats bar window duration formatting converts milliseconds to seconds display
statusReason: expected '' to be '0s' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:210:24
   containerHeight: number,
   aspectRatio: number = DEFAULT_ASPECT_RATIO,
 ): CanvasDimensions => {
-  const targetHeight = containerWidth / aspectRatio;
+  const targetHeight = containerWidth * aspectRatio;
 
   if (targetHeight <= containerHeight) {
killedBy: computeCanvasDimensions computes canvas size from container scales canvas to fit container while respecting aspect ratio
statusReason: expected 1200 to be 800 // Object.is equality

[Killed] BlockStatement
plugins/norbert-usage/domain/oscilloscope.ts:212:40
 ): CanvasDimensions => {
   const targetHeight = containerWidth / aspectRatio;
 
-  if (targetHeight <= containerHeight) {
-    return {
-      width: containerWidth,
-      height: Math.round(targetHeight),
-      padding: DEFAULT_PADDING,
-    };
-  }
+  if (targetHeight <= containerHeight) {}
 
   return {
killedBy: computeCanvasDimensions computes canvas size from container scales canvas to fit container while respecting aspect ratio
statusReason: expected 1200 to be 800 // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/oscilloscope.ts:212:7
 ): CanvasDimensions => {
   const targetHeight = containerWidth / aspectRatio;
 
-  if (targetHeight <= containerHeight) {
+  if (targetHeight > containerHeight) {
     return {
       width: containerWidth,
killedBy: computeCanvasDimensions computes canvas size from container scales canvas to fit container while respecting aspect ratio
statusReason: expected 1200 to be 800 // Object.is equality

[Survived] ArithmeticOperator
plugins/norbert-usage/domain/oscilloscope.ts:221:23
   }
 
   return {
-    width: Math.round(containerHeight * aspectRatio),
+    width: Math.round(containerHeight / aspectRatio),
     height: containerHeight,
     padding: DEFAULT_PADDING,
