[Killed] BlockStatement
plugins/norbert-usage/adapters/eventSource.ts:44:29
   hooksApi: EventSourceHooksApi,
   processor: (payload: unknown) => void,
 ): EventSource => {
-  const start = (): void => {
-    hooksApi.register("session-event", processor);
-  };
+  const start = (): void => {};
 
   const stop = (): void => {
killedBy: eventSource start registers a session-event hook via the API
statusReason: expected [] to have a length of 1 but got +0
