[Killed] ConditionalExpression
plugins/norbert-usage/domain/burnRate.ts:25:3
  * Unix epoch in seconds is ~1.7e9 (2024); in milliseconds ~1.7e12.
  */
 const isMillisecondTimestamp = (timestamp: number): boolean =>
-  timestamp > 1e12;
+  true;
 
 /**
killedBy: calculateBurnRate with all events outside window returns 0 when all events are before the window
statusReason: expected 13.333333333333334 to be +0 // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/burnRate.ts:25:3
  * Unix epoch in seconds is ~1.7e9 (2024); in milliseconds ~1.7e12.
  */
 const isMillisecondTimestamp = (timestamp: number): boolean =>
-  timestamp > 1e12;
+  false;
 
 /**
killedBy: Token burn rate computed from rolling time window calculates tokens per second from recent events within window
statusReason: expected +0 to be close to 1500, received difference is 1500, but expected 0.5

[Survived] ArithmeticOperator
plugins/norbert-usage/domain/burnRate.ts:45:28
 export const calculateBurnRate = (
   events: ReadonlyArray<TimestampedTokens>,
   windowSeconds: number,
-  now: number = Math.floor(Date.now() / 1000),
+  now: number = Math.floor(Date.now() * 1000),
 ): number => {
   if (events.length === 0 || windowSeconds <= 0) return 0;

[Killed] ConditionalExpression
plugins/norbert-usage/domain/burnRate.ts:47:7
   windowSeconds: number,
   now: number = Math.floor(Date.now() / 1000),
 ): number => {
-  if (events.length === 0 || windowSeconds <= 0) return 0;
+  if (true) return 0;
 
   const windowInTimestampUnits = isMillisecondTimestamp(now)
killedBy: calculateBurnRate with single event in window returns tokens divided by window seconds
statusReason: expected +0 to be close to 10, received difference is 10, but expected 0.000005

[Killed] EqualityOperator
plugins/norbert-usage/domain/burnRate.ts:47:30
   windowSeconds: number,
   now: number = Math.floor(Date.now() / 1000),
 ): number => {
-  if (events.length === 0 || windowSeconds <= 0) return 0;
+  if (events.length === 0 || windowSeconds > 0) return 0;
 
   const windowInTimestampUnits = isMillisecondTimestamp(now)
killedBy: calculateBurnRate with single event in window returns tokens divided by window seconds
statusReason: expected +0 to be close to 10, received difference is 10, but expected 0.000005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/burnRate.ts:50:7
   if (events.length === 0 || windowSeconds <= 0) return 0;
 
   const windowInTimestampUnits = isMillisecondTimestamp(now)
-    ? windowSeconds * 1000
+    ? windowSeconds / 1000
     : windowSeconds;
   const windowStart = now - windowInTimestampUnits;
killedBy: Token burn rate computed from rolling time window calculates tokens per second from recent events within window
statusReason: expected +0 to be close to 1500, received difference is 1500, but expected 0.5

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/burnRate.ts:52:23
   const windowInTimestampUnits = isMillisecondTimestamp(now)
     ? windowSeconds * 1000
     : windowSeconds;
-  const windowStart = now - windowInTimestampUnits;
+  const windowStart = now + windowInTimestampUnits;
 
   const tokensInWindow = events
killedBy: Token burn rate computed from rolling time window calculates tokens per second from recent events within window
statusReason: expected +0 to be close to 1500, received difference is 1500, but expected 0.5

[Killed] MethodExpression
plugins/norbert-usage/domain/burnRate.ts:54:26
     : windowSeconds;
   const windowStart = now - windowInTimestampUnits;
 
-  const tokensInWindow = events
-    .filter((event) => event.timestamp >= windowStart)
+  const tokensInWindow = events
     .reduce((sum, event) => sum + event.tokens, 0);
 
killedBy: calculateBurnRate with all events outside window returns 0 when all events are before the window
statusReason: expected 13.333333333333334 to be +0 // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/burnRate.ts:55:24
   const windowStart = now - windowInTimestampUnits;
 
   const tokensInWindow = events
-    .filter((event) => event.timestamp >= windowStart)
+    .filter((event) => false)
     .reduce((sum, event) => sum + event.tokens, 0);
 
killedBy: calculateBurnRate with single event in window returns tokens divided by window seconds
statusReason: expected +0 to be close to 10, received difference is 10, but expected 0.000005

[Killed] ArrowFunction
plugins/norbert-usage/domain/burnRate.ts:55:13
   const windowStart = now - windowInTimestampUnits;
 
   const tokensInWindow = events
-    .filter((event) => event.timestamp >= windowStart)
+    .filter(() => undefined)
     .reduce((sum, event) => sum + event.tokens, 0);
 
killedBy: calculateBurnRate with single event in window returns tokens divided by window seconds
statusReason: expected +0 to be close to 10, received difference is 10, but expected 0.000005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/burnRate.ts:56:29
 
   const tokensInWindow = events
     .filter((event) => event.timestamp >= windowStart)
-    .reduce((sum, event) => sum + event.tokens, 0);
+    .reduce((sum, event) => sum - event.tokens, 0);
 
   return tokensInWindow / windowSeconds;
killedBy: calculateBurnRate with single event in window returns tokens divided by window seconds
statusReason: expected -10 to be close to 10, received difference is 20, but expected 0.000005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/burnRate.ts:58:10
     .filter((event) => event.timestamp >= windowStart)
     .reduce((sum, event) => sum + event.tokens, 0);
 
-  return tokensInWindow / windowSeconds;
+  return tokensInWindow * windowSeconds;
 };
 
killedBy: calculateBurnRate with single event in window returns tokens divided by window seconds
statusReason: expected 36000 to be close to 10, received difference is 35990, but expected 0.000005
