[Killed] ConditionalExpression
plugins/norbert-usage/domain/costTicker.ts:30:7
 // ---------------------------------------------------------------------------
 
 const classifyZone = (sessionCost: number, sessionAverage: number): ColorZone => {
-  if (sessionCost === 0 && sessionAverage === 0) return "dim";
+  if (false) return "dim";
   if (sessionAverage === 0) return "brand";
   if (sessionCost >= sessionAverage * 1.5) return "red";
killedBy: Cost ticker dim zone is dim when both cost and average are zero
statusReason: expected 'brand' to be 'dim' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/costTicker.ts:30:7
 // ---------------------------------------------------------------------------
 
 const classifyZone = (sessionCost: number, sessionAverage: number): ColorZone => {
-  if (sessionCost === 0 && sessionAverage === 0) return "dim";
+  if (true) return "dim";
   if (sessionAverage === 0) return "brand";
   if (sessionCost >= sessionAverage * 1.5) return "red";
killedBy: Cost ticker brand zone is brand when cost < average
statusReason: Property failed after 1 tests
{ seed: -1721361631, path: "0:0", endOnFailure: true }
Counterexample: [0.01]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/costTicker.ts:31:7
 
 const classifyZone = (sessionCost: number, sessionAverage: number): ColorZone => {
   if (sessionCost === 0 && sessionAverage === 0) return "dim";
-  if (sessionAverage === 0) return "brand";
+  if (true) return "brand";
   if (sessionCost >= sessionAverage * 1.5) return "red";
   if (sessionCost >= sessionAverage) return "amber";
killedBy: Cost ticker amber zone is amber when cost >= average and cost < average * 1.5
statusReason: Property failed after 1 tests
{ seed: -105896172, path: "0:0:0", endOnFailure: true }
Counterexample: [0.01,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/costTicker.ts:31:7
 
 const classifyZone = (sessionCost: number, sessionAverage: number): ColorZone => {
   if (sessionCost === 0 && sessionAverage === 0) return "dim";
-  if (sessionAverage === 0) return "brand";
+  if (false) return "brand";
   if (sessionCost >= sessionAverage * 1.5) return "red";
   if (sessionCost >= sessionAverage) return "amber";
killedBy: Cost ticker brand zone is brand when average is zero but cost is positive (no history)
statusReason: Property failed after 1 tests
{ seed: -293684490, path: "0:0", endOnFailure: true }
Counterexample: [0.01]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/costTicker.ts:32:7
 const classifyZone = (sessionCost: number, sessionAverage: number): ColorZone => {
   if (sessionCost === 0 && sessionAverage === 0) return "dim";
   if (sessionAverage === 0) return "brand";
-  if (sessionCost >= sessionAverage * 1.5) return "red";
+  if (false) return "red";
   if (sessionCost >= sessionAverage) return "amber";
   return "brand";
killedBy: Cost ticker red zone is red when cost >= average * 1.5
statusReason: Property failed after 1 tests
{ seed: -1166641277, path: "0:0:0", endOnFailure: true }
Counterexample: [0.01,1.5]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/costTicker.ts:32:7
 const classifyZone = (sessionCost: number, sessionAverage: number): ColorZone => {
   if (sessionCost === 0 && sessionAverage === 0) return "dim";
   if (sessionAverage === 0) return "brand";
-  if (sessionCost >= sessionAverage * 1.5) return "red";
+  if (sessionCost > sessionAverage * 1.5) return "red";
   if (sessionCost >= sessionAverage) return "amber";
   return "brand";
killedBy: Cost ticker color shifts at session average shifts to red when cost significantly exceeds historical average
statusReason: expected 'amber' to be 'red' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/costTicker.ts:33:7
   if (sessionCost === 0 && sessionAverage === 0) return "dim";
   if (sessionAverage === 0) return "brand";
   if (sessionCost >= sessionAverage * 1.5) return "red";
-  if (sessionCost >= sessionAverage) return "amber";
+  if (sessionCost < sessionAverage) return "amber";
   return "brand";
 };
killedBy: Cost ticker brand zone is brand when cost < average
statusReason: Property failed after 1 tests
{ seed: -1568221879, path: "0:0", endOnFailure: true }
Counterexample: [0.01]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/costTicker.ts:33:7
   if (sessionCost === 0 && sessionAverage === 0) return "dim";
   if (sessionAverage === 0) return "brand";
   if (sessionCost >= sessionAverage * 1.5) return "red";
-  if (sessionCost >= sessionAverage) return "amber";
+  if (true) return "amber";
   return "brand";
 };
killedBy: Cost ticker brand zone is brand when cost < average
statusReason: Property failed after 1 tests
{ seed: -1019762647, path: "0:0", endOnFailure: true }
Counterexample: [0.01]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
