[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:60:7
 
 /** Derive a display label from the session ID. */
 export const deriveSessionLabel = (sessionId: string): string => {
-  if (sessionId === "" || sessionId === "default") return "";
+  if (true) return "";
   return sessionId.length > 20 ? sessionId.slice(0, 17) + "..." : sessionId;
 };
killedBy: Session label contains session ID when non-default
statusReason: expected '' to be 'refactor-auth' // Object.is equality

[Killed] LogicalOperator
plugins/norbert-usage/domain/dashboard.ts:66:3
 
 /** A session is onboarding when all activity metrics are zero. */
 const isOnboardingSession = (metrics: SessionMetrics): boolean =>
-  metrics.totalTokens === 0 &&
-  metrics.sessionCost === 0 &&
-  metrics.toolCallCount === 0 &&
-  metrics.activeAgentCount === 0 &&
-  metrics.hookEventCount === 0;
+  metrics.totalTokens === 0 && metrics.sessionCost === 0 && metrics.toolCallCount === 0 && metrics.activeAgentCount === 0 || metrics.hookEventCount === 0;
 
 // ---------------------------------------------------------------------------
killedBy: Onboarding detection isOnboarding is false when session has activity
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:70:3
   metrics.sessionCost === 0 &&
   metrics.toolCallCount === 0 &&
   metrics.activeAgentCount === 0 &&
-  metrics.hookEventCount === 0;
+  metrics.hookEventCount !== 0;
 
 // ---------------------------------------------------------------------------
killedBy: UsageDashboardView shows onboarding state shows onboarding message when isOnboarding is true and no daily costs
statusReason: Unable to find an element with the text: /start a coding session/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Survived] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:70:3
   metrics.sessionCost === 0 &&
   metrics.toolCallCount === 0 &&
   metrics.activeAgentCount === 0 &&
-  metrics.hookEventCount === 0;
+  true;
 
 // ---------------------------------------------------------------------------

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:114:10
 });
 
 const buildHookHealthCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Hook Health",
+  label: "",
   value: metrics.hookEventCount > 0 ? "OK" : "No Events",
   subtitle: metrics.hookEventCount > 0 ? `${metrics.hookEventCount} events` : "",
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: Hook Health. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:115:10
 
 const buildHookHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Hook Health",
-  value: metrics.hookEventCount > 0 ? "OK" : "No Events",
+  value: metrics.hookEventCount <= 0 ? "OK" : "No Events",
   subtitle: metrics.hookEventCount > 0 ? `${metrics.hookEventCount} events` : "",
   urgency: metrics.hookEventCount > 0 ? "normal" : "amber",
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: OK. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:115:10
 
 const buildHookHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Hook Health",
-  value: metrics.hookEventCount > 0 ? "OK" : "No Events",
+  value: false ? "OK" : "No Events",
   subtitle: metrics.hookEventCount > 0 ? `${metrics.hookEventCount} events` : "",
   urgency: metrics.hookEventCount > 0 ? "normal" : "amber",
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: OK. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:116:13
 const buildHookHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Hook Health",
   value: metrics.hookEventCount > 0 ? "OK" : "No Events",
-  subtitle: metrics.hookEventCount > 0 ? `${metrics.hookEventCount} events` : "",
+  subtitle: metrics.hookEventCount >= 0 ? `${metrics.hookEventCount} events` : "",
   urgency: metrics.hookEventCount > 0 ? "normal" : "amber",
 });
killedBy: Hook Health card shows 'No Events' with amber urgency when hookEventCount is 0
statusReason: expected '0 events' to be '' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:116:13
 const buildHookHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Hook Health",
   value: metrics.hookEventCount > 0 ? "OK" : "No Events",
-  subtitle: metrics.hookEventCount > 0 ? `${metrics.hookEventCount} events` : "",
+  subtitle: metrics.hookEventCount <= 0 ? `${metrics.hookEventCount} events` : "",
   urgency: metrics.hookEventCount > 0 ? "normal" : "amber",
 });
killedBy: Hook Health card shows OK with normal urgency when events are flowing
statusReason: expected '' to be '200 events' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:117:12
   label: "Hook Health",
   value: metrics.hookEventCount > 0 ? "OK" : "No Events",
   subtitle: metrics.hookEventCount > 0 ? `${metrics.hookEventCount} events` : "",
-  urgency: metrics.hookEventCount > 0 ? "normal" : "amber",
+  urgency: metrics.hookEventCount >= 0 ? "normal" : "amber",
 });
 
killedBy: Hook Health card shows 'No Events' with amber urgency when hookEventCount is 0
statusReason: expected 'normal' to be 'amber' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:117:12
   label: "Hook Health",
   value: metrics.hookEventCount > 0 ? "OK" : "No Events",
   subtitle: metrics.hookEventCount > 0 ? `${metrics.hookEventCount} events` : "",
-  urgency: metrics.hookEventCount > 0 ? "normal" : "amber",
+  urgency: false ? "normal" : "amber",
 });
 
killedBy: Hook Health card shows OK with normal urgency when events are flowing
statusReason: expected 'amber' to be 'normal' // Object.is equality
