[Killed] ArithmeticOperator
plugins/norbert-usage/domain/instantaneousRate.ts:49:42
   current: MetricsSnapshot,
   previous: MetricsSnapshot,
 ): InstantaneousRates => {
-  const deltaMs = Math.max(MIN_DELTA_MS, current.timestamp - previous.timestamp);
+  const deltaMs = Math.max(MIN_DELTA_MS, current.timestamp + previous.timestamp);
   const deltaSec = deltaMs / 1000;
 
killedBy: Instantaneous rate reflects recent activity burst, not session-long average rate spikes during a burst then drops to zero when idle
statusReason: expected 16.52892561983471 to be close to 2000, received difference is 1983.4710743801652, but expected 0.5

[Killed] MethodExpression
plugins/norbert-usage/domain/instantaneousRate.ts:49:19
   current: MetricsSnapshot,
   previous: MetricsSnapshot,
 ): InstantaneousRates => {
-  const deltaMs = Math.max(MIN_DELTA_MS, current.timestamp - previous.timestamp);
+  const deltaMs = Math.min(MIN_DELTA_MS, current.timestamp - previous.timestamp);
   const deltaSec = deltaMs / 1000;
 
killedBy: computeInstantaneousRates computes 500 tok/s from 1000 token delta over 2 seconds
statusReason: expected 1000000 to be close to 500, received difference is 999500, but expected 0.000005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/instantaneousRate.ts:50:20
   previous: MetricsSnapshot,
 ): InstantaneousRates => {
   const deltaMs = Math.max(MIN_DELTA_MS, current.timestamp - previous.timestamp);
-  const deltaSec = deltaMs / 1000;
+  const deltaSec = deltaMs * 1000;
 
   const deltaTokens = current.totalTokens - previous.totalTokens;
killedBy: computeInstantaneousRates computes 500 tok/s from 1000 token delta over 2 seconds
statusReason: expected 0.0005 to be close to 500, received difference is 499.9995, but expected 0.000005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/instantaneousRate.ts:52:23
   const deltaMs = Math.max(MIN_DELTA_MS, current.timestamp - previous.timestamp);
   const deltaSec = deltaMs / 1000;
 
-  const deltaTokens = current.totalTokens - previous.totalTokens;
+  const deltaTokens = current.totalTokens + previous.totalTokens;
   const deltaCost = current.sessionCost - previous.sessionCost;
 
killedBy: computeInstantaneousRates returns zero rate when no token delta
statusReason: expected 5000 to be +0 // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/instantaneousRate.ts:53:21
   const deltaSec = deltaMs / 1000;
 
   const deltaTokens = current.totalTokens - previous.totalTokens;
-  const deltaCost = current.sessionCost - previous.sessionCost;
+  const deltaCost = current.sessionCost + previous.sessionCost;
 
   return {
killedBy: computeInstantaneousRates returns zero rate when no token delta
statusReason: expected 1.5 to be +0 // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/instantaneousRate.ts:56:28
   const deltaCost = current.sessionCost - previous.sessionCost;
 
   return {
-    tokenRate: Math.max(0, deltaTokens / deltaSec),
+    tokenRate: Math.max(0, deltaTokens * deltaSec),
     costRate: Math.max(0, deltaCost / deltaSec),
   };
killedBy: computeInstantaneousRates computes 500 tok/s from 1000 token delta over 2 seconds
statusReason: expected 2000 to be close to 500, received difference is 1500, but expected 0.000005

[Killed] MethodExpression
plugins/norbert-usage/domain/instantaneousRate.ts:56:16
   const deltaCost = current.sessionCost - previous.sessionCost;
 
   return {
-    tokenRate: Math.max(0, deltaTokens / deltaSec),
+    tokenRate: Math.min(0, deltaTokens / deltaSec),
     costRate: Math.max(0, deltaCost / deltaSec),
   };
killedBy: computeInstantaneousRates computes 500 tok/s from 1000 token delta over 2 seconds
statusReason: expected +0 to be close to 500, received difference is 500, but expected 0.000005

[Killed] MethodExpression
plugins/norbert-usage/domain/instantaneousRate.ts:57:15
 
   return {
     tokenRate: Math.max(0, deltaTokens / deltaSec),
-    costRate: Math.max(0, deltaCost / deltaSec),
+    costRate: Math.min(0, deltaCost / deltaSec),
   };
 };
killedBy: computeInstantaneousRates computes 500 tok/s from 1000 token delta over 2 seconds
statusReason: expected +0 to be close to 0.075, received difference is 0.075, but expected 0.000005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/instantaneousRate.ts:57:27
 
   return {
     tokenRate: Math.max(0, deltaTokens / deltaSec),
-    costRate: Math.max(0, deltaCost / deltaSec),
+    costRate: Math.max(0, deltaCost * deltaSec),
   };
 };
killedBy: computeInstantaneousRates computes 500 tok/s from 1000 token delta over 2 seconds
statusReason: expected 0.3 to be close to 0.075, received difference is 0.22499999999999998, but expected 0.000005
