[Survived] StringLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:38:23
   contextWindowPct: 0,
   contextWindowTokens: 0,
   contextWindowMaxTokens: 0,
-  contextWindowModel: "",
+  contextWindowModel: "Stryker was here!",
   hookEventCount: 0,
   sessionStartedAt: "",

[Killed] ObjectLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:123:5
 const eventHandlers: Record<
   string,
   (metrics: SessionMetrics, event: AggregatorEvent, pricingTable: PricingTable) => SessionMetrics
-> = {
-  prompt_submit: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
-
-  tool_call_end: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
-
-  tool_call_start: (metrics) =>
-    applyToolCallStart(metrics),
-
-  session_start: (metrics, event) =>
-    applySessionStart(metrics, event.receivedAt),
-
-  agent_complete: (metrics, event, pricingTable) =>
-    applyAgentCompleteCount(applyTokenUsage(metrics, event.payload, pricingTable)),
-};
+> = {};
 
 /** Identity handler for unknown event types: only common fields updated. */
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: 1046161836, path: "0:0:0:1:0:0:0:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
