[Killed] ConditionalExpression
plugins/norbert-usage/domain/timeSeriesSampler.ts:40:18
   sample: RateSample,
 ): TimeSeriesBuffer => {
   const currentSamples = buffer.samples;
-  const isFull = currentSamples.length >= buffer.capacity;
+  const isFull = true;
 
   const newSamples = isFull
killedBy: appendSample eviction evicts oldest sample when buffer is full
statusReason: expected [ { timestamp: 400, …(2) } ] to have a length of 3 but got 1

[Killed] EqualityOperator
plugins/norbert-usage/domain/timeSeriesSampler.ts:40:18
   sample: RateSample,
 ): TimeSeriesBuffer => {
   const currentSamples = buffer.samples;
-  const isFull = currentSamples.length >= buffer.capacity;
+  const isFull = currentSamples.length < buffer.capacity;
 
   const newSamples = isFull
killedBy: appendSample size invariant buffer size never exceeds capacity
statusReason: Property failed after 96 tests
{ seed: 1205602763, path: "95:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [1,[{"timestamp":0,"tokenRate":0,"costRate":0},{"timestamp":0,"tokenRate":0,"costRate":0}]]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
plugins/norbert-usage/domain/timeSeriesSampler.ts:43:11
   const isFull = currentSamples.length >= buffer.capacity;
 
   const newSamples = isFull
-    ? [...currentSamples.slice(1), sample]
+    ? [...currentSamples, sample]
     : [...currentSamples, sample];
 
killedBy: appendSample size invariant buffer size never exceeds capacity
statusReason: Property failed after 2 tests
{ seed: -732982085, path: "1:0:1:0:0:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [1,[{"timestamp":0,"tokenRate":0,"costRate":0},{"timestamp":0,"tokenRate":0,"costRate":0}]]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/timeSeriesSampler.ts:70:7
 ): OscilloscopeStats => {
   const samples = getSamples(buffer);
 
-  if (samples.length === 0) {
+  if (true) {
     return {
       peakRate: 0,
killedBy: computeStats totalRateSum totalRateSum equals sum of all tokenRates in buffer
statusReason: Property failed after 1 tests
{ seed: -1798318029, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [[{"timestamp":0,"tokenRate":1,"costRate":0}]]
Shrunk 18 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/timeSeriesSampler.ts:70:7
 ): OscilloscopeStats => {
   const samples = getSamples(buffer);
 
-  if (samples.length === 0) {
+  if (samples.length !== 0) {
     return {
       peakRate: 0,
killedBy: computeStats with empty buffer returns zero stats for empty buffer
statusReason: Cannot read properties of undefined (reading 'timestamp')

[Killed] MethodExpression
plugins/norbert-usage/domain/timeSeriesSampler.ts:80:17
   }
 
   const peakRate = samples.reduce(
-    (max, s) => Math.max(max, s.tokenRate),
+    (max, s) => Math.min(max, s.tokenRate),
     0,
   );
killedBy: computeStats peak >= average peak rate is always >= average rate
statusReason: Property failed after 1 tests
{ seed: 655768967, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [[{"timestamp":0,"tokenRate":1,"costRate":0}]]
Shrunk 18 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/timeSeriesSampler.ts:85:17
   );
 
   const totalRateSum = samples.reduce(
-    (sum, s) => sum + s.tokenRate,
+    (sum, s) => sum - s.tokenRate,
     0,
   );
killedBy: computeStats values are non-negative all stat values are >= 0
statusReason: Property failed after 1 tests
{ seed: -245728929, path: "0:1:1:2:1:1:1:1:1:1:1:1:1:1:1:2:2", endOnFailure: true }
Counterexample: [[{"timestamp":0,"tokenRate":1,"costRate":0}]]
Shrunk 16 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/timeSeriesSampler.ts:89:19
     0,
   );
 
-  const avgRate = totalRateSum / samples.length;
+  const avgRate = totalRateSum * samples.length;
 
   const firstTimestamp = samples[0].timestamp;
killedBy: computeStats peak >= average peak rate is always >= average rate
statusReason: Property failed after 1 tests
{ seed: 1558702948, path: "0:1:0:0:1:1:1:1:2:1:1:1:1:1:1:1:1:1:1:1:2", endOnFailure: true }
Counterexample: [[{"timestamp":0,"tokenRate":0,"costRate":0},{"timestamp":0,"tokenRate":1,"costRate":0}]]
Shrunk 20 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/timeSeriesSampler.ts:92:33
   const avgRate = totalRateSum / samples.length;
 
   const firstTimestamp = samples[0].timestamp;
-  const lastTimestamp = samples[samples.length - 1].timestamp;
+  const lastTimestamp = samples[samples.length + 1].timestamp;
   const windowDuration = Math.max(0, lastTimestamp - firstTimestamp);
 
killedBy: computeStats peak >= average peak rate is always >= average rate
statusReason: Property failed after 1 tests
{ seed: -1660237579, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [[{"timestamp":0,"tokenRate":0,"costRate":0}]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
plugins/norbert-usage/domain/timeSeriesSampler.ts:93:26
 
   const firstTimestamp = samples[0].timestamp;
   const lastTimestamp = samples[samples.length - 1].timestamp;
-  const windowDuration = Math.max(0, lastTimestamp - firstTimestamp);
+  const windowDuration = Math.min(0, lastTimestamp - firstTimestamp);
 
   return {
killedBy: computeStats values are non-negative all stat values are >= 0
statusReason: Property failed after 1 tests
{ seed: 185305127, path: "0:3:4:0:1:4:5:2:2:2:3:1:1:1:3:2:2:3:3:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:3:3:3", endOnFailure: true }
Counterexample: [[{"timestamp":1,"tokenRate":0,"costRate":0},{"timestamp":0,"tokenRate":0,"costRate":0}]]
Shrunk 46 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/timeSeriesSampler.ts:93:38
 
   const firstTimestamp = samples[0].timestamp;
   const lastTimestamp = samples[samples.length - 1].timestamp;
-  const windowDuration = Math.max(0, lastTimestamp - firstTimestamp);
+  const windowDuration = Math.max(0, lastTimestamp + firstTimestamp);
 
   return {
killedBy: computeStats windowDuration windowDuration is difference between last and first timestamp
statusReason: expected 6000 to be 4000 // Object.is equality
