[Killed] StringLiteral
plugins/norbert-usage/domain/pricingModel.ts:35:19
     cacheCreationRate: 0.00375,
   },
   {
-    modelPattern: "claude-haiku",
+    modelPattern: "",
     inputRate: 0.0008,
     outputRate: 0.004,
killedBy: calculateCost with unknown model falls back to most expensive (Opus) rates for unrecognized models
statusReason: Property failed after 1 tests
{ seed: 678606216, path: "0", endOnFailure: true }
Counterexample: ["claude-unknown-model-v99"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/pricingModel.ts:59:14
   model: string,
   table: PricingTable,
 ): ModelPricing =>
-  table.find((entry) => model.startsWith(entry.modelPattern)) ??
+  table.find(() => undefined) ??
   table[table.length - 1];
 
killedBy: calculateCost with Sonnet 4 model computes correct cost for 800 input and 2000 output tokens
statusReason: expected 0.012 to be close to 0.0024, received difference is 0.009600000000000001, but expected 0.00005

[Killed] MethodExpression
plugins/norbert-usage/domain/pricingModel.ts:59:25
   model: string,
   table: PricingTable,
 ): ModelPricing =>
-  table.find((entry) => model.startsWith(entry.modelPattern)) ??
+  table.find((entry) => model.endsWith(entry.modelPattern)) ??
   table[table.length - 1];
 
killedBy: calculateCost with Sonnet 4 model computes correct cost for 800 input and 2000 output tokens
statusReason: expected 0.012 to be close to 0.0024, received difference is 0.009600000000000001, but expected 0.00005

[NoCoverage] ArithmeticOperator
plugins/norbert-usage/domain/pricingModel.ts:60:9
   table: PricingTable,
 ): ModelPricing =>
   table.find((entry) => model.startsWith(entry.modelPattern)) ??
-  table[table.length - 1];
+  table[table.length + 1];
 
 /** Compute cost for a single token category: (tokens / 1000) * rate */

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/pricingModel.ts:64:4
 
 /** Compute cost for a single token category: (tokens / 1000) * rate */
 const computeTokenCost = (tokenCount: number, ratePerThousand: number): number =>
-  (tokenCount / 1000) * ratePerThousand;
+  (tokenCount * 1000) * ratePerThousand;
 
 // ---------------------------------------------------------------------------
killedBy: calculateCost with Opus 4 model computes correct cost for 1200 input and 3400 output tokens
statusReason: expected 18000 to be close to 0.018, received difference is 17999.982, but expected 0.00005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/pricingModel.ts:64:3
 
 /** Compute cost for a single token category: (tokens / 1000) * rate */
 const computeTokenCost = (tokenCount: number, ratePerThousand: number): number =>
-  (tokenCount / 1000) * ratePerThousand;
+  tokenCount / 1000 / ratePerThousand;
 
 // ---------------------------------------------------------------------------
killedBy: calculateCost with Opus 4 model computes correct cost for 1200 input and 3400 output tokens
statusReason: expected 80 to be close to 0.018, received difference is 79.982, but expected 0.00005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/pricingModel.ts:89:21
   const outputCost = computeTokenCost(usage.outputTokens, pricing.outputRate);
   const cacheReadCost = computeTokenCost(usage.cacheReadTokens, pricing.cacheReadRate);
   const cacheCreationCost = computeTokenCost(usage.cacheCreationTokens, pricing.cacheCreationRate);
-  const cacheCost = cacheReadCost + cacheCreationCost;
+  const cacheCost = cacheReadCost - cacheCreationCost;
   const totalCost = inputCost + outputCost + cacheCost;
 
killedBy: calculateCost produces non-negative costs all cost components are >= 0 for any non-negative token counts
statusReason: Property failed after 2 tests
{ seed: 132552833, path: "1:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [{"inputTokens":0,"outputTokens":0,"cacheReadTokens":0,"cacheCreationTokens":1,"model":"claude-haiku-3-5-20241022"}]
Shrunk 23 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/pricingModel.ts:90:21
   const cacheReadCost = computeTokenCost(usage.cacheReadTokens, pricing.cacheReadRate);
   const cacheCreationCost = computeTokenCost(usage.cacheCreationTokens, pricing.cacheCreationRate);
   const cacheCost = cacheReadCost + cacheCreationCost;
-  const totalCost = inputCost + outputCost + cacheCost;
+  const totalCost = inputCost + outputCost - cacheCost;
 
   return {
killedBy: calculateCost total equals sum of components totalCost always equals inputCost + outputCost + cacheCost
statusReason: Property failed after 1 tests
{ seed: -1769143530, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [{"inputTokens":0,"outputTokens":0,"cacheReadTokens":0,"cacheCreationTokens":1,"model":"claude-haiku-3-5-20241022"}]
Shrunk 22 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/pricingModel.ts:90:21
   const cacheReadCost = computeTokenCost(usage.cacheReadTokens, pricing.cacheReadRate);
   const cacheCreationCost = computeTokenCost(usage.cacheCreationTokens, pricing.cacheCreationRate);
   const cacheCost = cacheReadCost + cacheCreationCost;
-  const totalCost = inputCost + outputCost + cacheCost;
+  const totalCost = inputCost - outputCost + cacheCost;
 
   return {
killedBy: token-bearing events update tokens and cost token accumulation is monotonically non-decreasing over sequence of token events
statusReason: Property failed after 1 tests
{ seed: -1284978385, path: "0:1:3:1:3:1:3:2:1:1:1:2:1:1:1:2:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:2:2:2:2:3:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:3:3:3", endOnFailure: true }
Shrunk 60 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
