[Killed] EqualityOperator
plugins/norbert-usage/domain/tokenExtractor.ts:14:32
 // ---------------------------------------------------------------------------
 
 const isRecord = (value: unknown): value is Record<string, unknown> =>
-  typeof value === "object" && value !== null && !Array.isArray(value);
+  typeof value === "object" && value === null && !Array.isArray(value);
 
 const isNumber = (value: unknown): value is number =>
killedBy: extractTokenUsage with valid usage payloads always returns 'found' with matching token counts for any valid payload
statusReason: Property failed after 1 tests
{ seed: -800916993, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [{"input_tokens":0,"output_tokens":0,"model":" "}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/tokenExtractor.ts:17:3
   typeof value === "object" && value !== null && !Array.isArray(value);
 
 const isNumber = (value: unknown): value is number =>
-  typeof value === "number";
+  false;
 
 const isString = (value: unknown): value is string =>
killedBy: extractTokenUsage with valid usage payloads always returns 'found' with matching token counts for any valid payload
statusReason: Property failed after 1 tests
{ seed: -1311051314, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [{"input_tokens":0,"output_tokens":0,"model":" "}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/tokenExtractor.ts:17:3
   typeof value === "object" && value !== null && !Array.isArray(value);
 
 const isNumber = (value: unknown): value is number =>
-  typeof value === "number";
+  typeof value !== "number";
 
 const isString = (value: unknown): value is string =>
killedBy: extractTokenUsage with valid usage payloads always returns 'found' with matching token counts for any valid payload
statusReason: Property failed after 1 tests
{ seed: -1407015126, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"input_tokens":0,"output_tokens":0,"model":" "}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/tokenExtractor.ts:20:3
   typeof value === "number";
 
 const isString = (value: unknown): value is string =>
-  typeof value === "string";
+  true;
 
 // ---------------------------------------------------------------------------
killedBy: extractTokenUsage with missing or invalid usage data returns 'absent' when usage exists but required fields are missing
statusReason: expected 'found' to be 'absent' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/tokenExtractor.ts:20:3
   typeof value === "number";
 
 const isString = (value: unknown): value is string =>
-  typeof value === "string";
+  typeof value !== "string";
 
 // ---------------------------------------------------------------------------
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -1871477767, path: "0:0:0:1:0:0:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
plugins/norbert-usage/domain/tokenExtractor.ts:57:56
   if (!isRecord(usageField)) return { tag: "absent" };
 
   const inputTokens = extractNumericField(usageField, "input_tokens");
-  const outputTokens = extractNumericField(usageField, "output_tokens");
+  const outputTokens = extractNumericField(usageField, "");
   const model = usageField["model"];
 
killedBy: extractTokenUsage with valid usage payloads always returns 'found' with matching token counts for any valid payload
statusReason: Property failed after 1 tests
{ seed: 1651948973, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"input_tokens":0,"output_tokens":0,"model":" "}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
plugins/norbert-usage/domain/tokenExtractor.ts:58:28
 
   const inputTokens = extractNumericField(usageField, "input_tokens");
   const outputTokens = extractNumericField(usageField, "output_tokens");
-  const model = usageField["model"];
+  const model = usageField[""];
 
   if (inputTokens === undefined || outputTokens === undefined || !isString(model)) {
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -256160505, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 20 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encount

[Killed] StringLiteral
plugins/norbert-usage/domain/tokenExtractor.ts:64:59
     return { tag: "absent" };
   }
 
-  const cacheReadTokens = extractNumericField(usageField, "cache_read_input_tokens", 0)!;
+  const cacheReadTokens = extractNumericField(usageField, "", 0)!;
   const cacheCreationTokens = extractNumericField(usageField, "cache_creation_input_tokens", 0)!;
 
killedBy: extractTokenUsage with valid usage payloads extracts cache tokens when present in payload
statusReason: Property failed after 1 tests
{ seed: -1008744975, path: "0:0:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"input_tokens":0,"output_tokens":0,"model":" ","cache_read_input_tokens":1,"cache_creation_input_tokens":0}]
Shrunk 26 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
plugins/norbert-usage/domain/tokenExtractor.ts:65:63
   }
 
   const cacheReadTokens = extractNumericField(usageField, "cache_read_input_tokens", 0)!;
-  const cacheCreationTokens = extractNumericField(usageField, "cache_creation_input_tokens", 0)!;
+  const cacheCreationTokens = extractNumericField(usageField, "", 0)!;
 
   return {
killedBy: extractTokenUsage with valid usage payloads extracts cache tokens when present in payload
statusReason: Property failed after 1 tests
{ seed: -589470123, path: "0:0:0:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [{"input_tokens":0,"output_tokens":0,"model":" ","cache_read_input_tokens":0,"cache_creation_input_tokens":1}]
Shrunk 26 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
