[Killed] ArrowFunction
src/plugins/norbert-usage/hookProcessor.ts:33:18
 // Payload field extraction — pure helpers
 // ---------------------------------------------------------------------------
 
-const isRecord = (value: unknown): value is Record<string, unknown> =>
-  typeof value === "object" && value !== null && !Array.isArray(value);
+const isRecord = () => undefined;
 
 /** Extract event_type string from an unknown payload, defaulting to "unknown". */
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] LogicalOperator
src/plugins/norbert-usage/hookProcessor.ts:34:3
 // ---------------------------------------------------------------------------
 
 const isRecord = (value: unknown): value is Record<string, unknown> =>
-  typeof value === "object" && value !== null && !Array.isArray(value);
+  typeof value === "object" || value !== null && !Array.isArray(value);
 
 /** Extract event_type string from an unknown payload, defaulting to "unknown". */
killedBy: hookProcessor with malformed payloads null payload does not throw and increments totalEventCount
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:34:3
 // ---------------------------------------------------------------------------
 
 const isRecord = (value: unknown): value is Record<string, unknown> =>
-  typeof value === "object" && value !== null && !Array.isArray(value);
+  false;
 
 /** Extract event_type string from an unknown payload, defaulting to "unknown". */
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:37:56
   typeof value === "object" && value !== null && !Array.isArray(value);
 
 /** Extract event_type string from an unknown payload, defaulting to "unknown". */
-const extractEventType = (payload: unknown): string => {
-  if (!isRecord(payload)) return "unknown";
-  const eventType = payload["event_type"];
-  return typeof eventType === "string" ? eventType : "unknown";
-};
+const extractEventType = (payload: unknown): string => {};
 
 /** Extract session_id from the raw event payload wrapper. */
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:38:7
 
 /** Extract event_type string from an unknown payload, defaulting to "unknown". */
 const extractEventType = (payload: unknown): string => {
-  if (!isRecord(payload)) return "unknown";
+  if (false) return "unknown";
   const eventType = payload["event_type"];
   return typeof eventType === "string" ? eventType : "unknown";
killedBy: hookProcessor with malformed payloads null payload does not throw and increments totalEventCount
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:38:7
 
 /** Extract event_type string from an unknown payload, defaulting to "unknown". */
 const extractEventType = (payload: unknown): string => {
-  if (!isRecord(payload)) return "unknown";
+  if (true) return "unknown";
   const eventType = payload["event_type"];
   return typeof eventType === "string" ? eventType : "unknown";
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] EqualityOperator
src/plugins/norbert-usage/hookProcessor.ts:40:10
 const extractEventType = (payload: unknown): string => {
   if (!isRecord(payload)) return "unknown";
   const eventType = payload["event_type"];
-  return typeof eventType === "string" ? eventType : "unknown";
+  return typeof eventType !== "string" ? eventType : "unknown";
 };
 
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:40:10
 const extractEventType = (payload: unknown): string => {
   if (!isRecord(payload)) return "unknown";
   const eventType = payload["event_type"];
-  return typeof eventType === "string" ? eventType : "unknown";
+  return false ? eventType : "unknown";
 };
 
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:44:63
 };
 
 /** Extract session_id from the raw event payload wrapper. */
-const extractSessionId = (payload: unknown): string | null => {
-  if (!isRecord(payload)) return null;
-  const sid = payload["session_id"];
-  return typeof sid === "string" ? sid : null;
-};
+const extractSessionId = (payload: unknown): string | null => {};
 
 /** Extract a human-readable project name from the event payload.
killedBy: hookProcessor passes isOtelActive to aggregateEvent when getIsOtelActive returns true, OTel cost path is used (hook cost suppressed)
statusReason: expected 0.010499999999999999 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:45:7
 
 /** Extract session_id from the raw event payload wrapper. */
 const extractSessionId = (payload: unknown): string | null => {
-  if (!isRecord(payload)) return null;
+  if (false) return null;
   const sid = payload["session_id"];
   return typeof sid === "string" ? sid : null;
killedBy: hookProcessor with malformed payloads null payload does not throw and increments totalEventCount
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/plugins/norbert-usage/hookProcessor.ts:45:7
 
 /** Extract session_id from the raw event payload wrapper. */
 const extractSessionId = (payload: unknown): string | null => {
-  if (!isRecord(payload)) return null;
+  if (isRecord(payload)) return null;
   const sid = payload["session_id"];
   return typeof sid === "string" ? sid : null;
killedBy: hookProcessor with malformed payloads null payload does not throw and increments totalEventCount
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] StringLiteral
src/plugins/norbert-usage/hookProcessor.ts:46:23
 /** Extract session_id from the raw event payload wrapper. */
 const extractSessionId = (payload: unknown): string | null => {
   if (!isRecord(payload)) return null;
-  const sid = payload["session_id"];
+  const sid = payload[""];
   return typeof sid === "string" ? sid : null;
 };
killedBy: hookProcessor passes isOtelActive to aggregateEvent when getIsOtelActive returns true, OTel cost path is used (hook cost suppressed)
statusReason: expected 0.010499999999999999 to be +0 // Object.is equality

[Killed] EqualityOperator
src/plugins/norbert-usage/hookProcessor.ts:47:10
 const extractSessionId = (payload: unknown): string | null => {
   if (!isRecord(payload)) return null;
   const sid = payload["session_id"];
-  return typeof sid === "string" ? sid : null;
+  return typeof sid !== "string" ? sid : null;
 };
 
killedBy: hookProcessor passes isOtelActive to aggregateEvent when getIsOtelActive returns true, OTel cost path is used (hook cost suppressed)
statusReason: expected 0.010499999999999999 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:47:10
 const extractSessionId = (payload: unknown): string | null => {
   if (!isRecord(payload)) return null;
   const sid = payload["session_id"];
-  return typeof sid === "string" ? sid : null;
+  return false ? sid : null;
 };
 
killedBy: hookProcessor passes isOtelActive to aggregateEvent when getIsOtelActive returns true, OTel cost path is used (hook cost suppressed)
statusReason: expected 0.010499999999999999 to be +0 // Object.is equality

[Survived] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:53:59
 /** Extract a human-readable project name from the event payload.
  *  Claude Code hook payloads include a `cwd` field with the working directory.
  *  Falls back to the last segment of `transcript_path` parent directories. */
-const extractSessionLabel = (payload: unknown): string => {
-  if (!isRecord(payload)) return "";
-  // Try cwd first (top-level field on Claude Code hook payloads)
-  const cwd = payload["cwd"];
-  if (typeof cwd === "string" && cwd.length > 0) {
-    const segments = cwd.replace(/\\/g, "/").split("/").filter(Boolean);
-    return segments[segments.length - 1] ?? "";
-  }
-  // Try inner payload's cwd
-  const inner = payload["payload"];
-  if (isRecord(inner)) {
-    const innerCwd = inner["cwd"];
-    if (typeof innerCwd === "string" && innerCwd.length > 0) {
-      const segments = innerCwd.replace(/\\/g, "/").split("/").filter(Boolean);
-      return segments[segments.length - 1] ?? "";
-    }
-  }
-  return "";
-};
+const extractSessionLabel = (payload: unknown): string => {};
 
 /** Extract the inner payload from a DB event wrapper.

[Survived] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:54:7
  *  Claude Code hook payloads include a `cwd` field with the working directory.
  *  Falls back to the last segment of `transcript_path` parent directories. */
 const extractSessionLabel = (payload: unknown): string => {
-  if (!isRecord(payload)) return "";
+  if (true) return "";
   // Try cwd first (top-level field on Claude Code hook payloads)
   const cwd = payload["cwd"];

[Survived] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:54:7
  *  Claude Code hook payloads include a `cwd` field with the working directory.
  *  Falls back to the last segment of `transcript_path` parent directories. */
 const extractSessionLabel = (payload: unknown): string => {
-  if (!isRecord(payload)) return "";
+  if (false) return "";
   // Try cwd first (top-level field on Claude Code hook payloads)
   const cwd = payload["cwd"];

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:57:7
   if (!isRecord(payload)) return "";
   // Try cwd first (top-level field on Claude Code hook payloads)
   const cwd = payload["cwd"];
-  if (typeof cwd === "string" && cwd.length > 0) {
+  if (true) {
     const segments = cwd.replace(/\\/g, "/").split("/").filter(Boolean);
     return segments[segments.length - 1] ?? "";
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:57:7
   if (!isRecord(payload)) return "";
   // Try cwd first (top-level field on Claude Code hook payloads)
   const cwd = payload["cwd"];
-  if (typeof cwd === "string" && cwd.length > 0) {
+  if (true && cwd.length > 0) {
     const segments = cwd.replace(/\\/g, "/").split("/").filter(Boolean);
     return segments[segments.length - 1] ?? "";
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] MethodExpression
src/plugins/norbert-usage/hookProcessor.ts:58:22
   // Try cwd first (top-level field on Claude Code hook payloads)
   const cwd = payload["cwd"];
   if (typeof cwd === "string" && cwd.length > 0) {
-    const segments = cwd.replace(/\\/g, "/").split("/").filter(Boolean);
+    const segments = cwd.replace(/\\/g, "/").split("/");
     return segments[segments.length - 1] ?? "";
   }

[NoCoverage] LogicalOperator
src/plugins/norbert-usage/hookProcessor.ts:59:12
   const cwd = payload["cwd"];
   if (typeof cwd === "string" && cwd.length > 0) {
     const segments = cwd.replace(/\\/g, "/").split("/").filter(Boolean);
-    return segments[segments.length - 1] ?? "";
+    return segments[segments.length - 1] && "";
   }
   // Try inner payload's cwd

[NoCoverage] ArithmeticOperator
src/plugins/norbert-usage/hookProcessor.ts:59:21
   const cwd = payload["cwd"];
   if (typeof cwd === "string" && cwd.length > 0) {
     const segments = cwd.replace(/\\/g, "/").split("/").filter(Boolean);
-    return segments[segments.length - 1] ?? "";
+    return segments[segments.length + 1] ?? "";
   }
   // Try inner payload's cwd

[Survived] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:63:24
   }
   // Try inner payload's cwd
   const inner = payload["payload"];
-  if (isRecord(inner)) {
-    const innerCwd = inner["cwd"];
-    if (typeof innerCwd === "string" && innerCwd.length > 0) {
-      const segments = innerCwd.replace(/\\/g, "/").split("/").filter(Boolean);
-      return segments[segments.length - 1] ?? "";
-    }
-  }
+  if (isRecord(inner)) {}
   return "";
 };

[Survived] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:63:7
   }
   // Try inner payload's cwd
   const inner = payload["payload"];
-  if (isRecord(inner)) {
+  if (true) {
     const innerCwd = inner["cwd"];
     if (typeof innerCwd === "string" && innerCwd.length > 0) {

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:65:9
   const inner = payload["payload"];
   if (isRecord(inner)) {
     const innerCwd = inner["cwd"];
-    if (typeof innerCwd === "string" && innerCwd.length > 0) {
+    if (true) {
       const segments = innerCwd.replace(/\\/g, "/").split("/").filter(Boolean);
       return segments[segments.length - 1] ?? "";
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:65:9
   const inner = payload["payload"];
   if (isRecord(inner)) {
     const innerCwd = inner["cwd"];
-    if (typeof innerCwd === "string" && innerCwd.length > 0) {
+    if (true && innerCwd.length > 0) {
       const segments = innerCwd.replace(/\\/g, "/").split("/").filter(Boolean);
       return segments[segments.length - 1] ?? "";
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] MethodExpression
src/plugins/norbert-usage/hookProcessor.ts:66:24
   if (isRecord(inner)) {
     const innerCwd = inner["cwd"];
     if (typeof innerCwd === "string" && innerCwd.length > 0) {
-      const segments = innerCwd.replace(/\\/g, "/").split("/").filter(Boolean);
+      const segments = innerCwd.replace(/\\/g, "/").split("/");
       return segments[segments.length - 1] ?? "";
     }

[NoCoverage] LogicalOperator
src/plugins/norbert-usage/hookProcessor.ts:67:14
     const innerCwd = inner["cwd"];
     if (typeof innerCwd === "string" && innerCwd.length > 0) {
       const segments = innerCwd.replace(/\\/g, "/").split("/").filter(Boolean);
-      return segments[segments.length - 1] ?? "";
+      return segments[segments.length - 1] && "";
     }
   }

[NoCoverage] ArithmeticOperator
src/plugins/norbert-usage/hookProcessor.ts:67:23
     const innerCwd = inner["cwd"];
     if (typeof innerCwd === "string" && innerCwd.length > 0) {
       const segments = innerCwd.replace(/\\/g, "/").split("/").filter(Boolean);
-      return segments[segments.length - 1] ?? "";
+      return segments[segments.length + 1] ?? "";
     }
   }

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:81:60
  * The token extractor needs the inner payload (where usage lives),
  * not the outer wrapper.
  */
-const extractInnerPayload = (wrapper: unknown): unknown => {
-  if (!isRecord(wrapper)) return wrapper;
-  const inner = wrapper["payload"];
-  return inner !== undefined ? inner : wrapper;
-};
+const extractInnerPayload = (wrapper: unknown): unknown => {};
 
 /** Build an AggregatorEvent from a raw payload and extracted event type. */
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:82:7
  * not the outer wrapper.
  */
 const extractInnerPayload = (wrapper: unknown): unknown => {
-  if (!isRecord(wrapper)) return wrapper;
+  if (true) return wrapper;
   const inner = wrapper["payload"];
   return inner !== undefined ? inner : wrapper;
killedBy: hookProcessor with DB event wrapper extracts tokens from nested payload field (production event format)
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] BooleanLiteral
src/plugins/norbert-usage/hookProcessor.ts:82:7
  * not the outer wrapper.
  */
 const extractInnerPayload = (wrapper: unknown): unknown => {
-  if (!isRecord(wrapper)) return wrapper;
+  if (isRecord(wrapper)) return wrapper;
   const inner = wrapper["payload"];
   return inner !== undefined ? inner : wrapper;
killedBy: hookProcessor with DB event wrapper extracts tokens from nested payload field (production event format)
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] EqualityOperator
src/plugins/norbert-usage/hookProcessor.ts:84:10
 const extractInnerPayload = (wrapper: unknown): unknown => {
   if (!isRecord(wrapper)) return wrapper;
   const inner = wrapper["payload"];
-  return inner !== undefined ? inner : wrapper;
+  return inner === undefined ? inner : wrapper;
 };
 
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:84:10
 const extractInnerPayload = (wrapper: unknown): unknown => {
   if (!isRecord(wrapper)) return wrapper;
   const inner = wrapper["payload"];
-  return inner !== undefined ? inner : wrapper;
+  return true ? inner : wrapper;
 };
 
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ArrowFunction
src/plugins/norbert-usage/hookProcessor.ts:88:30
 };
 
 /** Build an AggregatorEvent from a raw payload and extracted event type. */
-const buildAggregatorEvent = (
-  eventType: string,
-  payload: unknown,
-): AggregatorEvent => ({
-  eventType,
-  payload: extractInnerPayload(payload),
-  receivedAt: new Date().toISOString(),
-});
+const buildAggregatorEvent = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: Event pipeline integration: DB event → hookBridge → metricsStore tool_call_end with usage data produces non-zero tokens and cost in the store
statusReason: expected +0 to be 1600 // Object.is equality

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:105:27
 const deriveCategorySamples = (
   previous: SessionMetrics,
   updated: SessionMetrics,
-): CategorySampleInput => {
-  const now = Date.now();
-  const previousSnapshot = {
-    totalTokens: previous.totalTokens,
-    sessionCost: previous.sessionCost,
-    timestamp: now - 1, // ensure non-zero delta
-  };
-  const currentSnapshot = {
-    totalTokens: updated.totalTokens,
-    sessionCost: updated.sessionCost,
-    timestamp: now,
-  };
-  const { tokenRate, costRate } = computeInstantaneousRates(currentSnapshot, previousSnapshot);
-
-  return {
-    tokens: tokenRate,
-    cost: costRate,
-    agents: updated.activeAgentCount,
-    context: updated.contextWindowPct,
-  };
-};
+): CategorySampleInput => {};
 
 // ---------------------------------------------------------------------------
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: Cannot read properties of undefined (reading 'tokens')

[Killed] ObjectLiteral
src/plugins/norbert-usage/hookProcessor.ts:107:28
   updated: SessionMetrics,
 ): CategorySampleInput => {
   const now = Date.now();
-  const previousSnapshot = {
-    totalTokens: previous.totalTokens,
-    sessionCost: previous.sessionCost,
-    timestamp: now - 1, // ensure non-zero delta
-  };
+  const previousSnapshot = {};
   const currentSnapshot = {
     totalTokens: updated.totalTokens,
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected NaN to be greater than or equal to 0

[Survived] ArithmeticOperator
src/plugins/norbert-usage/hookProcessor.ts:110:16
   const previousSnapshot = {
     totalTokens: previous.totalTokens,
     sessionCost: previous.sessionCost,
-    timestamp: now - 1, // ensure non-zero delta
+    timestamp: now + 1, // ensure non-zero delta
   };
   const currentSnapshot = {

[Killed] BooleanLiteral
src/plugins/norbert-usage/hookProcessor.ts:151:71
     const eventType = extractEventType(payload);
     const event = buildAggregatorEvent(eventType, payload);
     const sessionId = extractSessionId(payload);
-    const isOtelActive = sessionId ? (getIsOtelActive?.(sessionId) ?? false) : false;
+    const isOtelActive = sessionId ? (getIsOtelActive?.(sessionId) ?? true) : false;
 
     updateMetrics((previous: SessionMetrics): SessionMetrics =>
killedBy: hookProcessor with DB event wrapper extracts tokens from nested payload field (production event format)
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] BooleanLiteral
src/plugins/norbert-usage/hookProcessor.ts:151:80
     const eventType = extractEventType(payload);
     const event = buildAggregatorEvent(eventType, payload);
     const sessionId = extractSessionId(payload);
-    const isOtelActive = sessionId ? (getIsOtelActive?.(sessionId) ?? false) : false;
+    const isOtelActive = sessionId ? (getIsOtelActive?.(sessionId) ?? false) : true;
 
     updateMetrics((previous: SessionMetrics): SessionMetrics =>
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ArrowFunction
src/plugins/norbert-usage/hookProcessor.ts:153:19
     const sessionId = extractSessionId(payload);
     const isOtelActive = sessionId ? (getIsOtelActive?.(sessionId) ?? false) : false;
 
-    updateMetrics((previous: SessionMetrics): SessionMetrics =>
-      aggregateEvent(previous, event, pricingTable, isOtelActive),
+    updateMetrics(() => undefined,
     );
 
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: Cannot read properties of undefined (reading 'totalTokens')

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:158:36
     );
 
     // Also feed multi-session store if available
-    if (updateMultiSessionMetrics) {
-      if (sessionId) {
-        const label = extractSessionLabel(payload);
-        // Capture previous and updated metrics for category sample derivation
-        let previousMetrics: SessionMetrics | undefined;
-        let updatedMetrics: SessionMetrics | undefined;
-
-        updateMultiSessionMetrics(sessionId, label, (previous: SessionMetrics): SessionMetrics => {
-          previousMetrics = previous;
-          const next = aggregateEvent(previous, event, pricingTable, isOtelActive);
-          updatedMetrics = next;
-          return next;
-        });
-
-        // Append per-category samples after metrics update
-        if (appendSessionSample && previousMetrics && updatedMetrics) {
-          const samples = deriveCategorySamples(previousMetrics, updatedMetrics);
-          appendSessionSample(sessionId, samples);
-        }
-      }
-    }
+    if (updateMultiSessionMetrics) {}
   };
 };
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:158:9
     );
 
     // Also feed multi-session store if available
-    if (updateMultiSessionMetrics) {
+    if (false) {
       if (sessionId) {
         const label = extractSessionLabel(payload);
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:159:11
 
     // Also feed multi-session store if available
     if (updateMultiSessionMetrics) {
-      if (sessionId) {
+      if (false) {
         const label = extractSessionLabel(payload);
         // Capture previous and updated metrics for category sample derivation
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:159:22
 
     // Also feed multi-session store if available
     if (updateMultiSessionMetrics) {
-      if (sessionId) {
-        const label = extractSessionLabel(payload);
-        // Capture previous and updated metrics for category sample derivation
-        let previousMetrics: SessionMetrics | undefined;
-        let updatedMetrics: SessionMetrics | undefined;
-
-        updateMultiSessionMetrics(sessionId, label, (previous: SessionMetrics): SessionMetrics => {
-          previousMetrics = previous;
-          const next = aggregateEvent(previous, event, pricingTable, isOtelActive);
-          updatedMetrics = next;
-          return next;
-        });
-
-        // Append per-category samples after metrics update
-        if (appendSessionSample && previousMetrics && updatedMetrics) {
-          const samples = deriveCategorySamples(previousMetrics, updatedMetrics);
-          appendSessionSample(sessionId, samples);
-        }
-      }
+      if (sessionId) {}
     }
   };
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:165:99
         let previousMetrics: SessionMetrics | undefined;
         let updatedMetrics: SessionMetrics | undefined;
 
-        updateMultiSessionMetrics(sessionId, label, (previous: SessionMetrics): SessionMetrics => {
-          previousMetrics = previous;
-          const next = aggregateEvent(previous, event, pricingTable, isOtelActive);
-          updatedMetrics = next;
-          return next;
-        });
+        updateMultiSessionMetrics(sessionId, label, (previous: SessionMetrics): SessionMetrics => {});
 
         // Append per-category samples after metrics update
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/plugins/norbert-usage/hookProcessor.ts:173:13
         });
 
         // Append per-category samples after metrics update
-        if (appendSessionSample && previousMetrics && updatedMetrics) {
+        if (false) {
           const samples = deriveCategorySamples(previousMetrics, updatedMetrics);
           appendSessionSample(sessionId, samples);
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/plugins/norbert-usage/hookProcessor.ts:173:71
         });
 
         // Append per-category samples after metrics update
-        if (appendSessionSample && previousMetrics && updatedMetrics) {
-          const samples = deriveCategorySamples(previousMetrics, updatedMetrics);
-          appendSessionSample(sessionId, samples);
-        }
+        if (appendSessionSample && previousMetrics && updatedMetrics) {}
       }
     }
killedBy: Hook processor feeds per-category samples after metrics update Token rate sample derived from instantaneous rate on event
statusReason: expected 0 to be greater than or equal to 1
