[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:31:20
 // ---------------------------------------------------------------------------
 
 /** Format a number as dollars with two decimal places. */
-const formatCost = (cost: number): string => `$${cost.toFixed(2)}`;
+const formatCost = () => undefined;
 
 /** Format a number with comma separators (e.g. 112400 -> "112,400"). */
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: $2.30. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:31:46
 // ---------------------------------------------------------------------------
 
 /** Format a number as dollars with two decimal places. */
-const formatCost = (cost: number): string => `$${cost.toFixed(2)}`;
+const formatCost = (cost: number): string => ``;
 
 /** Format a number with comma separators (e.g. 112400 -> "112,400"). */
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: $2.30. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:34:26
 const formatCost = (cost: number): string => `$${cost.toFixed(2)}`;
 
 /** Format a number with comma separators (e.g. 112400 -> "112,400"). */
-const formatWithCommas = (n: number): string => n.toLocaleString("en-US");
+const formatWithCommas = () => undefined;
 
 /** Format tokens as "Xk" (rounded to nearest thousand). */
killedBy: Token Count card formatting formats total tokens with comma separator
statusReason: expected undefined to be '112,400' // Object.is equality

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:34:66
 const formatCost = (cost: number): string => `$${cost.toFixed(2)}`;
 
 /** Format a number with comma separators (e.g. 112400 -> "112,400"). */
-const formatWithCommas = (n: number): string => n.toLocaleString("en-US");
+const formatWithCommas = (n: number): string => n.toLocaleString("");
 
 /** Format tokens as "Xk" (rounded to nearest thousand). */
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Incorrect locale information provided

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:37:23
 const formatWithCommas = (n: number): string => n.toLocaleString("en-US");
 
 /** Format tokens as "Xk" (rounded to nearest thousand). */
-const formatTokensK = (tokens: number): string => `${Math.round(tokens / 1000)}k`;
+const formatTokensK = () => undefined;
 
 /** Build token breakdown subtitle: "62k in / 50k out". */
killedBy: Token Count card formatting shows input/output breakdown in subtitle as Xk in / Xk out
statusReason: expected 'undefined in / undefined out' to contain '62k in'

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/dashboard.ts:37:65
 const formatWithCommas = (n: number): string => n.toLocaleString("en-US");
 
 /** Format tokens as "Xk" (rounded to nearest thousand). */
-const formatTokensK = (tokens: number): string => `${Math.round(tokens / 1000)}k`;
+const formatTokensK = (tokens: number): string => `${Math.round(tokens * 1000)}k`;
 
 /** Build token breakdown subtitle: "62k in / 50k out". */
killedBy: Token Count card formatting shows input/output breakdown in subtitle as Xk in / Xk out
statusReason: expected '62000000k in / 50400000k out' to contain '62k in'

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:40:29
 const formatTokensK = (tokens: number): string => `${Math.round(tokens / 1000)}k`;
 
 /** Build token breakdown subtitle: "62k in / 50k out". */
-const formatTokenSubtitle = (inputTokens: number, outputTokens: number): string =>
-  `${formatTokensK(inputTokens)} in / ${formatTokensK(outputTokens)} out`;
+const formatTokenSubtitle = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: User opens Usage Dashboard and sees session health at a glance dashboard shows all 6 metric cards with current session values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:41:3
 
 /** Build token breakdown subtitle: "62k in / 50k out". */
 const formatTokenSubtitle = (inputTokens: number, outputTokens: number): string =>
-  `${formatTokensK(inputTokens)} in / ${formatTokensK(outputTokens)} out`;
+  ``;
 
 // ---------------------------------------------------------------------------
killedBy: Token Count card formatting shows input/output breakdown in subtitle as Xk in / Xk out
statusReason: expected '' to contain '62k in'

[Killed] BlockStatement
plugins/norbert-usage/domain/dashboard.ts:48:56
 // ---------------------------------------------------------------------------
 
 /** Determine context window urgency from utilization percentage. */
-const contextWindowUrgency = (pct: number): Urgency => {
-  if (pct >= 90) return "red";
-  if (pct >= 70) return "amber";
-  return "normal";
-};
+const contextWindowUrgency = (pct: number): Urgency => {};
 
 // ---------------------------------------------------------------------------
killedBy: UsageDashboardView applies urgency CSS classes applies red urgency class to context window card at 90%
statusReason: expect(element).toHaveClass("metric-card-urgency-red")

Expected the element to have class:
  metric-card-urgency-red
Received:
  metric-card metric-card-urgency-normal

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:49:7
 
 /** Determine context window urgency from utilization percentage. */
 const contextWindowUrgency = (pct: number): Urgency => {
-  if (pct >= 90) return "red";
+  if (pct > 90) return "red";
   if (pct >= 70) return "amber";
   return "normal";
killedBy: UsageDashboardView applies urgency CSS classes applies red urgency class to context window card at 90%
statusReason: expect(element).toHaveClass("metric-card-urgency-red")

Expected the element to have class:
  metric-card-urgency-red
Received:
  metric-card metric-card-urgency-amber

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:49:7
 
 /** Determine context window urgency from utilization percentage. */
 const contextWindowUrgency = (pct: number): Urgency => {
-  if (pct >= 90) return "red";
+  if (false) return "red";
   if (pct >= 70) return "amber";
   return "normal";
killedBy: UsageDashboardView applies urgency CSS classes applies red urgency class to context window card at 90%
statusReason: expect(element).toHaveClass("metric-card-urgency-red")

Expected the element to have class:
  metric-card-urgency-red
Received:
  metric-card metric-card-urgency-amber

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:50:7
 /** Determine context window urgency from utilization percentage. */
 const contextWindowUrgency = (pct: number): Urgency => {
   if (pct >= 90) return "red";
-  if (pct >= 70) return "amber";
+  if (pct < 70) return "amber";
   return "normal";
 };
killedBy: Context Window card urgency shows normal urgency below 70%
statusReason: expected 'amber' to be 'normal' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:50:7
 /** Determine context window urgency from utilization percentage. */
 const contextWindowUrgency = (pct: number): Urgency => {
   if (pct >= 90) return "red";
-  if (pct >= 70) return "amber";
+  if (false) return "amber";
   return "normal";
 };
killedBy: Context Window card urgency shows amber urgency at 70%
statusReason: expected 'normal' to be 'amber' // Object.is equality

[Killed] BlockStatement
plugins/norbert-usage/domain/dashboard.ts:59:66
 // ---------------------------------------------------------------------------
 
 /** Derive a display label from the session ID. */
-export const deriveSessionLabel = (sessionId: string): string => {
-  if (sessionId === "" || sessionId === "default") return "";
-  return sessionId.length > 20 ? sessionId.slice(0, 17) + "..." : sessionId;
-};
+export const deriveSessionLabel = (sessionId: string): string => {};
 
 /** A session is onboarding when all activity metrics are zero. */
killedBy: Session label contains session ID when non-default
statusReason: expected undefined to be 'refactor-auth' // Object.is equality

[Killed] LogicalOperator
plugins/norbert-usage/domain/dashboard.ts:60:7
 
 /** Derive a display label from the session ID. */
 export const deriveSessionLabel = (sessionId: string): string => {
-  if (sessionId === "" || sessionId === "default") return "";
+  if (sessionId === "" && sessionId === "default") return "";
   return sessionId.length > 20 ? sessionId.slice(0, 17) + "..." : sessionId;
 };
killedBy: Session label is empty for 'default' session ID
statusReason: expected 'default' to be '' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:60:27
 
 /** Derive a display label from the session ID. */
 export const deriveSessionLabel = (sessionId: string): string => {
-  if (sessionId === "" || sessionId === "default") return "";
+  if (sessionId === "" || false) return "";
   return sessionId.length > 20 ? sessionId.slice(0, 17) + "..." : sessionId;
 };
killedBy: Session label is empty for 'default' session ID
statusReason: expected 'default' to be '' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:61:10
 /** Derive a display label from the session ID. */
 export const deriveSessionLabel = (sessionId: string): string => {
   if (sessionId === "" || sessionId === "default") return "";
-  return sessionId.length > 20 ? sessionId.slice(0, 17) + "..." : sessionId;
+  return false ? sessionId.slice(0, 17) + "..." : sessionId;
 };
 
killedBy: Session label truncates long IDs with ellipsis
statusReason: expected 'this-is-a-very-long-session-identifie…' to have a length of 20 but got 63

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:61:10
 /** Derive a display label from the session ID. */
 export const deriveSessionLabel = (sessionId: string): string => {
   if (sessionId === "" || sessionId === "default") return "";
-  return sessionId.length > 20 ? sessionId.slice(0, 17) + "..." : sessionId;
+  return true ? sessionId.slice(0, 17) + "..." : sessionId;
 };
 
killedBy: Session label contains session ID when non-default
statusReason: expected 'refactor-auth...' to be 'refactor-auth' // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:65:29
 };
 
 /** A session is onboarding when all activity metrics are zero. */
-const isOnboardingSession = (metrics: SessionMetrics): boolean =>
-  metrics.totalTokens === 0 &&
-  metrics.sessionCost === 0 &&
-  metrics.toolCallCount === 0 &&
-  metrics.activeAgentCount === 0 &&
-  metrics.totalEventCount === 0;
+const isOnboardingSession = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: Onboarding detection isOnboarding is true when all metrics are zero
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
plugins/norbert-usage/domain/dashboard.ts:66:3
 
 /** A session is onboarding when all activity metrics are zero. */
 const isOnboardingSession = (metrics: SessionMetrics): boolean =>
-  metrics.totalTokens === 0 &&
-  metrics.sessionCost === 0 &&
-  metrics.toolCallCount === 0 &&
-  metrics.activeAgentCount === 0 &&
-  metrics.totalEventCount === 0;
+  metrics.totalTokens === 0 && metrics.sessionCost === 0 && metrics.toolCallCount === 0 && metrics.activeAgentCount === 0 || metrics.totalEventCount === 0;
 
 // ---------------------------------------------------------------------------
killedBy: Onboarding detection isOnboarding is false when session has activity
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
plugins/norbert-usage/domain/dashboard.ts:66:3
 
 /** A session is onboarding when all activity metrics are zero. */
 const isOnboardingSession = (metrics: SessionMetrics): boolean =>
-  metrics.totalTokens === 0 &&
-  metrics.sessionCost === 0 &&
-  metrics.toolCallCount === 0 &&
+  metrics.totalTokens === 0 && metrics.sessionCost === 0 || metrics.toolCallCount === 0 &&
   metrics.activeAgentCount === 0 &&
   metrics.totalEventCount === 0;
killedBy: Onboarding detection isOnboarding is false when session has activity
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:67:3
 /** A session is onboarding when all activity metrics are zero. */
 const isOnboardingSession = (metrics: SessionMetrics): boolean =>
   metrics.totalTokens === 0 &&
-  metrics.sessionCost === 0 &&
+  metrics.sessionCost !== 0 &&
   metrics.toolCallCount === 0 &&
   metrics.activeAgentCount === 0 &&
killedBy: UsageDashboardView shows onboarding state shows onboarding message when isOnboarding is true and no daily costs
statusReason: Unable to find an element with the text: /start a coding session/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Survived] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:67:3
 /** A session is onboarding when all activity metrics are zero. */
 const isOnboardingSession = (metrics: SessionMetrics): boolean =>
   metrics.totalTokens === 0 &&
-  metrics.sessionCost === 0 &&
+  true &&
   metrics.toolCallCount === 0 &&
   metrics.activeAgentCount === 0 &&

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:68:3
 const isOnboardingSession = (metrics: SessionMetrics): boolean =>
   metrics.totalTokens === 0 &&
   metrics.sessionCost === 0 &&
-  metrics.toolCallCount === 0 &&
+  metrics.toolCallCount !== 0 &&
   metrics.activeAgentCount === 0 &&
   metrics.totalEventCount === 0;
killedBy: UsageDashboardView shows onboarding state shows onboarding message when isOnboarding is true and no daily costs
statusReason: Unable to find an element with the text: /start a coding session/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Survived] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:68:3
 const isOnboardingSession = (metrics: SessionMetrics): boolean =>
   metrics.totalTokens === 0 &&
   metrics.sessionCost === 0 &&
-  metrics.toolCallCount === 0 &&
+  true &&
   metrics.activeAgentCount === 0 &&
   metrics.totalEventCount === 0;

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:69:3
   metrics.totalTokens === 0 &&
   metrics.sessionCost === 0 &&
   metrics.toolCallCount === 0 &&
-  metrics.activeAgentCount === 0 &&
+  metrics.activeAgentCount !== 0 &&
   metrics.totalEventCount === 0;
 
killedBy: Onboarding detection isOnboarding is true when all metrics are zero
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:69:3
   metrics.totalTokens === 0 &&
   metrics.sessionCost === 0 &&
   metrics.toolCallCount === 0 &&
-  metrics.activeAgentCount === 0 &&
+  true &&
   metrics.totalEventCount === 0;
 

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:70:3
   metrics.sessionCost === 0 &&
   metrics.toolCallCount === 0 &&
   metrics.activeAgentCount === 0 &&
-  metrics.totalEventCount === 0;
+  metrics.totalEventCount !== 0;
 
 // ---------------------------------------------------------------------------
killedBy: UsageDashboardView shows onboarding state shows onboarding message when isOnboarding is true and no daily costs
statusReason: Unable to find an element with the text: /start a coding session/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Survived] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:70:3
   metrics.sessionCost === 0 &&
   metrics.toolCallCount === 0 &&
   metrics.activeAgentCount === 0 &&
-  metrics.totalEventCount === 0;
+  true;
 
 // ---------------------------------------------------------------------------

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:76:30
 // Card builders (pure)
 // ---------------------------------------------------------------------------
 
-const buildRunningCostCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Running Cost",
-  value: formatCost(metrics.sessionCost),
-  subtitle: "",
-  urgency: "normal",
-});
+const buildRunningCostCard = () => undefined;
 
 const buildTokenCountCard = (metrics: SessionMetrics): MetricCardData => ({
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Cannot read properties of undefined (reading 'urgency')

[Survived] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:80:12
   label: "Running Cost",
   value: formatCost(metrics.sessionCost),
   subtitle: "",
-  urgency: "normal",
+  urgency: "",
 });
 

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:83:29
   urgency: "normal",
 });
 
-const buildTokenCountCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Token Count",
-  value: formatWithCommas(metrics.totalTokens),
-  subtitle: metrics.totalTokens > 0
-    ? formatTokenSubtitle(metrics.inputTokens, metrics.outputTokens)
-    : "",
-  urgency: "normal",
-});
+const buildTokenCountCard = () => undefined;
 
 const buildActiveAgentsCard = (metrics: SessionMetrics): MetricCardData => ({
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Cannot read properties of undefined (reading 'urgency')

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:84:10
 });
 
 const buildTokenCountCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Token Count",
+  label: "",
   value: formatWithCommas(metrics.totalTokens),
   subtitle: metrics.totalTokens > 0
killedBy: Token Count card formatting formats total tokens with comma separator
statusReason: expected '' to be 'Token Count' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:86:13
 const buildTokenCountCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Token Count",
   value: formatWithCommas(metrics.totalTokens),
-  subtitle: metrics.totalTokens > 0
+  subtitle: metrics.totalTokens <= 0
     ? formatTokenSubtitle(metrics.inputTokens, metrics.outputTokens)
     : "",
killedBy: Token Count card formatting shows input/output breakdown in subtitle as Xk in / Xk out
statusReason: expected '' to contain '62k in'

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:86:13
 const buildTokenCountCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Token Count",
   value: formatWithCommas(metrics.totalTokens),
-  subtitle: metrics.totalTokens > 0
+  subtitle: false
     ? formatTokenSubtitle(metrics.inputTokens, metrics.outputTokens)
     : "",
killedBy: Token Count card formatting shows input/output breakdown in subtitle as Xk in / Xk out
statusReason: expected '' to contain '62k in'

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:92:31
   urgency: "normal",
 });
 
-const buildActiveAgentsCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Active Agents",
-  value: String(metrics.activeAgentCount),
-  subtitle: "",
-  urgency: "normal",
-});
+const buildActiveAgentsCard = () => undefined;
 
 const buildToolCallsCard = (metrics: SessionMetrics): MetricCardData => ({
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Cannot read properties of undefined (reading 'urgency')

[Survived] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:95:13
 const buildActiveAgentsCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Active Agents",
   value: String(metrics.activeAgentCount),
-  subtitle: "",
+  subtitle: "Stryker was here!",
   urgency: "normal",
 });

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:99:28
   urgency: "normal",
 });
 
-const buildToolCallsCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Tool Calls",
-  value: String(metrics.toolCallCount),
-  subtitle: "",
-  urgency: "normal",
-});
+const buildToolCallsCard = () => undefined;
 
 const buildContextWindowCard = (metrics: SessionMetrics): MetricCardData => ({
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Cannot read properties of undefined (reading 'urgency')

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:100:10
 });
 
 const buildToolCallsCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Tool Calls",
+  label: "",
   value: String(metrics.toolCallCount),
   subtitle: "",
killedBy: Tool Calls card shows tool call count as string
statusReason: expected '' to be 'Tool Calls' // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:106:32
   urgency: "normal",
 });
 
-const buildContextWindowCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Context Window",
-  value: `${metrics.contextWindowPct}%`,
-  subtitle: "",
-  urgency: contextWindowUrgency(metrics.contextWindowPct),
-});
+const buildContextWindowCard = () => undefined;
 
 const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Cannot read properties of undefined (reading 'urgency')

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:108:10
 
 const buildContextWindowCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Context Window",
-  value: `${metrics.contextWindowPct}%`,
+  value: ``,
   subtitle: "",
   urgency: contextWindowUrgency(metrics.contextWindowPct),
killedBy: Context Window card urgency shows normal urgency below 70%
statusReason: expected '' to be '50%' // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:113:29
   urgency: contextWindowUrgency(metrics.contextWindowPct),
 });
 
-const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Data Health",
-  value: metrics.totalEventCount > 0 ? "OK" : "No Events",
-  subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
-  urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
-});
+const buildDataHealthCard = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: Data Health card shows OK with normal urgency when events are flowing
statusReason: Cannot read properties of undefined (reading 'label')

[Killed] ObjectLiteral
plugins/norbert-usage/domain/dashboard.ts:113:75
   urgency: contextWindowUrgency(metrics.contextWindowPct),
 });
 
-const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Data Health",
-  value: metrics.totalEventCount > 0 ? "OK" : "No Events",
-  subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
-  urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
-});
+const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({});
 
 // ---------------------------------------------------------------------------
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: Data Health. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] StringLiteral
plugins/norbert-usage/domain/dashboard.ts:114:10
 });
 
 const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
-  label: "Data Health",
+  label: "",
   value: metrics.totalEventCount > 0 ? "OK" : "No Events",
   subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
killedBy: Data Health card shows OK with normal urgency when events are flowing
statusReason: expected '' to be 'Data Health' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:115:10
 
 const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Data Health",
-  value: metrics.totalEventCount > 0 ? "OK" : "No Events",
+  value: false ? "OK" : "No Events",
   subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
   urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: OK. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:115:10
 
 const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Data Health",
-  value: metrics.totalEventCount > 0 ? "OK" : "No Events",
+  value: metrics.totalEventCount <= 0 ? "OK" : "No Events",
   subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
   urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Unable to find an element with the text: OK. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Usage Dashboard"
      class="usage-dashboard"

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:116:13
 const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Data Health",
   value: metrics.totalEventCount > 0 ? "OK" : "No Events",
-  subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
+  subtitle: metrics.totalEventCount >= 0 ? `${metrics.totalEventCount} events` : "",
   urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
 });
killedBy: Data Health card shows 'No Events' with amber urgency when totalEventCount is 0
statusReason: expected '0 events' to be '' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:116:13
 const buildDataHealthCard = (metrics: SessionMetrics): MetricCardData => ({
   label: "Data Health",
   value: metrics.totalEventCount > 0 ? "OK" : "No Events",
-  subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
+  subtitle: false ? `${metrics.totalEventCount} events` : "",
   urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
 });
killedBy: Data Health card shows OK with normal urgency when events are flowing
statusReason: expected '' to be '200 events' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/dashboard.ts:117:12
   label: "Data Health",
   value: metrics.totalEventCount > 0 ? "OK" : "No Events",
   subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
-  urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
+  urgency: metrics.totalEventCount >= 0 ? "normal" : "amber",
 });
 
killedBy: Data Health card shows 'No Events' with amber urgency when totalEventCount is 0
statusReason: expected 'normal' to be 'amber' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/dashboard.ts:117:12
   label: "Data Health",
   value: metrics.totalEventCount > 0 ? "OK" : "No Events",
   subtitle: metrics.totalEventCount > 0 ? `${metrics.totalEventCount} events` : "",
-  urgency: metrics.totalEventCount > 0 ? "normal" : "amber",
+  urgency: false ? "normal" : "amber",
 });
 
killedBy: Data Health card shows OK with normal urgency when events are flowing
statusReason: expected 'amber' to be 'normal' // Object.is equality
