[Killed] ArrowFunction
plugins/norbert-usage/domain/dashboard.ts:130:37
  * Pure function: SessionMetrics => DashboardData.
  * Each metric card is built by a small, focused helper.
  */
-export const computeDashboardData = (metrics: SessionMetrics): DashboardData => ({
-  runningCost: buildRunningCostCard(metrics),
-  tokenCount: buildTokenCountCard(metrics),
-  activeAgents: buildActiveAgentsCard(metrics),
-  toolCalls: buildToolCallsCard(metrics),
-  contextWindow: buildContextWindowCard(metrics),
-  dataHealth: buildDataHealthCard(metrics),
-  isOnboarding: isOnboardingSession(metrics),
-  sessionLabel: deriveSessionLabel(metrics.sessionId),
-});
+export const computeDashboardData = () => undefined;
 
 
killedBy: Running Cost card formatting formats cost to two decimal places with dollar sign
statusReason: Cannot read properties of undefined (reading 'runningCost')

[Killed] ObjectLiteral
plugins/norbert-usage/domain/dashboard.ts:130:82
  * Pure function: SessionMetrics => DashboardData.
  * Each metric card is built by a small, focused helper.
  */
-export const computeDashboardData = (metrics: SessionMetrics): DashboardData => ({
-  runningCost: buildRunningCostCard(metrics),
-  tokenCount: buildTokenCountCard(metrics),
-  activeAgents: buildActiveAgentsCard(metrics),
-  toolCalls: buildToolCallsCard(metrics),
-  contextWindow: buildContextWindowCard(metrics),
-  dataHealth: buildDataHealthCard(metrics),
-  isOnboarding: isOnboardingSession(metrics),
-  sessionLabel: deriveSessionLabel(metrics.sessionId),
-});
+export const computeDashboardData = (metrics: SessionMetrics): DashboardData => ({});
 
 
killedBy: UsageDashboardView renders 6 metric cards displays all 6 metric card labels with computed values
statusReason: Cannot read properties of undefined (reading 'urgency')
