[Killed] ArrowFunction
plugins/norbert-usage/domain/gaugeCluster.ts:61:25
 // Instrument builders (small pure functions)
 // ---------------------------------------------------------------------------
 
-const buildTachometer = (
-  burnRate: number,
-  thresholds: UrgencyThresholds,
-): TachometerData => ({
-  value: burnRate,
-  unit: "tok/s",
-  urgency: classifyTokenRateUrgency(burnRate, thresholds),
-});
+const buildTachometer = () => undefined;
 
 /** Format context token usage as "Xk / Yk tokens", or "" when unknown. */
killedBy: Tachometer urgency zones is normal when burnRate < 400
statusReason: Property failed after 1 tests
{ seed: 843401748, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
plugins/norbert-usage/domain/gaugeCluster.ts:71:82
 });
 
 /** Format context token usage as "Xk / Yk tokens", or "" when unknown. */
-export const formatContextTokenLabel = (current: number, max: number): string => {
-  if (max === 0) return "";
-  const currentK = Math.round(current / 1000);
-  const maxK = Math.round(max / 1000);
-  return `${currentK}k / ${maxK}k tokens`;
-};
+export const formatContextTokenLabel = (current: number, max: number): string => {};
 
 const buildFuelGauge = (
killedBy: Fuel gauge token label shows 'Xk / Yk tokens' when maxTokens > 0
statusReason: expected undefined to be '50k / 200k tokens' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:72:7
 
 /** Format context token usage as "Xk / Yk tokens", or "" when unknown. */
 export const formatContextTokenLabel = (current: number, max: number): string => {
-  if (max === 0) return "";
+  if (true) return "";
   const currentK = Math.round(current / 1000);
   const maxK = Math.round(max / 1000);
killedBy: Fuel gauge token label shows 'Xk / Yk tokens' when maxTokens > 0
statusReason: expected '' to be '50k / 200k tokens' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/gaugeCluster.ts:72:7
 
 /** Format context token usage as "Xk / Yk tokens", or "" when unknown. */
 export const formatContextTokenLabel = (current: number, max: number): string => {
-  if (max === 0) return "";
+  if (max !== 0) return "";
   const currentK = Math.round(current / 1000);
   const maxK = Math.round(max / 1000);
killedBy: Fuel gauge token label shows 'Xk / Yk tokens' when maxTokens > 0
statusReason: expected '' to be '50k / 200k tokens' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/gaugeCluster.ts:73:31
 /** Format context token usage as "Xk / Yk tokens", or "" when unknown. */
 export const formatContextTokenLabel = (current: number, max: number): string => {
   if (max === 0) return "";
-  const currentK = Math.round(current / 1000);
+  const currentK = Math.round(current * 1000);
   const maxK = Math.round(max / 1000);
   return `${currentK}k / ${maxK}k tokens`;
killedBy: Fuel gauge token label shows 'Xk / Yk tokens' when maxTokens > 0
statusReason: expected '50000000k / 200k tokens' to be '50k / 200k tokens' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/gaugeCluster.ts:74:27
 export const formatContextTokenLabel = (current: number, max: number): string => {
   if (max === 0) return "";
   const currentK = Math.round(current / 1000);
-  const maxK = Math.round(max / 1000);
+  const maxK = Math.round(max * 1000);
   return `${currentK}k / ${maxK}k tokens`;
 };
killedBy: Fuel gauge token label shows 'Xk / Yk tokens' when maxTokens > 0
statusReason: expected '50k / 200000000k tokens' to be '50k / 200k tokens' // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/gaugeCluster.ts:78:24
   return `${currentK}k / ${maxK}k tokens`;
 };
 
-const buildFuelGauge = (
-  contextWindowPct: number,
-  contextWindowTokens: number,
-  contextWindowMaxTokens: number,
-  thresholds: UrgencyThresholds,
-): FuelGaugeData => ({
-  value: contextWindowPct,
-  unit: "%",
-  urgency: classifyContextUrgency(contextWindowPct, thresholds),
-  tokenLabel: formatContextTokenLabel(contextWindowTokens, contextWindowMaxTokens),
-});
+const buildFuelGauge = () => undefined;
 
 const buildOdometer = (sessionCost: number): OdometerData => ({
killedBy: Fuel gauge urgency zones is normal when contextWindowPct < 70
statusReason: Property failed after 1 tests
{ seed: 979621072, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/gaugeCluster.ts:90:23
   tokenLabel: formatContextTokenLabel(contextWindowTokens, contextWindowMaxTokens),
 });
 
-const buildOdometer = (sessionCost: number): OdometerData => ({
-  value: sessionCost,
-  formatted: `$${sessionCost.toFixed(2)}`,
-});
+const buildOdometer = () => undefined;
 
 const buildRpmCounter = (activeAgentCount: number): RpmCounterData => ({
killedBy: Gauge values are passed through from metrics all numeric gauge values are non-negative
statusReason: Property failed after 1 tests
{ seed: 263276916, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/gaugeCluster.ts:95:25
   formatted: `$${sessionCost.toFixed(2)}`,
 });
 
-const buildRpmCounter = (activeAgentCount: number): RpmCounterData => ({
-  value: activeAgentCount,
-  label: "agents",
-});
+const buildRpmCounter = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: Gauge values are passed through from metrics all numeric gauge values are non-negative
statusReason: Property failed after 1 tests
{ seed: -271995226, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
plugins/norbert-usage/domain/gaugeCluster.ts:115:26
   lastEventAt: string,
   now: Date,
   stalenessThresholdMs: number = DEFAULT_STALENESS_THRESHOLD_MS,
-): WarningClusterData => {
-  if (totalEventCount === 0) return { dataHealth: "no-data" };
-  const lastEventMs = new Date(lastEventAt).getTime();
-  const elapsedMs = now.getTime() - lastEventMs;
-  return { dataHealth: elapsedMs <= stalenessThresholdMs ? "healthy" : "degraded" };
-};
+): WarningClusterData => {};
 
 // ---------------------------------------------------------------------------
killedBy: Walking Skeleton: operator sees healthy data pipeline data health shows healthy when OTel events are flowing recently
statusReason: Cannot read properties of undefined (reading 'dataHealth')

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:116:7
   now: Date,
   stalenessThresholdMs: number = DEFAULT_STALENESS_THRESHOLD_MS,
 ): WarningClusterData => {
-  if (totalEventCount === 0) return { dataHealth: "no-data" };
+  if (true) return { dataHealth: "no-data" };
   const lastEventMs = new Date(lastEventAt).getTime();
   const elapsedMs = now.getTime() - lastEventMs;
killedBy: Warning cluster data health reports healthy when events are flowing and recent
statusReason: expected 'no-data' to be 'healthy' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:116:7
   now: Date,
   stalenessThresholdMs: number = DEFAULT_STALENESS_THRESHOLD_MS,
 ): WarningClusterData => {
-  if (totalEventCount === 0) return { dataHealth: "no-data" };
+  if (false) return { dataHealth: "no-data" };
   const lastEventMs = new Date(lastEventAt).getTime();
   const elapsedMs = now.getTime() - lastEventMs;
killedBy: Warning cluster data health reports no-data when totalEventCount is 0
statusReason: expected 'degraded' to be 'no-data' // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/gaugeCluster.ts:118:21
 ): WarningClusterData => {
   if (totalEventCount === 0) return { dataHealth: "no-data" };
   const lastEventMs = new Date(lastEventAt).getTime();
-  const elapsedMs = now.getTime() - lastEventMs;
+  const elapsedMs = now.getTime() + lastEventMs;
   return { dataHealth: elapsedMs <= stalenessThresholdMs ? "healthy" : "degraded" };
 };
killedBy: Warning cluster data health reports healthy when events are flowing and recent
statusReason: expected 'degraded' to be 'healthy' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:119:24
   if (totalEventCount === 0) return { dataHealth: "no-data" };
   const lastEventMs = new Date(lastEventAt).getTime();
   const elapsedMs = now.getTime() - lastEventMs;
-  return { dataHealth: elapsedMs <= stalenessThresholdMs ? "healthy" : "degraded" };
+  return { dataHealth: true ? "healthy" : "degraded" };
 };
 
killedBy: US-OFM-04: Source-agnostic data health indicator data health considers total event count and recency degraded when events are stale
statusReason: expected 'healthy' to be 'degraded' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/gaugeCluster.ts:119:24
   if (totalEventCount === 0) return { dataHealth: "no-data" };
   const lastEventMs = new Date(lastEventAt).getTime();
   const elapsedMs = now.getTime() - lastEventMs;
-  return { dataHealth: elapsedMs <= stalenessThresholdMs ? "healthy" : "degraded" };
+  return { dataHealth: false ? "healthy" : "degraded" };
 };
 
killedBy: Warning cluster data health reports healthy when events are flowing and recent
statusReason: expected 'degraded' to be 'healthy' // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/gaugeCluster.ts:132:40
  * Pure function: SessionMetrics => GaugeClusterData.
  * No side effects. All instrument values derived from input metrics.
  */
-export const computeGaugeClusterData = (
-  metrics: SessionMetrics,
-  thresholds: UrgencyThresholds = DEFAULT_URGENCY_THRESHOLDS,
-  now: Date = new Date(),
-): GaugeClusterData => ({
-  tachometer: buildTachometer(metrics.burnRate, thresholds),
-  fuelGauge: buildFuelGauge(metrics.contextWindowPct, metrics.contextWindowTokens, metrics.contextWindowMaxTokens, thresholds),
-  odometer: buildOdometer(metrics.sessionCost),
-  rpmCounter: buildRpmCounter(metrics.activeAgentCount),
-  warningCluster: buildWarningCluster(metrics.totalEventCount, metrics.lastEventAt, now),
-});
+export const computeGaugeClusterData = () => undefined;
 
killedBy: Fuel gauge urgency zones is normal when contextWindowPct < 70
statusReason: Property failed after 1 tests
{ seed: -1639112200, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
plugins/norbert-usage/domain/gaugeCluster.ts:136:25
   metrics: SessionMetrics,
   thresholds: UrgencyThresholds = DEFAULT_URGENCY_THRESHOLDS,
   now: Date = new Date(),
-): GaugeClusterData => ({
-  tachometer: buildTachometer(metrics.burnRate, thresholds),
-  fuelGauge: buildFuelGauge(metrics.contextWindowPct, metrics.contextWindowTokens, metrics.contextWindowMaxTokens, thresholds),
-  odometer: buildOdometer(metrics.sessionCost),
-  rpmCounter: buildRpmCounter(metrics.activeAgentCount),
-  warningCluster: buildWarningCluster(metrics.totalEventCount, metrics.lastEventAt, now),
-});
+): GaugeClusterData => ({});
 
killedBy: Walking Skeleton: operator sees healthy data pipeline data health shows healthy when OTel events are flowing recently
statusReason: Cannot read properties of undefined (reading 'dataHealth')
