[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:27:37
 // ---------------------------------------------------------------------------
 
 /** Create zeroed SessionMetrics for a new session. */
-export const createInitialMetrics = (sessionId: string, sessionLabel = ""): SessionMetrics => ({
-  sessionId,
-  sessionLabel,
-  totalTokens: 0,
-  inputTokens: 0,
-  outputTokens: 0,
-  sessionCost: 0,
-  toolCallCount: 0,
-  activeAgentCount: 0,
-  contextWindowPct: 0,
-  contextWindowTokens: 0,
-  contextWindowMaxTokens: 0,
-  contextWindowModel: "",
-  totalEventCount: 0,
-  apiErrorCount: 0,
-  apiRequestCount: 0,
-  apiErrorRate: 0,
-  sessionStartedAt: "",
-  lastEventAt: "",
-  burnRate: 0,
-});
+export const createInitialMetrics = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: Fuel gauge urgency zones is normal when contextWindowPct < 70
statusReason: Property failed after 1 tests
{ seed: 1382438092, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:27:72
 // ---------------------------------------------------------------------------
 
 /** Create zeroed SessionMetrics for a new session. */
-export const createInitialMetrics = (sessionId: string, sessionLabel = ""): SessionMetrics => ({
+export const createInitialMetrics = (sessionId: string, sessionLabel = "Stryker was here!"): SessionMetrics => ({
   sessionId,
   sessionLabel,
killedBy: createInitialMetrics produces zeroed metrics with the given session id
statusReason: Property failed after 1 tests
{ seed: -409721430, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:58:22
   metrics: SessionMetrics,
   payload: unknown,
   pricingTable: PricingTable,
-): SessionMetrics => {
-  const extraction = extractTokenUsage(payload);
-  if (extraction.tag === "absent") return metrics;
-
-  const { usage } = extraction;
-  const cost = calculateCost(usage, pricingTable);
-
-  return {
-    ...metrics,
-    totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
-    inputTokens: metrics.inputTokens + usage.inputTokens,
-    outputTokens: metrics.outputTokens + usage.outputTokens,
-    sessionCost: Math.max(0, metrics.sessionCost + cost.totalCost),
-  };
-};
+): SessionMetrics => {};
 
 /** Extract cost_usd from payload.usage if present as a number (including 0.0). */
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -1159270999, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
plugins/norbert-usage/domain/metricsAggregator.ts:60:7
   pricingTable: PricingTable,
 ): SessionMetrics => {
   const extraction = extractTokenUsage(payload);
-  if (extraction.tag === "absent") return metrics;
+  if (extraction.tag !== "absent") return metrics;
 
   const { usage } = extraction;
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: 1407821255, path: "0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:60:7
   pricingTable: PricingTable,
 ): SessionMetrics => {
   const extraction = extractTokenUsage(payload);
-  if (extraction.tag === "absent") return metrics;
+  if (true) return metrics;
 
   const { usage } = extraction;
killedBy: US-OFM-01: Cost single source of truth when OTel is not active, hook events contribute to cost as before hook-only session calculates cost via pricing model
statusReason: expected +0 to be close to 0.0165, received difference is 0.0165, but expected 0.00005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:67:18
 
   return {
     ...metrics,
-    totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
+    totalTokens: metrics.totalTokens - usage.inputTokens + usage.outputTokens,
     inputTokens: metrics.inputTokens + usage.inputTokens,
     outputTokens: metrics.outputTokens + usage.outputTokens,
killedBy: US-OFM-01: Cost single source of truth when OTel is not active, hook events contribute to cost as before hook-only session calculates cost via pricing model
statusReason: expected -700 to be 2300 // Object.is equality

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:67:18
 
   return {
     ...metrics,
-    totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
+    totalTokens: metrics.totalTokens + usage.inputTokens - usage.outputTokens,
     inputTokens: metrics.inputTokens + usage.inputTokens,
     outputTokens: metrics.outputTokens + usage.outputTokens,
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: 1053179064, path: "0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 23 time(s)

Hint: Enable verbose mode in order to have the list of all failing values e

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:68:18
   return {
     ...metrics,
     totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
-    inputTokens: metrics.inputTokens + usage.inputTokens,
+    inputTokens: metrics.inputTokens - usage.inputTokens,
     outputTokens: metrics.outputTokens + usage.outputTokens,
     sessionCost: Math.max(0, metrics.sessionCost + cost.totalCost),
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -2136130052, path: "0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":1,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 26 time(s)

Hint: Enable verbose mode in order to have the list of all failing v

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:69:19
     ...metrics,
     totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
     inputTokens: metrics.inputTokens + usage.inputTokens,
-    outputTokens: metrics.outputTokens + usage.outputTokens,
+    outputTokens: metrics.outputTokens - usage.outputTokens,
     sessionCost: Math.max(0, metrics.sessionCost + cost.totalCost),
   };
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -786380663, path: "0:0:0:1:0:0:0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the ru

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:70:30
     totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
     inputTokens: metrics.inputTokens + usage.inputTokens,
     outputTokens: metrics.outputTokens + usage.outputTokens,
-    sessionCost: Math.max(0, metrics.sessionCost + cost.totalCost),
+    sessionCost: Math.max(0, metrics.sessionCost - cost.totalCost),
   };
 };
killedBy: US-OFM-01: Cost single source of truth when OTel is not active, hook events contribute to cost as before hook-only session calculates cost via pricing model
statusReason: expected +0 to be close to 0.0165, received difference is 0.0165, but expected 0.00005

[Killed] MethodExpression
plugins/norbert-usage/domain/metricsAggregator.ts:70:18
     totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
     inputTokens: metrics.inputTokens + usage.inputTokens,
     outputTokens: metrics.outputTokens + usage.outputTokens,
-    sessionCost: Math.max(0, metrics.sessionCost + cost.totalCost),
+    sessionCost: Math.min(0, metrics.sessionCost + cost.totalCost),
   };
 };
killedBy: US-OFM-01: Cost single source of truth when OTel is not active, hook events contribute to cost as before hook-only session calculates cost via pricing model
statusReason: expected +0 to be close to 0.0165, received difference is 0.0165, but expected 0.00005

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:75:66
 };
 
 /** Extract cost_usd from payload.usage if present as a number (including 0.0). */
-const extractCostUsd = (payload: unknown): number | undefined => {
-  if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
-  const record = payload as Record<string, unknown>;
-  const usageField = record["usage"];
-  if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
-  const usage = usageField as Record<string, unknown>;
-  const costUsd = usage["cost_usd"];
-  return typeof costUsd === "number" && isFinite(costUsd) && costUsd >= 0 ? costUsd : undefined;
-};
+const extractCostUsd = (payload: unknown): number | undefined => {};
 
 /** Apply token and cost updates for api_request events (OTel).
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:76:7
 
 /** Extract cost_usd from payload.usage if present as a number (including 0.0). */
 const extractCostUsd = (payload: unknown): number | undefined => {
-  if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
+  if (true) return undefined;
   const record = payload as Record<string, unknown>;
   const usageField = record["usage"];
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/metricsAggregator.ts:76:38
 
 /** Extract cost_usd from payload.usage if present as a number (including 0.0). */
 const extractCostUsd = (payload: unknown): number | undefined => {
-  if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
+  if (typeof payload !== "object" || payload !== null || Array.isArray(payload)) return undefined;
   const record = payload as Record<string, unknown>;
   const usageField = record["usage"];
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] StringLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:78:29
 const extractCostUsd = (payload: unknown): number | undefined => {
   if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
   const record = payload as Record<string, unknown>;
-  const usageField = record["usage"];
+  const usageField = record[""];
   if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/metricsAggregator.ts:79:7
   if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
   const record = payload as Record<string, unknown>;
   const usageField = record["usage"];
-  if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
+  if (typeof usageField === "object" || usageField === null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
   const costUsd = usage["cost_usd"];
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/metricsAggregator.ts:79:41
   if (typeof payload !== "object" || payload === null || Array.isArray(payload)) return undefined;
   const record = payload as Record<string, unknown>;
   const usageField = record["usage"];
-  if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
+  if (typeof usageField !== "object" || usageField !== null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
   const costUsd = usage["cost_usd"];
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] StringLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:81:25
   const usageField = record["usage"];
   if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
-  const costUsd = usage["cost_usd"];
+  const costUsd = usage[""];
   return typeof costUsd === "number" && isFinite(costUsd) && costUsd >= 0 ? costUsd : undefined;
 };
killedBy: Walking Skeleton: operator sees accurate session cost when OTel is active pre-OTel cost preserved plus OTel cost_usd, hook token data excluded
statusReason: expected 1.20315 to be close to 3.6, received difference is 2.39685, but expected 0.005

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:82:10
   if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
   const costUsd = usage["cost_usd"];
-  return typeof costUsd === "number" && isFinite(costUsd) && costUsd >= 0 ? costUsd : undefined;
+  return true ? costUsd : undefined;
 };
 
killedBy: api_request with non-number cost_usd falls back to pricing model cost_usd as string falls back to pricing model calculation
statusReason: expected NaN to be close to 0.0105, received difference is NaN, but expected 5e-7

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:82:10
   if (typeof usageField !== "object" || usageField === null || Array.isArray(usageField)) return undefined;
   const usage = usageField as Record<string, unknown>;
   const costUsd = usage["cost_usd"];
-  return typeof costUsd === "number" && isFinite(costUsd) && costUsd >= 0 ? costUsd : undefined;
+  return true && costUsd >= 0 ? costUsd : undefined;
 };
 
killedBy: dual dispatch: isOtelActive selects handler table Infinity cost_usd falls back to pricing model
statusReason: expected Infinity to be close to 0.0105, received difference is Infinity, but expected 5e-7

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:91:22
   metrics: SessionMetrics,
   payload: unknown,
   pricingTable: PricingTable,
-): SessionMetrics => {
-  const extraction = extractTokenUsage(payload);
-  if (extraction.tag === "absent") return metrics;
-
-  const { usage } = extraction;
-  const costUsd = extractCostUsd(payload);
-  const cost = costUsd !== undefined ? costUsd : calculateCost(usage, pricingTable).totalCost;
-
-  return {
-    ...metrics,
-    totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
-    inputTokens: metrics.inputTokens + usage.inputTokens,
-    outputTokens: metrics.outputTokens + usage.outputTokens,
-    sessionCost: Math.max(0, metrics.sessionCost + cost),
-  };
-};
+): SessionMetrics => {};
 
 /** Increment tool call count. */
killedBy: Walking Skeleton: operator sees accurate session cost when OTel is active pre-OTel cost preserved plus OTel cost_usd, hook token data excluded
statusReason: Cannot read properties of undefined (reading 'sessionStartedAt')

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:93:7
   pricingTable: PricingTable,
 ): SessionMetrics => {
   const extraction = extractTokenUsage(payload);
-  if (extraction.tag === "absent") return metrics;
+  if (false) return metrics;
 
   const { usage } = extraction;
killedBy: api_request with malformed payload falls back gracefully non-object payload (string) produces no cost or token change
statusReason: Cannot read properties of undefined (reading 'model')

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:97:16
 
   const { usage } = extraction;
   const costUsd = extractCostUsd(payload);
-  const cost = costUsd !== undefined ? costUsd : calculateCost(usage, pricingTable).totalCost;
+  const cost = true ? costUsd : calculateCost(usage, pricingTable).totalCost;
 
   return {
killedBy: api_request without cost_usd falls back to pricing model session cost matches calculateCost result when cost_usd absent
statusReason: expected NaN to be close to 0.0105, received difference is NaN, but expected 5e-7

[Killed] EqualityOperator
plugins/norbert-usage/domain/metricsAggregator.ts:97:16
 
   const { usage } = extraction;
   const costUsd = extractCostUsd(payload);
-  const cost = costUsd !== undefined ? costUsd : calculateCost(usage, pricingTable).totalCost;
+  const cost = costUsd === undefined ? costUsd : calculateCost(usage, pricingTable).totalCost;
 
   return {
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected 0.43712999999999996 to be 0.042 // Object.is equality

[Killed] MethodExpression
plugins/norbert-usage/domain/metricsAggregator.ts:104:18
     totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
     inputTokens: metrics.inputTokens + usage.inputTokens,
     outputTokens: metrics.outputTokens + usage.outputTokens,
-    sessionCost: Math.max(0, metrics.sessionCost + cost),
+    sessionCost: Math.min(0, metrics.sessionCost + cost),
   };
 };
killedBy: Walking Skeleton: operator sees accurate session cost when OTel is active pre-OTel cost preserved plus OTel cost_usd, hook token data excluded
statusReason: expected +0 to be close to 3.6, received difference is 3.6, but expected 0.005

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:104:30
     totalTokens: metrics.totalTokens + usage.inputTokens + usage.outputTokens,
     inputTokens: metrics.inputTokens + usage.inputTokens,
     outputTokens: metrics.outputTokens + usage.outputTokens,
-    sessionCost: Math.max(0, metrics.sessionCost + cost),
+    sessionCost: Math.max(0, metrics.sessionCost - cost),
   };
 };
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected +0 to be 0.042 // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:109:28
 };
 
 /** Increment tool call count. */
-const applyToolCallStart = (metrics: SessionMetrics): SessionMetrics => ({
-  ...metrics,
-  toolCallCount: metrics.toolCallCount + 1,
-});
+const applyToolCallStart = () => undefined;
 
 /** Increment active agent count and set sessionStartedAt if first. */
killedBy: tool_call_start increments tool count without affecting cost tool count increments while cost and tokens remain unchanged
statusReason: Property failed after 1 tests
{ seed: -1548302323, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"tool_call_start","payload":{"tool":" "},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:111:18
 /** Increment tool call count. */
 const applyToolCallStart = (metrics: SessionMetrics): SessionMetrics => ({
   ...metrics,
-  toolCallCount: metrics.toolCallCount + 1,
+  toolCallCount: metrics.toolCallCount - 1,
 });
 
killedBy: US-OFM-01: Cost single source of truth when OTel is not active, hook events contribute to cost as before hook-only session counts tools from tool call start events
statusReason: expected -3 to be 3 // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:115:27
 });
 
 /** Increment active agent count and set sessionStartedAt if first. */
-const applySessionStart = (
-  metrics: SessionMetrics,
-  receivedAt: string,
-): SessionMetrics => ({
-  ...metrics,
-  activeAgentCount: metrics.activeAgentCount + 1,
-  sessionStartedAt: metrics.sessionStartedAt === "" ? receivedAt : metrics.sessionStartedAt,
-});
+const applySessionStart = () => undefined;
 
 /** Decrement active agent count, floored at 0. */
killedBy: session_start increments active agent count each session_start adds one to activeAgentCount
statusReason: Property failed after 1 tests
{ seed: 2051082394, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,{"eventType":"session_start","payload":{},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:120:21
   receivedAt: string,
 ): SessionMetrics => ({
   ...metrics,
-  activeAgentCount: metrics.activeAgentCount + 1,
+  activeAgentCount: metrics.activeAgentCount - 1,
   sessionStartedAt: metrics.sessionStartedAt === "" ? receivedAt : metrics.sessionStartedAt,
 });
killedBy: session_start increments active agent count each session_start adds one to activeAgentCount
statusReason: Property failed after 1 tests
{ seed: -973353066, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,{"eventType":"session_start","payload":{},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:121:21
 ): SessionMetrics => ({
   ...metrics,
   activeAgentCount: metrics.activeAgentCount + 1,
-  sessionStartedAt: metrics.sessionStartedAt === "" ? receivedAt : metrics.sessionStartedAt,
+  sessionStartedAt: false ? receivedAt : metrics.sessionStartedAt,
 });
 
killedBy: session_start increments active agent count sets sessionStartedAt on first session_start event
statusReason: expected '' not to be '' // Object.is equality

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:121:21
 ): SessionMetrics => ({
   ...metrics,
   activeAgentCount: metrics.activeAgentCount + 1,
-  sessionStartedAt: metrics.sessionStartedAt === "" ? receivedAt : metrics.sessionStartedAt,
+  sessionStartedAt: true ? receivedAt : metrics.sessionStartedAt,
 });
 
killedBy: US-OFM-05: OTel session timing preference when OTel is not active, session start hook sets the timestamp second session start does not overwrite the first timestamp
statusReason: expected '2026-03-27T10:00:15Z' to be '2026-03-27T10:00:05Z' // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:125:33
 });
 
 /** Decrement active agent count, floored at 0. */
-const applyAgentCompleteCount = (metrics: SessionMetrics): SessionMetrics => ({
-  ...metrics,
-  activeAgentCount: Math.max(0, metrics.activeAgentCount - 1),
-});
+const applyAgentCompleteCount = () => undefined;
 
 /** Set sessionStartedAt if currently empty. Does not touch activeAgentCount. */
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 5 tests
{ seed: 594315610, path: "4:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"agent_complete","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:127:33
 /** Decrement active agent count, floored at 0. */
 const applyAgentCompleteCount = (metrics: SessionMetrics): SessionMetrics => ({
   ...metrics,
-  activeAgentCount: Math.max(0, metrics.activeAgentCount - 1),
+  activeAgentCount: Math.max(0, metrics.activeAgentCount + 1),
 });
 
killedBy: agent_complete decrements active agent count agent_complete reduces activeAgentCount by one
statusReason: expected 4 to be 2 // Object.is equality

[Killed] MethodExpression
plugins/norbert-usage/domain/metricsAggregator.ts:127:21
 /** Decrement active agent count, floored at 0. */
 const applyAgentCompleteCount = (metrics: SessionMetrics): SessionMetrics => ({
   ...metrics,
-  activeAgentCount: Math.max(0, metrics.activeAgentCount - 1),
+  activeAgentCount: Math.min(0, metrics.activeAgentCount - 1),
 });
 
killedBy: agent_complete decrements active agent count agent_complete reduces activeAgentCount by one
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:131:38
 });
 
 /** Set sessionStartedAt if currently empty. Does not touch activeAgentCount. */
-const applySessionStartedAtIfEmpty = (
-  metrics: SessionMetrics,
-  receivedAt: string,
-): SessionMetrics =>
-  metrics.sessionStartedAt === ""
-    ? { ...metrics, sessionStartedAt: receivedAt }
-    : metrics;
+const applySessionStartedAtIfEmpty = () => undefined;
 
 /** Compute error rate: errors / (errors + requests), convention 0/0 = 0. */
killedBy: Walking Skeleton: operator sees accurate session cost when OTel is active pre-OTel cost preserved plus OTel cost_usd, hook token data excluded
statusReason: Cannot read properties of undefined (reading 'apiRequestCount')

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:135:3
   metrics: SessionMetrics,
   receivedAt: string,
 ): SessionMetrics =>
-  metrics.sessionStartedAt === ""
+  false
     ? { ...metrics, sessionStartedAt: receivedAt }
     : metrics;
killedBy: US-OFM-05: OTel session timing preference when OTel is active, first API request sets session start first API request sets session start time
statusReason: expected '' to be '2026-03-27T10:00:02Z' // Object.is equality

[Killed] EqualityOperator
plugins/norbert-usage/domain/metricsAggregator.ts:135:3
   metrics: SessionMetrics,
   receivedAt: string,
 ): SessionMetrics =>
-  metrics.sessionStartedAt === ""
+  metrics.sessionStartedAt !== ""
     ? { ...metrics, sessionStartedAt: receivedAt }
     : metrics;
killedBy: dual dispatch: isOtelActive selects handler table api_request with isOtelActive=true sets sessionStartedAt when empty
statusReason: Property failed after 1 tests
{ seed: 1273510132, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"api_request","payload":{"usage":{"input_tokens":0,"output_tokens":0,"cache_read_input_tokens":0,"cache_creation_input_tokens":0,"cost_usd":0,"model":"claude-opus-4-20250514","duration_ms":1000,"speed":"normal"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 6 time(s)

Hin

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:140:26
     : metrics;
 
 /** Compute error rate: errors / (errors + requests), convention 0/0 = 0. */
-const computeErrorRate = (errors: number, requests: number): number =>
-  (errors + requests) === 0 ? 0 : errors / (errors + requests);
+const computeErrorRate = () => undefined;
 
 /** Increment apiErrorCount and recompute apiErrorRate. */
killedBy: US-OFM-03: API error visibility API error events are tracked for error visibility API errors increment error count
statusReason: expected undefined to be close to 0.2727, received difference is NaN, but expected 0.0005
