[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:141:35
 
 /** Compute error rate: errors / (errors + requests), convention 0/0 = 0. */
 const computeErrorRate = (errors: number, requests: number): number =>
-  (errors + requests) === 0 ? 0 : errors / (errors + requests);
+  (errors + requests) === 0 ? 0 : errors * (errors + requests);
 
 /** Increment apiErrorCount and recompute apiErrorRate. */
killedBy: US-OFM-03: API error visibility API error events are tracked for error visibility API errors increment error count
statusReason: expected 33 to be close to 0.2727, received difference is 32.7273, but expected 0.0005

[Killed] ConditionalExpression
plugins/norbert-usage/domain/metricsAggregator.ts:141:3
 
 /** Compute error rate: errors / (errors + requests), convention 0/0 = 0. */
 const computeErrorRate = (errors: number, requests: number): number =>
-  (errors + requests) === 0 ? 0 : errors / (errors + requests);
+  true ? 0 : errors / (errors + requests);
 
 /** Increment apiErrorCount and recompute apiErrorRate. */
killedBy: US-OFM-03: API error visibility API error events are tracked for error visibility API errors increment error count
statusReason: expected +0 to be close to 0.2727, received difference is 0.2727, but expected 0.0005

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:144:73
   (errors + requests) === 0 ? 0 : errors / (errors + requests);
 
 /** Increment apiErrorCount and recompute apiErrorRate. */
-const applyApiErrorCount = (metrics: SessionMetrics): SessionMetrics => {
-  const newErrorCount = metrics.apiErrorCount + 1;
-  return {
-    ...metrics,
-    apiErrorCount: newErrorCount,
-    apiErrorRate: computeErrorRate(newErrorCount, metrics.apiRequestCount),
-  };
-};
+const applyApiErrorCount = (metrics: SessionMetrics): SessionMetrics => {};
 
 /** Increment apiRequestCount and recompute apiErrorRate. */
killedBy: Non-metric event types increment totalEventCount only (hook mode) api_error increments apiErrorCount in addition to totalEventCount
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:145:25
 
 /** Increment apiErrorCount and recompute apiErrorRate. */
 const applyApiErrorCount = (metrics: SessionMetrics): SessionMetrics => {
-  const newErrorCount = metrics.apiErrorCount + 1;
+  const newErrorCount = metrics.apiErrorCount - 1;
   return {
     ...metrics,
killedBy: US-OFM-03: API error visibility API error events are tracked for error visibility API errors increment error count
statusReason: expected -3 to be 3 // Object.is equality

[Killed] ObjectLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:146:10
 /** Increment apiErrorCount and recompute apiErrorRate. */
 const applyApiErrorCount = (metrics: SessionMetrics): SessionMetrics => {
   const newErrorCount = metrics.apiErrorCount + 1;
-  return {
-    ...metrics,
-    apiErrorCount: newErrorCount,
-    apiErrorRate: computeErrorRate(newErrorCount, metrics.apiRequestCount),
-  };
+  return {};
 };
 
killedBy: US-OFM-03: API error visibility API error events are tracked for error visibility API errors increment error count
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:154:75
 };
 
 /** Increment apiRequestCount and recompute apiErrorRate. */
-const applyApiRequestCount = (metrics: SessionMetrics): SessionMetrics => {
-  const newRequestCount = metrics.apiRequestCount + 1;
-  return {
-    ...metrics,
-    apiRequestCount: newRequestCount,
-    apiErrorRate: computeErrorRate(metrics.apiErrorCount, newRequestCount),
-  };
-};
+const applyApiRequestCount = (metrics: SessionMetrics): SessionMetrics => {};
 
 /** Apply common bookkeeping: increment totalEventCount, update lastEventAt. */
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:155:27
 
 /** Increment apiRequestCount and recompute apiErrorRate. */
 const applyApiRequestCount = (metrics: SessionMetrics): SessionMetrics => {
-  const newRequestCount = metrics.apiRequestCount + 1;
+  const newRequestCount = metrics.apiRequestCount - 1;
   return {
     ...metrics,
killedBy: api_request increments apiRequestCount each api_request event increments apiRequestCount by one
statusReason: Property failed after 1 tests
{ seed: 943583121, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:156:10
 /** Increment apiRequestCount and recompute apiErrorRate. */
 const applyApiRequestCount = (metrics: SessionMetrics): SessionMetrics => {
   const newRequestCount = metrics.apiRequestCount + 1;
-  return {
-    ...metrics,
-    apiRequestCount: newRequestCount,
-    apiErrorRate: computeErrorRate(metrics.apiErrorCount, newRequestCount),
-  };
+  return {};
 };
 
killedBy: api_request event with cost_usd updates session cost by exact cost_usd value cost_usd=0.042 produces sessionCost of exactly 0.042
statusReason: expected undefined to be 0.042 // Object.is equality

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:164:27
 };
 
 /** Apply common bookkeeping: increment totalEventCount, update lastEventAt. */
-const applyCommonFields = (
-  metrics: SessionMetrics,
-  receivedAt: string,
-): SessionMetrics => ({
-  ...metrics,
-  totalEventCount: metrics.totalEventCount + 1,
-  lastEventAt: receivedAt,
-});
+const applyCommonFields = () => undefined;
 
 // ---------------------------------------------------------------------------
killedBy: hookProcessor with token-bearing events prompt_submit with tokens updates totalTokens and sessionCost
statusReason: Cannot read properties of undefined (reading 'totalTokens')

[Killed] ArithmeticOperator
plugins/norbert-usage/domain/metricsAggregator.ts:169:20
   receivedAt: string,
 ): SessionMetrics => ({
   ...metrics,
-  totalEventCount: metrics.totalEventCount + 1,
+  totalEventCount: metrics.totalEventCount - 1,
   lastEventAt: receivedAt,
 });
killedBy: every event increments totalEventCount and updates lastEventAt totalEventCount increments by one for any event type
statusReason: Property failed after 1 tests
{ seed: 205164741, path: "0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"agent_complete","payload":{},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:197:39
 type EventHandler = (metrics: SessionMetrics, event: AggregatorEvent, pricingTable: PricingTable) => SessionMetrics;
 
 /** Identity handler for unknown event types: only common fields updated. */
-const identityHandler: EventHandler = (metrics) => metrics;
+const identityHandler: EventHandler = () => undefined;
 
 /** Hook-only dispatch table: all hook events contribute tokens and cost. */
killedBy: Non-metric event types increment totalEventCount only (hook mode) user_prompt increments totalEventCount and does not affect tokens or cost
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ObjectLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:200:57
 const identityHandler: EventHandler = (metrics) => metrics;
 
 /** Hook-only dispatch table: all hook events contribute tokens and cost. */
-const hookEventHandlers: Record<string, EventHandler> = {
-  prompt_submit: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
-
-  tool_call_end: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
-
-  tool_call_start: (metrics) =>
-    applyToolCallStart(metrics),
-
-  session_start: (metrics, event) =>
-    applySessionStart(metrics, event.receivedAt),
-
-  agent_complete: (metrics, event, pricingTable) =>
-    applyAgentCompleteCount(applyTokenUsage(metrics, event.payload, pricingTable)),
-
-  api_request: (metrics, event, pricingTable) =>
-    applyApiRequestCount(applyApiRequestTokenUsage(metrics, event.payload, pricingTable)),
-
-  user_prompt: identityHandler,
-  tool_result: identityHandler,
-  api_error: (metrics) => applyApiErrorCount(metrics),
-  tool_decision: identityHandler,
-};
+const hookEventHandlers: Record<string, EventHandler> = {};
 
 /** OTel-active dispatch table: hook cost/token events suppressed.
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: 431625495, path: "0:0:0:1:0:0:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:201:18
 
 /** Hook-only dispatch table: all hook events contribute tokens and cost. */
 const hookEventHandlers: Record<string, EventHandler> = {
-  prompt_submit: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
+  prompt_submit: () => undefined,
 
   tool_call_end: (metrics, event, pricingTable) =>
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -1487865745, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:204:18
   prompt_submit: (metrics, event, pricingTable) =>
     applyTokenUsage(metrics, event.payload, pricingTable),
 
-  tool_call_end: (metrics, event, pricingTable) =>
-    applyTokenUsage(metrics, event.payload, pricingTable),
+  tool_call_end: () => undefined,
 
   tool_call_start: (metrics) =>
killedBy: US-OFM-01: Cost single source of truth property: session cost invariants session cost is never negative regardless of event sequence
statusReason: Property failed after 2 tests
{ seed: -787744108, path: "1:2:0:2:3:3:3", endOnFailure: true }
Counterexample: [[{"eventType":"tool_call_end","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-sonnet-4-20250514"}},"receivedAt":"2026-03-27T10:00:00Z"}]]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:207:20
   tool_call_end: (metrics, event, pricingTable) =>
     applyTokenUsage(metrics, event.payload, pricingTable),
 
-  tool_call_start: (metrics) =>
-    applyToolCallStart(metrics),
+  tool_call_start: () => undefined,
 
   session_start: (metrics, event) =>
killedBy: US-OFM-01: Cost single source of truth when OTel is not active, hook events contribute to cost as before hook-only session counts tools from tool call start events
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:210:18
   tool_call_start: (metrics) =>
     applyToolCallStart(metrics),
 
-  session_start: (metrics, event) =>
-    applySessionStart(metrics, event.receivedAt),
+  session_start: () => undefined,
 
   agent_complete: (metrics, event, pricingTable) =>
killedBy: US-OFM-05: OTel session timing preference when OTel is not active, session start hook sets the timestamp hook-only session uses session start timestamp
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:213:19
   session_start: (metrics, event) =>
     applySessionStart(metrics, event.receivedAt),
 
-  agent_complete: (metrics, event, pricingTable) =>
-    applyAgentCompleteCount(applyTokenUsage(metrics, event.payload, pricingTable)),
+  agent_complete: () => undefined,
 
   api_request: (metrics, event, pricingTable) =>
killedBy: hookProcessor with token-bearing events agent_complete with tokens updates tokens, cost, and decrements activeAgentCount
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:216:16
   agent_complete: (metrics, event, pricingTable) =>
     applyAgentCompleteCount(applyTokenUsage(metrics, event.payload, pricingTable)),
 
-  api_request: (metrics, event, pricingTable) =>
-    applyApiRequestCount(applyApiRequestTokenUsage(metrics, event.payload, pricingTable)),
+  api_request: () => undefined,
 
   user_prompt: identityHandler,
killedBy: US-OFM-01: Cost single source of truth property: session cost invariants session cost is never negative regardless of event sequence
statusReason: Property failed after 1 tests
{ seed: -1560645057, path: "0:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [[{"eventType":"api_request","payload":{"usage":{"input_tokens":0,"output_tokens":0,"cache_read_input_tokens":0,"cache_creation_input_tokens":0,"cost_usd":0,"model":"claude-sonnet-4-20250514","duration_ms":1000,"speed":"normal"}},"receivedAt":"2026-03-27T10:00:00Z"}]]
Shrunk 7 time(s)

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:221:14
 
   user_prompt: identityHandler,
   tool_result: identityHandler,
-  api_error: (metrics) => applyApiErrorCount(metrics),
+  api_error: () => undefined,
   tool_decision: identityHandler,
 };
killedBy: Non-metric event types increment totalEventCount only (hook mode) api_error increments apiErrorCount in addition to totalEventCount
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:234:18
   tool_call_end: identityHandler,
   tool_call_start: identityHandler,
 
-  session_start: (metrics) => ({
-    ...metrics,
-    activeAgentCount: metrics.activeAgentCount + 1,
-  }),
+  session_start: () => undefined,
 
   agent_complete: (metrics) =>
killedBy: US-OFM-05: OTel session timing preference when OTel is active, first API request sets session start first API request sets session start time
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:239:19
     activeAgentCount: metrics.activeAgentCount + 1,
   }),
 
-  agent_complete: (metrics) =>
-    applyAgentCompleteCount(metrics),
+  agent_complete: () => undefined,
 
   api_request: (metrics, event, pricingTable) =>
killedBy: dual dispatch: isOtelActive selects handler table agent_complete with isOtelActive=true decrements count but does not change cost
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:242:16
   agent_complete: (metrics) =>
     applyAgentCompleteCount(metrics),
 
-  api_request: (metrics, event, pricingTable) =>
-    applyApiRequestCount(
-      applySessionStartedAtIfEmpty(
-        applyApiRequestTokenUsage(metrics, event.payload, pricingTable),
-        event.receivedAt,
-      ),
-    ),
+  api_request: () => undefined,
 
   user_prompt: identityHandler,
killedBy: Walking Skeleton: operator sees accurate session cost when OTel is active pre-OTel cost preserved plus OTel cost_usd, hook token data excluded
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:251:16
     ),
 
   user_prompt: identityHandler,
-  tool_result: (metrics) => applyToolCallStart(metrics),
+  tool_result: () => undefined,
   api_error: (metrics) => applyApiErrorCount(metrics),
   tool_decision: identityHandler,
killedBy: US-OFM-02: Rich tool tracking from OTel when OTel is active, tool_result events are the source for tool counts tool result events increment tool call count
statusReason: Cannot read properties of undefined (reading 'totalEventCount')

[Killed] ArrowFunction
plugins/norbert-usage/domain/metricsAggregator.ts:252:14
 
   user_prompt: identityHandler,
   tool_result: (metrics) => applyToolCallStart(metrics),
-  api_error: (metrics) => applyApiErrorCount(metrics),
+  api_error: () => undefined,
   tool_decision: identityHandler,
 };
killedBy: api_error increments apiErrorCount each api_error event increments apiErrorCount by one
statusReason: Property failed after 1 tests
{ seed: -862619105, path: "0:0:0", endOnFailure: true }
Counterexample: [0,"2025-01-01T00:00:00.000Z"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
plugins/norbert-usage/domain/metricsAggregator.ts:260:27
   previous: SessionMetrics,
   event: AggregatorEvent,
   pricingTable: PricingTable,
-  isOtelActive: boolean = false,
+  isOtelActive: boolean = true,
 ): SessionMetrics => {
   const handlers = isOtelActive ? otelEventHandlers : hookEventHandlers;
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -1788778211, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":1,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 26 time(s)

Hint: Enable verbose mode in order to have the list of all failing v

[Killed] BlockStatement
plugins/norbert-usage/domain/metricsAggregator.ts:261:22
   event: AggregatorEvent,
   pricingTable: PricingTable,
   isOtelActive: boolean = false,
-): SessionMetrics => {
-  const handlers = isOtelActive ? otelEventHandlers : hookEventHandlers;
-  const handler = handlers[event.eventType] ?? identityHandler;
-  const updated = handler(previous, event, pricingTable);
-  return applyCommonFields(updated, event.receivedAt);
-};
+): SessionMetrics => {};
 
killedBy: token-bearing events update tokens and cost prompt_submit with tokens increases totalTokens, inputTokens, outputTokens, and sessionCost
statusReason: Property failed after 1 tests
{ seed: -770065425, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"eventType":"prompt_submit","payload":{"usage":{"input_tokens":0,"output_tokens":0,"model":"claude-opus-4-20250514"}},"receivedAt":"2025-01-01T00:00:00.000Z"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
plugins/norbert-usage/domain/metricsAggregator.ts:263:19
   isOtelActive: boolean = false,
 ): SessionMetrics => {
   const handlers = isOtelActive ? otelEventHandlers : hookEventHandlers;
-  const handler = handlers[event.eventType] ?? identityHandler;
+  const handler = handlers[event.eventType] && identityHandler;
   const updated = handler(previous, event, pricingTable);
   return applyCommonFields(updated, event.receivedAt);
killedBy: Walking Skeleton: operator sees accurate session cost when OTel is active pre-OTel cost preserved plus OTel cost_usd, hook token data excluded
statusReason: expected 1.2 to be close to 3.6, received difference is 2.4000000000000004, but expected 0.005
