[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:57:21
 function findMetricsForSession(
   sessionId: string,
   metrics: readonly SessionMetrics[],
-): ExtractedMetrics {
-  const found = metrics.find((m) => m.sessionId === sessionId);
-  if (!found) return ZERO_METRICS;
-  return {
-    cost: found.sessionCost,
-    totalTokens: found.totalTokens,
-    burnRate: found.burnRate,
-    contextPercent: found.contextWindowPct,
-    inputTokens: found.inputTokens,
-    outputTokens: found.outputTokens,
-    cacheReadTokens: found.cacheReadTokens,
-    activeAgents: found.activeAgentCount,
-    totalEventCount: found.totalEventCount,
-  };
-}
+): ExtractedMetrics {}
 
 /** Find metadata for a session, returning null fields when absent. */

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:58:37
   sessionId: string,
   metrics: readonly SessionMetrics[],
 ): ExtractedMetrics {
-  const found = metrics.find((m) => m.sessionId === sessionId);
+  const found = metrics.find((m) => true);
   if (!found) return ZERO_METRICS;
   return {

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:58:37
   sessionId: string,
   metrics: readonly SessionMetrics[],
 ): ExtractedMetrics {
-  const found = metrics.find((m) => m.sessionId === sessionId);
+  const found = metrics.find((m) => false);
   if (!found) return ZERO_METRICS;
   return {

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:59:7
   metrics: readonly SessionMetrics[],
 ): ExtractedMetrics {
   const found = metrics.find((m) => m.sessionId === sessionId);
-  if (!found) return ZERO_METRICS;
+  if (false) return ZERO_METRICS;
   return {
     cost: found.sessionCost,

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:59:7
   metrics: readonly SessionMetrics[],
 ): ExtractedMetrics {
   const found = metrics.find((m) => m.sessionId === sessionId);
-  if (!found) return ZERO_METRICS;
+  if (true) return ZERO_METRICS;
   return {
     cost: found.sessionCost,

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:81:3
   readonly cwd: string | null;
   readonly version: string | null;
   readonly platform: string | null;
-} {
-  const found = metadata.find((m) => m.session_id === sessionId);
-  if (!found) return { cwd: null, version: null, platform: null };
-  return {
-    cwd: found.cwd,
-    version: formatClaudeVersion(found.service_version),
-    platform: formatPlatform(found.os_type, found.host_arch),
-  };
-}
+} {}
 
 /** Compute session duration in milliseconds from started_at to now (or ended_at). */

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:82:38
   readonly version: string | null;
   readonly platform: string | null;
 } {
-  const found = metadata.find((m) => m.session_id === sessionId);
+  const found = metadata.find((m) => m.session_id !== sessionId);
   if (!found) return { cwd: null, version: null, platform: null };
   return {

[Timeout] ArrowFunction
plugins/norbert-session/domain/sessionMetricsTable.ts:82:31
   readonly version: string | null;
   readonly platform: string | null;
 } {
-  const found = metadata.find((m) => m.session_id === sessionId);
+  const found = metadata.find(() => undefined);
   if (!found) return { cwd: null, version: null, platform: null };
   return {

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:83:7
   readonly platform: string | null;
 } {
   const found = metadata.find((m) => m.session_id === sessionId);
-  if (!found) return { cwd: null, version: null, platform: null };
+  if (false) return { cwd: null, version: null, platform: null };
   return {
     cwd: found.cwd,

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:83:7
   readonly platform: string | null;
 } {
   const found = metadata.find((m) => m.session_id === sessionId);
-  if (!found) return { cwd: null, version: null, platform: null };
+  if (true) return { cwd: null, version: null, platform: null };
   return {
     cwd: found.cwd,

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:92:71
 }
 
 /** Compute session duration in milliseconds from started_at to now (or ended_at). */
-function computeDurationMs(session: SessionInfo, now: number): number {
-  const startedAt = new Date(session.started_at).getTime();
-  const endedAt =
-    session.ended_at !== null ? new Date(session.ended_at).getTime() : now;
-  return Math.max(0, endedAt - startedAt);
-}
+function computeDurationMs(session: SessionInfo, now: number): number {}
 
 /** Transform a single session into a TableRow. */

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:95:5
 function computeDurationMs(session: SessionInfo, now: number): number {
   const startedAt = new Date(session.started_at).getTime();
   const endedAt =
-    session.ended_at !== null ? new Date(session.ended_at).getTime() : now;
+    session.ended_at === null ? new Date(session.ended_at).getTime() : now;
   return Math.max(0, endedAt - startedAt);
 }

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:95:5
 function computeDurationMs(session: SessionInfo, now: number): number {
   const startedAt = new Date(session.started_at).getTime();
   const endedAt =
-    session.ended_at !== null ? new Date(session.ended_at).getTime() : now;
+    true ? new Date(session.ended_at).getTime() : now;
   return Math.max(0, endedAt - startedAt);
 }

[Timeout] MethodExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:96:10
   const startedAt = new Date(session.started_at).getTime();
   const endedAt =
     session.ended_at !== null ? new Date(session.ended_at).getTime() : now;
-  return Math.max(0, endedAt - startedAt);
+  return Math.min(0, endedAt - startedAt);
 }
 

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:96:22
   const startedAt = new Date(session.started_at).getTime();
   const endedAt =
     session.ended_at !== null ? new Date(session.ended_at).getTime() : now;
-  return Math.max(0, endedAt - startedAt);
+  return Math.max(0, endedAt + startedAt);
 }
 

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:105:13
   metrics: readonly SessionMetrics[],
   metadata: readonly SessionMetadata[],
   now: number,
-): TableRow {
-  const sessionMetadata = findMetadataForSession(session.id, metadata);
-  const name = deriveSessionName(sessionMetadata.cwd, session.id);
-  const active = isSessionActive(session, now);
-  const metricsData = findMetricsForSession(session.id, metrics);
-  const durationMs = computeDurationMs(session, now);
-
-  return {
-    sessionId: session.id,
-    name,
-    isActive: active,
-    cost: metricsData.cost,
-    totalTokens: metricsData.totalTokens,
-    burnRate: metricsData.burnRate,
-    contextPercent: metricsData.contextPercent,
-    durationMs,
-    inputTokens: metricsData.inputTokens,
-    outputTokens: metricsData.outputTokens,
-    cacheReadTokens: metricsData.cacheReadTokens,
-    activeAgents: metricsData.activeAgents,
-    totalEventCount: metricsData.totalEventCount,
-    version: sessionMetadata.version,
-    platform: sessionMetadata.platform,
-  };
-}
+): TableRow {}
 
 // ---------------------------------------------------------------------------

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:141:24
   metrics: readonly SessionMetrics[],
   metadata: readonly SessionMetadata[],
   now: number,
-): readonly TableRow[] {
-  return sessions.map((session) =>
-    sessionToTableRow(session, metrics, metadata, now),
-  );
-}
+): readonly TableRow[] {}
 
 // ---------------------------------------------------------------------------

[Timeout] ArrowFunction
plugins/norbert-session/domain/sessionMetricsTable.ts:142:23
   metadata: readonly SessionMetadata[],
   now: number,
 ): readonly TableRow[] {
-  return sessions.map((session) =>
-    sessionToTableRow(session, metrics, metadata, now),
+  return sessions.map(() => undefined,
   );
 }

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:157:74
  * All other sessions go to the recent group.
  * Returns counts for each group alongside the row arrays.
  */
-export function groupSessionRows(rows: readonly TableRow[]): GroupedRows {
-  const active = rows.filter((row) => row.isActive);
-  const recent = rows.filter((row) => !row.isActive);
-  return {
-    active,
-    recent,
-    activeCount: active.length,
-    recentCount: recent.length,
-  };
-}
+export function groupSessionRows(rows: readonly TableRow[]): GroupedRows {}
 
 // ---------------------------------------------------------------------------

[Timeout] ArrowFunction
plugins/norbert-session/domain/sessionMetricsTable.ts:158:30
  * Returns counts for each group alongside the row arrays.
  */
 export function groupSessionRows(rows: readonly TableRow[]): GroupedRows {
-  const active = rows.filter((row) => row.isActive);
+  const active = rows.filter(() => undefined);
   const recent = rows.filter((row) => !row.isActive);
   return {

[Timeout] MethodExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:158:18
  * Returns counts for each group alongside the row arrays.
  */
 export function groupSessionRows(rows: readonly TableRow[]): GroupedRows {
-  const active = rows.filter((row) => row.isActive);
+  const active = rows;
   const recent = rows.filter((row) => !row.isActive);
   return {

[Timeout] ArrowFunction
plugins/norbert-session/domain/sessionMetricsTable.ts:159:30
  */
 export function groupSessionRows(rows: readonly TableRow[]): GroupedRows {
   const active = rows.filter((row) => row.isActive);
-  const recent = rows.filter((row) => !row.isActive);
+  const recent = rows.filter(() => undefined);
   return {
     active,

[Timeout] MethodExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:159:18
  */
 export function groupSessionRows(rows: readonly TableRow[]): GroupedRows {
   const active = rows.filter((row) => row.isActive);
-  const recent = rows.filter((row) => !row.isActive);
+  const recent = rows;
   return {
     active,

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:173:67
 // ---------------------------------------------------------------------------
 
 /** Toggle a group's collapsed state. Returns the opposite boolean value. */
-export function toggleGroupCollapsed(collapsed: boolean): boolean {
-  return !collapsed;
-}
+export function toggleGroupCollapsed(collapsed: boolean): boolean {}
 
 // ---------------------------------------------------------------------------

[Timeout] BooleanLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:174:10
 
 /** Toggle a group's collapsed state. Returns the opposite boolean value. */
 export function toggleGroupCollapsed(collapsed: boolean): boolean {
-  return !collapsed;
+  return collapsed;
 }
 

[Killed] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:182:56
 // ---------------------------------------------------------------------------
 
 /** Format a numeric cost as a dollar string with two decimal places. */
-export function formatCostColumn(cost: number): string {
-  return `$${cost.toFixed(2)}`;
-}
+export function formatCostColumn(cost: number): string {}
 
 // ---------------------------------------------------------------------------
killedBy: All tests

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:191:59
 // ---------------------------------------------------------------------------
 
 /** Format a token count in thousands with one decimal place and K suffix. */
-export function formatTokenColumn(tokens: number): string {
-  const inThousands = tokens / 1000;
-  return `${inThousands.toFixed(1)}K`;
-}
+export function formatTokenColumn(tokens: number): string {}
 
 // ---------------------------------------------------------------------------

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:192:23
 
 /** Format a token count in thousands with one decimal place and K suffix. */
 export function formatTokenColumn(tokens: number): string {
-  const inThousands = tokens / 1000;
+  const inThousands = tokens * 1000;
   return `${inThousands.toFixed(1)}K`;
 }

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:193:10
 /** Format a token count in thousands with one decimal place and K suffix. */
 export function formatTokenColumn(tokens: number): string {
   const inThousands = tokens / 1000;
-  return `${inThousands.toFixed(1)}K`;
+  return ``;
 }
 

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:212:11
   currentIndex: number,
   direction: FocusDirection,
   rowCount: number,
-): number {
-  if (rowCount === 0) return -1;
-
-  const delta = direction === "down" ? 1 : -1;
-  const nextIndex = currentIndex + delta;
-
-  return Math.max(0, Math.min(nextIndex, rowCount - 1));
-}
+): number {}
 
 // ---------------------------------------------------------------------------

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:213:7
   direction: FocusDirection,
   rowCount: number,
 ): number {
-  if (rowCount === 0) return -1;
+  if (rowCount !== 0) return -1;
 
   const delta = direction === "down" ? 1 : -1;

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:213:7
   direction: FocusDirection,
   rowCount: number,
 ): number {
-  if (rowCount === 0) return -1;
+  if (true) return -1;
 
   const delta = direction === "down" ? 1 : -1;

[Timeout] UnaryOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:215:44
 ): number {
   if (rowCount === 0) return -1;
 
-  const delta = direction === "down" ? 1 : -1;
+  const delta = direction === "down" ? 1 : +1;
   const nextIndex = currentIndex + delta;
 

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:215:17
 ): number {
   if (rowCount === 0) return -1;
 
-  const delta = direction === "down" ? 1 : -1;
+  const delta = true ? 1 : -1;
   const nextIndex = currentIndex + delta;
 

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:216:21
   if (rowCount === 0) return -1;
 
   const delta = direction === "down" ? 1 : -1;
-  const nextIndex = currentIndex + delta;
+  const nextIndex = currentIndex - delta;
 
   return Math.max(0, Math.min(nextIndex, rowCount - 1));

[Timeout] MethodExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:218:22
   const delta = direction === "down" ? 1 : -1;
   const nextIndex = currentIndex + delta;
 
-  return Math.max(0, Math.min(nextIndex, rowCount - 1));
+  return Math.max(0, Math.max(nextIndex, rowCount - 1));
 }
 

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:218:42
   const delta = direction === "down" ? 1 : -1;
   const nextIndex = currentIndex + delta;
 
-  return Math.max(0, Math.min(nextIndex, rowCount - 1));
+  return Math.max(0, Math.min(nextIndex, rowCount + 1));
 }
 

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:232:18
 export function selectFocusedRow(
   focusedIndex: number,
   rows: readonly TableRow[],
-): string | null {
-  if (focusedIndex < 0 || focusedIndex >= rows.length) return null;
-  return rows[focusedIndex].sessionId;
-}
+): string | null {}
 
 // ---------------------------------------------------------------------------

[Timeout] LogicalOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:233:7
   focusedIndex: number,
   rows: readonly TableRow[],
 ): string | null {
-  if (focusedIndex < 0 || focusedIndex >= rows.length) return null;
+  if (focusedIndex < 0 && focusedIndex >= rows.length) return null;
   return rows[focusedIndex].sessionId;
 }

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:233:27
   focusedIndex: number,
   rows: readonly TableRow[],
 ): string | null {
-  if (focusedIndex < 0 || focusedIndex >= rows.length) return null;
+  if (focusedIndex < 0 || false) return null;
   return rows[focusedIndex].sessionId;
 }

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:242:74
 // ---------------------------------------------------------------------------
 
 /** Extract a comparable value from a row for the given column. */
-function columnValue(row: TableRow, columnId: ColumnId): number | string {
-  switch (columnId) {
-    case "name":
-      return row.name;
-    case "cost":
-      return row.cost;
-    case "totalTokens":
-      return row.totalTokens;
-    case "burnRate":
-      return row.burnRate;
-    case "contextPercent":
-      return row.contextPercent;
-    case "durationMs":
-      return row.durationMs;
-  }
-}
+function columnValue(row: TableRow, columnId: ColumnId): number | string {}
 
 /** Compare two values with direction applied. */

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:244:5
 /** Extract a comparable value from a row for the given column. */
 function columnValue(row: TableRow, columnId: ColumnId): number | string {
   switch (columnId) {
-    case "name":
-      return row.name;
+    case "name":
     case "cost":
       return row.cost;

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:244:10
 /** Extract a comparable value from a row for the given column. */
 function columnValue(row: TableRow, columnId: ColumnId): number | string {
   switch (columnId) {
-    case "name":
+    case "":
       return row.name;
     case "cost":

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:246:5
   switch (columnId) {
     case "name":
       return row.name;
-    case "cost":
-      return row.cost;
+    case "cost":
     case "totalTokens":
       return row.totalTokens;

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:248:5
       return row.name;
     case "cost":
       return row.cost;
-    case "totalTokens":
-      return row.totalTokens;
+    case "totalTokens":
     case "burnRate":
       return row.burnRate;

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:248:10
       return row.name;
     case "cost":
       return row.cost;
-    case "totalTokens":
+    case "":
       return row.totalTokens;
     case "burnRate":

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:250:5
       return row.cost;
     case "totalTokens":
       return row.totalTokens;
-    case "burnRate":
-      return row.burnRate;
+    case "burnRate":
     case "contextPercent":
       return row.contextPercent;

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:252:5
       return row.totalTokens;
     case "burnRate":
       return row.burnRate;
-    case "contextPercent":
-      return row.contextPercent;
+    case "contextPercent":
     case "durationMs":
       return row.durationMs;

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:254:5
       return row.burnRate;
     case "contextPercent":
       return row.contextPercent;
-    case "durationMs":
-      return row.durationMs;
+    case "durationMs":
   }
 }

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:264:11
   a: number | string,
   b: number | string,
   direction: SortDirection,
-): number {
-  const multiplier = direction === "asc" ? 1 : -1;
-  if (typeof a === "string" && typeof b === "string") {
-    return multiplier * a.localeCompare(b);
-  }
-  return multiplier * ((a as number) - (b as number));
-}
+): number {}
 
 /**

[Timeout] UnaryOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:265:48
   b: number | string,
   direction: SortDirection,
 ): number {
-  const multiplier = direction === "asc" ? 1 : -1;
+  const multiplier = direction === "asc" ? 1 : +1;
   if (typeof a === "string" && typeof b === "string") {
     return multiplier * a.localeCompare(b);

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:265:22
   b: number | string,
   direction: SortDirection,
 ): number {
-  const multiplier = direction === "asc" ? 1 : -1;
+  const multiplier = true ? 1 : -1;
   if (typeof a === "string" && typeof b === "string") {
     return multiplier * a.localeCompare(b);

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:266:7
   direction: SortDirection,
 ): number {
   const multiplier = direction === "asc" ? 1 : -1;
-  if (typeof a === "string" && typeof b === "string") {
+  if (false) {
     return multiplier * a.localeCompare(b);
   }

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:266:32
   direction: SortDirection,
 ): number {
   const multiplier = direction === "asc" ? 1 : -1;
-  if (typeof a === "string" && typeof b === "string") {
+  if (typeof a === "string" && typeof b !== "string") {
     return multiplier * a.localeCompare(b);
   }

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:267:12
 ): number {
   const multiplier = direction === "asc" ? 1 : -1;
   if (typeof a === "string" && typeof b === "string") {
-    return multiplier * a.localeCompare(b);
+    return multiplier / a.localeCompare(b);
   }
   return multiplier * ((a as number) - (b as number));

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:269:10
   if (typeof a === "string" && typeof b === "string") {
     return multiplier * a.localeCompare(b);
   }
-  return multiplier * ((a as number) - (b as number));
+  return multiplier / ((a as number) - (b as number));
 }
 

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:269:24
   if (typeof a === "string" && typeof b === "string") {
     return multiplier * a.localeCompare(b);
   }
-  return multiplier * ((a as number) - (b as number));
+  return multiplier * ((a as number) + (b as number));
 }
 

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:282:24
   rows: readonly TableRow[],
   columnId: ColumnId,
   direction: SortDirection,
-): readonly TableRow[] {
-  return [...rows].sort((a, b) => {
-    // Active sessions always sort above completed
-    if (a.isActive !== b.isActive) {
-      return a.isActive ? -1 : 1;
-    }
-    // Within same active group, sort by column
-    return compareValues(columnValue(a, columnId), columnValue(b, columnId), direction);
-  });
-}
+): readonly TableRow[] {}
 
 // ---------------------------------------------------------------------------

[Timeout] MethodExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:283:10
   columnId: ColumnId,
   direction: SortDirection,
 ): readonly TableRow[] {
-  return [...rows].sort((a, b) => {
-    // Active sessions always sort above completed
-    if (a.isActive !== b.isActive) {
-      return a.isActive ? -1 : 1;
-    }
-    // Within same active group, sort by column
-    return compareValues(columnValue(a, columnId), columnValue(b, columnId), direction);
-  });
+  return [...rows];
 }
 

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:283:35
   columnId: ColumnId,
   direction: SortDirection,
 ): readonly TableRow[] {
-  return [...rows].sort((a, b) => {
-    // Active sessions always sort above completed
-    if (a.isActive !== b.isActive) {
-      return a.isActive ? -1 : 1;
-    }
-    // Within same active group, sort by column
-    return compareValues(columnValue(a, columnId), columnValue(b, columnId), direction);
-  });
+  return [...rows].sort((a, b) => {});
 }
 

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:285:9
 ): readonly TableRow[] {
   return [...rows].sort((a, b) => {
     // Active sessions always sort above completed
-    if (a.isActive !== b.isActive) {
+    if (a.isActive === b.isActive) {
       return a.isActive ? -1 : 1;
     }

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:285:9
 ): readonly TableRow[] {
   return [...rows].sort((a, b) => {
     // Active sessions always sort above completed
-    if (a.isActive !== b.isActive) {
+    if (false) {
       return a.isActive ? -1 : 1;
     }

[Timeout] UnaryOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:286:27
   return [...rows].sort((a, b) => {
     // Active sessions always sort above completed
     if (a.isActive !== b.isActive) {
-      return a.isActive ? -1 : 1;
+      return a.isActive ? +1 : 1;
     }
     // Within same active group, sort by column

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:305:14
 export function applySortToggle(
   currentSort: SortState,
   clickedColumnId: ColumnId,
-): SortState {
-  if (currentSort.columnId === clickedColumnId) {
-    return {
-      columnId: clickedColumnId,
-      direction: currentSort.direction === "asc" ? "desc" : "asc",
-    };
-  }
-  return { columnId: clickedColumnId, direction: "asc" };
-}
+): SortState {}
 
 // ---------------------------------------------------------------------------

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:306:7
   currentSort: SortState,
   clickedColumnId: ColumnId,
 ): SortState {
-  if (currentSort.columnId === clickedColumnId) {
+  if (false) {
     return {
       columnId: clickedColumnId,

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:306:7
   currentSort: SortState,
   clickedColumnId: ColumnId,
 ): SortState {
-  if (currentSort.columnId === clickedColumnId) {
+  if (true) {
     return {
       columnId: clickedColumnId,

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:309:18
   if (currentSort.columnId === clickedColumnId) {
     return {
       columnId: clickedColumnId,
-      direction: currentSort.direction === "asc" ? "desc" : "asc",
+      direction: currentSort.direction !== "asc" ? "desc" : "asc",
     };
   }

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:309:18
   if (currentSort.columnId === clickedColumnId) {
     return {
       columnId: clickedColumnId,
-      direction: currentSort.direction === "asc" ? "desc" : "asc",
+      direction: true ? "desc" : "asc",
     };
   }

[Timeout] ObjectLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:312:10
       direction: currentSort.direction === "asc" ? "desc" : "asc",
     };
   }
-  return { columnId: clickedColumnId, direction: "asc" };
+  return {};
 }
 

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:312:50
       direction: currentSort.direction === "asc" ? "desc" : "asc",
     };
   }
-  return { columnId: clickedColumnId, direction: "asc" };
+  return { columnId: clickedColumnId, direction: "" };
 }
 

[Timeout] ObjectLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:325:57
   readonly red: number;
 }
 
-const HEAT_THRESHOLDS: Record<string, HeatThresholds> = {
-  cost: { amber: 0.50, red: 2.00 },
-  totalTokens: { amber: 50_000, red: 200_000 },
-  burnRate: { amber: 100, red: 300 },
-  contextPercent: { amber: 60, red: 80 },
-};
+const HEAT_THRESHOLDS: Record<string, HeatThresholds> = {};
 
 /** API health thresholds: success rate BELOW these values triggers heat. */

[Timeout] ObjectLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:329:19
   cost: { amber: 0.50, red: 2.00 },
   totalTokens: { amber: 50_000, red: 200_000 },
   burnRate: { amber: 100, red: 300 },
-  contextPercent: { amber: 60, red: 80 },
+  contextPercent: {},
 };
 

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:336:81
 const API_HEALTH_THRESHOLDS: HeatThresholds = { amber: 98, red: 90 };
 
 /** Classify a value against standard (higher = hotter) thresholds. */
-function classifyStandard(value: number, thresholds: HeatThresholds): HeatLevel {
-  if (value >= thresholds.red) return "red";
-  if (value >= thresholds.amber) return "amber";
-  return "neutral";
-}
+function classifyStandard(value: number, thresholds: HeatThresholds): HeatLevel {}
 
 /** Classify API health where LOWER success rate = higher heat. */

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:337:7
 
 /** Classify a value against standard (higher = hotter) thresholds. */
 function classifyStandard(value: number, thresholds: HeatThresholds): HeatLevel {
-  if (value >= thresholds.red) return "red";
+  if (true) return "red";
   if (value >= thresholds.amber) return "amber";
   return "neutral";

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:337:7
 
 /** Classify a value against standard (higher = hotter) thresholds. */
 function classifyStandard(value: number, thresholds: HeatThresholds): HeatLevel {
-  if (value >= thresholds.red) return "red";
+  if (false) return "red";
   if (value >= thresholds.amber) return "amber";
   return "neutral";

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:338:7
 /** Classify a value against standard (higher = hotter) thresholds. */
 function classifyStandard(value: number, thresholds: HeatThresholds): HeatLevel {
   if (value >= thresholds.red) return "red";
-  if (value >= thresholds.amber) return "amber";
+  if (value < thresholds.amber) return "amber";
   return "neutral";
 }
