[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:338:7
 /** Classify a value against standard (higher = hotter) thresholds. */
 function classifyStandard(value: number, thresholds: HeatThresholds): HeatLevel {
   if (value >= thresholds.red) return "red";
-  if (value >= thresholds.amber) return "amber";
+  if (value > thresholds.amber) return "amber";
   return "neutral";
 }

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:343:60
 }
 
 /** Classify API health where LOWER success rate = higher heat. */
-function classifyApiHealth(successRate: number): HeatLevel {
-  if (successRate <= 0) return "neutral";
-  if (successRate < API_HEALTH_THRESHOLDS.red) return "red";
-  if (successRate < API_HEALTH_THRESHOLDS.amber) return "amber";
-  return "neutral";
-}
+function classifyApiHealth(successRate: number): HeatLevel {}
 
 /**

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:344:7
 
 /** Classify API health where LOWER success rate = higher heat. */
 function classifyApiHealth(successRate: number): HeatLevel {
-  if (successRate <= 0) return "neutral";
+  if (true) return "neutral";
   if (successRate < API_HEALTH_THRESHOLDS.red) return "red";
   if (successRate < API_HEALTH_THRESHOLDS.amber) return "amber";

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:344:7
 
 /** Classify API health where LOWER success rate = higher heat. */
 function classifyApiHealth(successRate: number): HeatLevel {
-  if (successRate <= 0) return "neutral";
+  if (successRate > 0) return "neutral";
   if (successRate < API_HEALTH_THRESHOLDS.red) return "red";
   if (successRate < API_HEALTH_THRESHOLDS.amber) return "amber";

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:345:7
 /** Classify API health where LOWER success rate = higher heat. */
 function classifyApiHealth(successRate: number): HeatLevel {
   if (successRate <= 0) return "neutral";
-  if (successRate < API_HEALTH_THRESHOLDS.red) return "red";
+  if (successRate >= API_HEALTH_THRESHOLDS.red) return "red";
   if (successRate < API_HEALTH_THRESHOLDS.amber) return "amber";
   return "neutral";

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:345:7
 /** Classify API health where LOWER success rate = higher heat. */
 function classifyApiHealth(successRate: number): HeatLevel {
   if (successRate <= 0) return "neutral";
-  if (successRate < API_HEALTH_THRESHOLDS.red) return "red";
+  if (false) return "red";
   if (successRate < API_HEALTH_THRESHOLDS.amber) return "amber";
   return "neutral";

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:346:7
 function classifyApiHealth(successRate: number): HeatLevel {
   if (successRate <= 0) return "neutral";
   if (successRate < API_HEALTH_THRESHOLDS.red) return "red";
-  if (successRate < API_HEALTH_THRESHOLDS.amber) return "amber";
+  if (successRate >= API_HEALTH_THRESHOLDS.amber) return "amber";
   return "neutral";
 }

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:346:7
 function classifyApiHealth(successRate: number): HeatLevel {
   if (successRate <= 0) return "neutral";
   if (successRate < API_HEALTH_THRESHOLDS.red) return "red";
-  if (successRate < API_HEALTH_THRESHOLDS.amber) return "amber";
+  if (true) return "amber";
   return "neutral";
 }

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:356:84
  * For standard columns, higher values produce higher heat.
  * For apiHealth, lower success rates produce higher heat.
  */
-export function computeHeatLevel(value: number, columnId: HeatColumnId): HeatLevel {
-  if (value === 0) return "neutral";
-
-  if (columnId === "apiHealth") {
-    return classifyApiHealth(value);
-  }
-
-  const thresholds = HEAT_THRESHOLDS[columnId];
-  return classifyStandard(value, thresholds);
-}
+export function computeHeatLevel(value: number, columnId: HeatColumnId): HeatLevel {}
 
 // ---------------------------------------------------------------------------

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:357:7
  * For apiHealth, lower success rates produce higher heat.
  */
 export function computeHeatLevel(value: number, columnId: HeatColumnId): HeatLevel {
-  if (value === 0) return "neutral";
+  if (false) return "neutral";
 
   if (columnId === "apiHealth") {

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:357:7
  * For apiHealth, lower success rates produce higher heat.
  */
 export function computeHeatLevel(value: number, columnId: HeatColumnId): HeatLevel {
-  if (value === 0) return "neutral";
+  if (value !== 0) return "neutral";
 
   if (columnId === "apiHealth") {

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:359:7
 export function computeHeatLevel(value: number, columnId: HeatColumnId): HeatLevel {
   if (value === 0) return "neutral";
 
-  if (columnId === "apiHealth") {
+  if (false) {
     return classifyApiHealth(value);
   }

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:359:7
 export function computeHeatLevel(value: number, columnId: HeatColumnId): HeatLevel {
   if (value === 0) return "neutral";
 
-  if (columnId === "apiHealth") {
+  if (columnId !== "apiHealth") {
     return classifyApiHealth(value);
   }

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:372:63
 // ---------------------------------------------------------------------------
 
 /** Map a HeatLevel to a CSS class string for styling. */
-export function deriveHeatClass(heatLevel: HeatLevel): string {
-  return `heat-${heatLevel}`;
-}
+export function deriveHeatClass(heatLevel: HeatLevel): string {}
 
 // ---------------------------------------------------------------------------

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:387:18
  */
 export function computeStatusBarData(
   visibleRows: readonly TableRow[],
-): StatusBarData {
-  const raw = visibleRows.reduce(
-    (acc, row) => ({
-      costCents: acc.costCents + Math.round(row.cost * 100),
-      totalTokens: acc.totalTokens + row.totalTokens,
-    }),
-    { costCents: 0, totalTokens: 0 },
-  );
-  return {
-    sessionCount: visibleRows.length,
-    totalCost: raw.costCents / 100,
-    totalTokens: raw.totalTokens,
-  };
-}
+): StatusBarData {}
 
 // ---------------------------------------------------------------------------

[Timeout] ArrowFunction
plugins/norbert-session/domain/sessionMetricsTable.ts:389:5
   visibleRows: readonly TableRow[],
 ): StatusBarData {
   const raw = visibleRows.reduce(
-    (acc, row) => ({
-      costCents: acc.costCents + Math.round(row.cost * 100),
-      totalTokens: acc.totalTokens + row.totalTokens,
-    }),
+    () => undefined,
     { costCents: 0, totalTokens: 0 },
   );

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:390:45
 ): StatusBarData {
   const raw = visibleRows.reduce(
     (acc, row) => ({
-      costCents: acc.costCents + Math.round(row.cost * 100),
+      costCents: acc.costCents + Math.round(row.cost / 100),
       totalTokens: acc.totalTokens + row.totalTokens,
     }),

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:390:18
 ): StatusBarData {
   const raw = visibleRows.reduce(
     (acc, row) => ({
-      costCents: acc.costCents + Math.round(row.cost * 100),
+      costCents: acc.costCents - Math.round(row.cost * 100),
       totalTokens: acc.totalTokens + row.totalTokens,
     }),

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:391:20
   const raw = visibleRows.reduce(
     (acc, row) => ({
       costCents: acc.costCents + Math.round(row.cost * 100),
-      totalTokens: acc.totalTokens + row.totalTokens,
+      totalTokens: acc.totalTokens - row.totalTokens,
     }),
     { costCents: 0, totalTokens: 0 },

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:397:16
   );
   return {
     sessionCount: visibleRows.length,
-    totalCost: raw.costCents / 100,
+    totalCost: raw.costCents * 100,
     totalTokens: raw.totalTokens,
   };

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:409:9
 /** The 7 optional columns available for user selection. */
 const OPTIONAL_COLUMNS: readonly ColumnDefinition[] = [
   { id: "version", label: "Version" },
-  { id: "platform", label: "Platform" },
+  { id: "", label: "Platform" },
   { id: "inputTokens", label: "Input Tokens" },
   { id: "outputTokens", label: "Output Tokens" },

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:409:28
 /** The 7 optional columns available for user selection. */
 const OPTIONAL_COLUMNS: readonly ColumnDefinition[] = [
   { id: "version", label: "Version" },
-  { id: "platform", label: "Platform" },
+  { id: "platform", label: "" },
   { id: "inputTokens", label: "Input Tokens" },
   { id: "outputTokens", label: "Output Tokens" },

[Timeout] ObjectLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:410:3
 const OPTIONAL_COLUMNS: readonly ColumnDefinition[] = [
   { id: "version", label: "Version" },
   { id: "platform", label: "Platform" },
-  { id: "inputTokens", label: "Input Tokens" },
+  {},
   { id: "outputTokens", label: "Output Tokens" },
   { id: "cacheHitPct", label: "Cache Hit %" },

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:410:9
 const OPTIONAL_COLUMNS: readonly ColumnDefinition[] = [
   { id: "version", label: "Version" },
   { id: "platform", label: "Platform" },
-  { id: "inputTokens", label: "Input Tokens" },
+  { id: "", label: "Input Tokens" },
   { id: "outputTokens", label: "Output Tokens" },
   { id: "cacheHitPct", label: "Cache Hit %" },

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:411:9
   { id: "version", label: "Version" },
   { id: "platform", label: "Platform" },
   { id: "inputTokens", label: "Input Tokens" },
-  { id: "outputTokens", label: "Output Tokens" },
+  { id: "", label: "Output Tokens" },
   { id: "cacheHitPct", label: "Cache Hit %" },
   { id: "activeAgents", label: "Active Agents" },

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:411:32
   { id: "version", label: "Version" },
   { id: "platform", label: "Platform" },
   { id: "inputTokens", label: "Input Tokens" },
-  { id: "outputTokens", label: "Output Tokens" },
+  { id: "outputTokens", label: "" },
   { id: "cacheHitPct", label: "Cache Hit %" },
   { id: "activeAgents", label: "Active Agents" },

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:412:31
   { id: "platform", label: "Platform" },
   { id: "inputTokens", label: "Input Tokens" },
   { id: "outputTokens", label: "Output Tokens" },
-  { id: "cacheHitPct", label: "Cache Hit %" },
+  { id: "cacheHitPct", label: "" },
   { id: "activeAgents", label: "Active Agents" },
   { id: "events", label: "Events" },

[Timeout] ObjectLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:412:3
   { id: "platform", label: "Platform" },
   { id: "inputTokens", label: "Input Tokens" },
   { id: "outputTokens", label: "Output Tokens" },
-  { id: "cacheHitPct", label: "Cache Hit %" },
+  {},
   { id: "activeAgents", label: "Active Agents" },
   { id: "events", label: "Events" },

[Timeout] ObjectLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:413:3
   { id: "inputTokens", label: "Input Tokens" },
   { id: "outputTokens", label: "Output Tokens" },
   { id: "cacheHitPct", label: "Cache Hit %" },
-  { id: "activeAgents", label: "Active Agents" },
+  {},
   { id: "events", label: "Events" },
 ];

[Timeout] StringLiteral
plugins/norbert-session/domain/sessionMetricsTable.ts:414:9
   { id: "outputTokens", label: "Output Tokens" },
   { id: "cacheHitPct", label: "Cache Hit %" },
   { id: "activeAgents", label: "Active Agents" },
-  { id: "events", label: "Events" },
+  { id: "", label: "Events" },
 ];
 

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:421:76
  * Return the list of optional columns available for user selection.
  * Each column has an id and a human-readable label.
  */
-export function getAvailableOptionalColumns(): readonly ColumnDefinition[] {
-  return OPTIONAL_COLUMNS;
-}
+export function getAvailableOptionalColumns(): readonly ColumnDefinition[] {}
 
 /**

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:432:32
 export function toggleColumn(
   visibleColumns: readonly OptionalColumnId[],
   columnId: OptionalColumnId,
-): readonly OptionalColumnId[] {
-  return visibleColumns.includes(columnId)
-    ? visibleColumns.filter((id) => id !== columnId)
-    : [...visibleColumns, columnId];
-}
+): readonly OptionalColumnId[] {}
 
 /**

[Timeout] ArrowFunction
plugins/norbert-session/domain/sessionMetricsTable.ts:434:29
   columnId: OptionalColumnId,
 ): readonly OptionalColumnId[] {
   return visibleColumns.includes(columnId)
-    ? visibleColumns.filter((id) => id !== columnId)
+    ? visibleColumns.filter(() => undefined)
     : [...visibleColumns, columnId];
 }

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:434:37
   columnId: OptionalColumnId,
 ): readonly OptionalColumnId[] {
   return visibleColumns.includes(columnId)
-    ? visibleColumns.filter((id) => id !== columnId)
+    ? visibleColumns.filter((id) => id === columnId)
     : [...visibleColumns, columnId];
 }

[Timeout] BlockStatement
plugins/norbert-session/domain/sessionMetricsTable.ts:445:11
 export function formatCacheHitPct(
   cacheReadTokens: number,
   totalTokens: number,
-): string {
-  if (totalTokens === 0) return "0%";
-  const percentage = Math.round((cacheReadTokens / totalTokens) * 100);
-  return `${percentage}%`;
-}
+): string {}
 

[Timeout] EqualityOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:446:7
   cacheReadTokens: number,
   totalTokens: number,
 ): string {
-  if (totalTokens === 0) return "0%";
+  if (totalTokens !== 0) return "0%";
   const percentage = Math.round((cacheReadTokens / totalTokens) * 100);
   return `${percentage}%`;

[Timeout] ConditionalExpression
plugins/norbert-session/domain/sessionMetricsTable.ts:446:7
   cacheReadTokens: number,
   totalTokens: number,
 ): string {
-  if (totalTokens === 0) return "0%";
+  if (true) return "0%";
   const percentage = Math.round((cacheReadTokens / totalTokens) * 100);
   return `${percentage}%`;

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:447:33
   totalTokens: number,
 ): string {
   if (totalTokens === 0) return "0%";
-  const percentage = Math.round((cacheReadTokens / totalTokens) * 100);
+  const percentage = Math.round(cacheReadTokens / totalTokens / 100);
   return `${percentage}%`;
 }

[Timeout] ArithmeticOperator
plugins/norbert-session/domain/sessionMetricsTable.ts:447:34
   totalTokens: number,
 ): string {
   if (totalTokens === 0) return "0%";
-  const percentage = Math.round((cacheReadTokens / totalTokens) * 100);
+  const percentage = Math.round((cacheReadTokens * totalTokens) * 100);
   return `${percentage}%`;
 }
